[Survived] ObjectLiteral
src/sync/journal/clock.ts:19:35
 /** Nest injection token; `Clock` is an interface and erases at runtime. */
 export const CLOCK = Symbol('SyncClock')
 
-export const systemClock: Clock = {
-  nowMs: () => Date.now(),
-}
+export const systemClock: Clock = {}
 

[Survived] ArrowFunction
src/sync/journal/clock.ts:20:10
 export const CLOCK = Symbol('SyncClock')
 
 export const systemClock: Clock = {
-  nowMs: () => Date.now(),
+  nowMs: () => undefined,
 }
 
