[Killed] ArrowFunction
features/auth-otp/api/otp.ts:21:28
  * transport rather than making one, which is what keeps the rest of the site
  * off the network — see `app/__tests__/networkBoundary.spec.ts`.
  */
-export const requestCode = (http: HttpClient, email: string): Promise<GetOtpResponse> =>
-  http.post<GetOtpResponse>(Routes().otp.root(), {
-    type: OtpType.Email,
-    destination: email,
-  } satisfies GetOtpRequest)
+export const requestCode = () => undefined
 
 export const signInWithCode = (
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/features/auth-otp/__tests__/signInSession.spec.ts (4 tests | 1 failed) 199ms

   ❯ signing in with a code (4)
     × asks the server whose tokens these are, because the rows are keyed by it 38ms

[Killed] ArrowFunction
features/auth-otp/api/otp.ts:27:31
     destination: email,
   } satisfies GetOtpRequest)
 
-export const signInWithCode = (
-  http: HttpClient,
-  email: string,
-  code: string,
-): Promise<OtpSignInResponse> =>
-  http.post<OtpSignInResponse>(Routes().auth.signIn('otp'), {
-    login: email,
-    otp: code,
-  } satisfies OtpSignInRequest)
+export const signInWithCode = () => undefined
 
 /**
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/features/auth-otp/__tests__/signInSession.spec.ts (4 tests | 4 failed) 202ms
   ❯ signing in with a code (4)
     × leaves the tokens where the sync engine reads them 116ms
     × asks the server whose tokens these are, because the rows are keyed by it 35ms
     × keeps the

[Killed] StringLiteral
features/auth-otp/api/otp.ts:32:53
   email: string,
   code: string,
 ): Promise<OtpSignInResponse> =>
-  http.post<OtpSignInResponse>(Routes().auth.signIn('otp'), {
+  http.post<OtpSignInResponse>(Routes().auth.signIn(""), {
     login: email,
     otp: code,
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/features/auth-otp/__tests__/signInSession.spec.ts (4 tests | 4 failed) 217ms
   ❯ signing in with a code (4)
     × leaves the tokens where the sync engine reads them 129ms
     × asks the server whose tokens these are, because the rows are keyed by it 33ms
     × keeps the

[Killed] BlockStatement
features/auth-otp/api/otp.ts:43:73
  * Part of signing in rather than a detail of it: a session carries tokens and
  * no user id, while every row of the local database is keyed by one.
  */
-export const readOwnerId = async (http: HttpClient): Promise<UserId> => {
-  const profile = await http.get<GetProfileResponse>(Routes().auth.profile())
-  return asId<UserId>(profile.userId)
-}
+export const readOwnerId = async (http: HttpClient): Promise<UserId> => {}
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/features/auth-otp/__tests__/signInSession.spec.ts (4 tests | 2 failed) 230ms
   ❯ signing in with a code (4)
     × leaves the tokens where the sync engine reads them 131ms
     × asks the server whose tokens these are, because the rows are keyed by it 34ms
