[Survived] BlockStatement
src/app/sections.ts:34:51
 export const sectionRoutes = (): RouteRecordRaw[] =>
   [...sections, ...fallbacks].flatMap((section) => section.routes ?? [])
 
-export const installSectionMessages = (): void => {
-  addMessages(authMessages)
-  addMessages(joinMessages)
-  for (const section of sections) {
-    if (section.messages) addMessages(section.messages)
-  }
-}
+export const installSectionMessages = (): void => {}
 

[Survived] CallExpression
src/app/sections.ts:36:3
 
 export const installSectionMessages = (): void => {
   addMessages(authMessages)
-  addMessages(joinMessages)
+  ;
   for (const section of sections) {
     if (section.messages) addMessages(section.messages)

[Survived] BlockStatement
src/app/sections.ts:37:35
 export const installSectionMessages = (): void => {
   addMessages(authMessages)
   addMessages(joinMessages)
-  for (const section of sections) {
-    if (section.messages) addMessages(section.messages)
-  }
+  for (const section of sections) {}
 }
 

[Survived] CallExpression
src/app/sections.ts:38:27
   addMessages(authMessages)
   addMessages(joinMessages)
   for (const section of sections) {
-    if (section.messages) addMessages(section.messages)
+    if (section.messages) ;
   }
 }
