[Killed] BlockStatement
features/auth-otp/model/useOtpSignIn.ts:11:47
 import type { OtpStep } from '../types'
 import { CODE_LIFETIME_SECONDS, useResendCountdown } from './useResendCountdown'
 
-const reasonFor = (error: unknown): string => {
-  if (error instanceof OfflineError) return 'auth-error-offline'
-  if (error instanceof HttpError && error.status === 401) return 'auth-error-wrong-code'
-  return 'auth-error-failed'
-}
+const reasonFor = (error: unknown): string => {}
 
 /** The server refused because a code it already sent is still alive. */
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/features/auth-otp/__tests__/signInSession.spec.ts (4 tests | 1 failed) 298ms
   ❯ signing in with a code (4)
     × starts no connection when the code is refused 37ms

[Killed] ConditionalExpression
features/auth-otp/model/useOtpSignIn.ts:12:7
 import { CODE_LIFETIME_SECONDS, useResendCountdown } from './useResendCountdown'
 
 const reasonFor = (error: unknown): string => {
-  if (error instanceof OfflineError) return 'auth-error-offline'
+  if (true) return 'auth-error-offline'
   if (error instanceof HttpError && error.status === 401) return 'auth-error-wrong-code'
   return 'auth-error-failed'
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/features/auth-otp/__tests__/signInSession.spec.ts (4 tests | 1 failed) 232ms

   ❯ signing in with a code (4)

     × starts no connection when the code is refused 46ms

[Survived] ConditionalExpression
features/auth-otp/model/useOtpSignIn.ts:12:7
 import { CODE_LIFETIME_SECONDS, useResendCountdown } from './useResendCountdown'
 
 const reasonFor = (error: unknown): string => {
-  if (error instanceof OfflineError) return 'auth-error-offline'
+  if (false) return 'auth-error-offline'
   if (error instanceof HttpError && error.status === 401) return 'auth-error-wrong-code'
   return 'auth-error-failed'

[Killed] ConditionalExpression
features/auth-otp/model/useOtpSignIn.ts:13:7
 
 const reasonFor = (error: unknown): string => {
   if (error instanceof OfflineError) return 'auth-error-offline'
-  if (error instanceof HttpError && error.status === 401) return 'auth-error-wrong-code'
+  if (false) return 'auth-error-wrong-code'
   return 'auth-error-failed'
 }
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/features/auth-otp/__tests__/signInSession.spec.ts (4 tests | 1 failed) 183ms
   ❯ signing in with a code (4)
     × starts no connection when the code is refused 33ms

[Killed] EqualityOperator
features/auth-otp/model/useOtpSignIn.ts:13:37
 
 const reasonFor = (error: unknown): string => {
   if (error instanceof OfflineError) return 'auth-error-offline'
-  if (error instanceof HttpError && error.status === 401) return 'auth-error-wrong-code'
+  if (error instanceof HttpError && error.status !== 401) return 'auth-error-wrong-code'
   return 'auth-error-failed'
 }
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/features/auth-otp/__tests__/signInSession.spec.ts (4 tests | 1 failed) 226ms
   ❯ signing in with a code (4)
     × starts no connection when the code is refused 34ms

[Survived] ArrowFunction
features/auth-otp/model/useOtpSignIn.ts:18:27
 }
 
 /** The server refused because a code it already sent is still alive. */
-const isTooManyRequests = (error: unknown): boolean =>
-  error instanceof HttpError && error.status === 429
+const isTooManyRequests = () => undefined
 
 /**

[Survived] ConditionalExpression
features/auth-otp/model/useOtpSignIn.ts:19:33
 
 /** The server refused because a code it already sent is still alive. */
 const isTooManyRequests = (error: unknown): boolean =>
-  error instanceof HttpError && error.status === 429
+  error instanceof HttpError && true
 
 /**

[Survived] EqualityOperator
features/auth-otp/model/useOtpSignIn.ts:19:33
 
 /** The server refused because a code it already sent is still alive. */
 const isTooManyRequests = (error: unknown): boolean =>
-  error instanceof HttpError && error.status === 429
+  error instanceof HttpError && error.status !== 429
 
 /**

[Killed] BooleanLiteral
features/auth-otp/model/useOtpSignIn.ts:39:20
   const step = ref<OtpStep>('email')
   const email = ref('')
   const code = ref('')
-  const busy = ref(false)
+  const busy = ref(true)
   const error = ref<string | undefined>(undefined)
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/features/auth-otp/__tests__/signInSession.spec.ts (4 tests | 4 failed) 964ms
   ❯ signing in with a code (4)
     × leaves the tokens where the sync engine reads them 614ms
     × asks the server whose tokens these are, because the rows are keyed by it 28ms
     × keeps the

[Killed] BlockStatement
features/auth-otp/model/useOtpSignIn.ts:42:28
   const busy = ref(false)
   const error = ref<string | undefined>(undefined)
 
-  const send = async () => {
-    if (busy.value || email.value.trim().length === 0) return
-    busy.value = true
-    error.value = undefined
-
-    try {
-      await requestCode(http, email.value.trim())
-      countdown.start(CODE_LIFETIME_SECONDS)
-      step.value = 'code'
-    } catch (caught) {
-      // A refusal because the last code is still alive is not a failure: the
-      // student has the code already, so the screen moves on and waits.
-      if (isTooManyRequests(caught)) {
-        countdown.start(CODE_LIFETIME_SECONDS)
-        step.value = 'code'
-        error.value = 'auth-error-code-still-valid'
-      } else {
-        error.value = reasonFor(caught)
-      }
-    } finally {
-      busy.value = false
-    }
-  }
+  const send = async () => {}
 
   const submit = async (): Promise<boolean> => {
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/features/auth-otp/__tests__/signInSession.spec.ts (4 tests | 4 failed) 1542ms
   ❯ signing in with a code (4)
     × leaves the tokens where the sync engine reads them 1258ms
     × asks the server whose tokens these are, because the rows are keyed by it 185ms
     × keeps t

[Killed] EqualityOperator
features/auth-otp/model/useOtpSignIn.ts:43:23
   const error = ref<string | undefined>(undefined)
 
   const send = async () => {
-    if (busy.value || email.value.trim().length === 0) return
+    if (busy.value || email.value.trim().length !== 0) return
     busy.value = true
     error.value = undefined
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/features/auth-otp/__tests__/signInSession.spec.ts (4 tests | 4 failed) 137ms
   ❯ signing in with a code (4)
     × leaves the tokens where the sync engine reads them 83ms
     × asks the server whose tokens these are, because the rows are keyed by it 21ms
     × keeps the r

[Killed] ConditionalExpression
features/auth-otp/model/useOtpSignIn.ts:43:9
   const error = ref<string | undefined>(undefined)
 
   const send = async () => {
-    if (busy.value || email.value.trim().length === 0) return
+    if (true) return
     busy.value = true
     error.value = undefined
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/features/auth-otp/__tests__/signInSession.spec.ts (4 tests | 4 failed) 272ms

   ❯ signing in with a code (4)
     × leaves the tokens where the sync engine reads them 170ms
     × asks the server whose tokens these are, because the rows are keyed by it 52ms

[Survived] BooleanLiteral
features/auth-otp/model/useOtpSignIn.ts:44:18
 
   const send = async () => {
     if (busy.value || email.value.trim().length === 0) return
-    busy.value = true
+    busy.value = false
     error.value = undefined
 

[Killed] BlockStatement
features/auth-otp/model/useOtpSignIn.ts:47:9
     busy.value = true
     error.value = undefined
 
-    try {
-      await requestCode(http, email.value.trim())
-      countdown.start(CODE_LIFETIME_SECONDS)
-      step.value = 'code'
-    } catch (caught) {
+    try {} catch (caught) {
       // A refusal because the last code is still alive is not a failure: the
       // student has the code already, so the screen moves on and waits.
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6



 ❯ src/features/auth-otp/__tests__/signInSession.spec.ts (4 tests | 4 failed) 135ms
   ❯ signing in with a code (4)
     × leaves the tokens where the sync engine reads them 81ms
     × asks the server whose tokens these are, because the rows are keyed by it 19ms

[Survived] MethodExpression
features/auth-otp/model/useOtpSignIn.ts:48:31
     error.value = undefined
 
     try {
-      await requestCode(http, email.value.trim())
+      await requestCode(http, email.value)
       countdown.start(CODE_LIFETIME_SECONDS)
       step.value = 'code'

[Survived] CallExpression
features/auth-otp/model/useOtpSignIn.ts:49:7
 
     try {
       await requestCode(http, email.value.trim())
-      countdown.start(CODE_LIFETIME_SECONDS)
+      ;
       step.value = 'code'
     } catch (caught) {

[Survived] BlockStatement
features/auth-otp/model/useOtpSignIn.ts:51:22
       await requestCode(http, email.value.trim())
       countdown.start(CODE_LIFETIME_SECONDS)
       step.value = 'code'
-    } catch (caught) {
-      // A refusal because the last code is still alive is not a failure: the
-      // student has the code already, so the screen moves on and waits.
-      if (isTooManyRequests(caught)) {
-        countdown.start(CODE_LIFETIME_SECONDS)
-        step.value = 'code'
-        error.value = 'auth-error-code-still-valid'
-      } else {
-        error.value = reasonFor(caught)
-      }
-    } finally {
+    } catch (caught) {} finally {
       busy.value = false
     }

[Survived] ConditionalExpression
features/auth-otp/model/useOtpSignIn.ts:54:11
     } catch (caught) {
       // A refusal because the last code is still alive is not a failure: the
       // student has the code already, so the screen moves on and waits.
-      if (isTooManyRequests(caught)) {
+      if (false) {
         countdown.start(CODE_LIFETIME_SECONDS)
         step.value = 'code'

[Survived] BlockStatement
features/auth-otp/model/useOtpSignIn.ts:54:38
     } catch (caught) {
       // A refusal because the last code is still alive is not a failure: the
       // student has the code already, so the screen moves on and waits.
-      if (isTooManyRequests(caught)) {
-        countdown.start(CODE_LIFETIME_SECONDS)
-        step.value = 'code'
-        error.value = 'auth-error-code-still-valid'
-      } else {
+      if (isTooManyRequests(caught)) {} else {
         error.value = reasonFor(caught)
       }

[Survived] CallExpression
features/auth-otp/model/useOtpSignIn.ts:55:9
       // A refusal because the last code is still alive is not a failure: the
       // student has the code already, so the screen moves on and waits.
       if (isTooManyRequests(caught)) {
-        countdown.start(CODE_LIFETIME_SECONDS)
+        ;
         step.value = 'code'
         error.value = 'auth-error-code-still-valid'

[Survived] BlockStatement
features/auth-otp/model/useOtpSignIn.ts:58:14
         countdown.start(CODE_LIFETIME_SECONDS)
         step.value = 'code'
         error.value = 'auth-error-code-still-valid'
-      } else {
-        error.value = reasonFor(caught)
-      }
+      } else {}
     } finally {
       busy.value = false

[Killed] BlockStatement
features/auth-otp/model/useOtpSignIn.ts:61:15
       } else {
         error.value = reasonFor(caught)
       }
-    } finally {
-      busy.value = false
-    }
+    } finally {}
   }
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/features/auth-otp/__tests__/signInSession.spec.ts (4 tests | 4 failed) 626ms
   ❯ signing in with a code (4)
     × leaves the tokens where the sync engine reads them 439ms
     × asks the server whose tokens these are, because the rows are keyed by it 89ms
     × keeps the

[Killed] BooleanLiteral
features/auth-otp/model/useOtpSignIn.ts:62:20
         error.value = reasonFor(caught)
       }
     } finally {
-      busy.value = false
+      busy.value = true
     }
   }
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/features/auth-otp/__tests__/signInSession.spec.ts (4 tests | 4 failed) 202ms
   ❯ signing in with a code (4)
     × leaves the tokens where the sync engine reads them 120ms
     × asks the server whose tokens these are, because the rows are keyed by it 33ms
     × keeps the

[Killed] BlockStatement
features/auth-otp/model/useOtpSignIn.ts:66:48
     }
   }
 
-  const submit = async (): Promise<boolean> => {
-    if (busy.value || code.value.trim().length === 0) return false
-    busy.value = true
-    error.value = undefined
-
-    try {
-      const tokens = await signInWithCode(http, email.value.trim(), code.value.trim())
-
-      // Offered first so the next request carries them, and only then made a
-      // connection: what makes it one is the identity the server answers with.
-      connection.offer(tokens)
-      connection.signIn(await readOwnerId(http))
-
-      countdown.stop()
-      return true
-    } catch (caught) {
-      error.value = reasonFor(caught)
-      return false
-    } finally {
-      busy.value = false
-    }
-  }
+  const submit = async (): Promise<boolean> => {}
 
   return { step, email, code, busy, error, countdown, send, submit }
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6



 ❯ src/features/auth-otp/__tests__/signInSession.spec.ts (4 tests | 4 failed) 186ms
   ❯ signing in with a code (4)
     × leaves the tokens where the sync engine reads them 112ms
     × asks the server whose tokens these are, because the rows are keyed by it 26ms

[Killed] ConditionalExpression
features/auth-otp/model/useOtpSignIn.ts:67:9
   }
 
   const submit = async (): Promise<boolean> => {
-    if (busy.value || code.value.trim().length === 0) return false
+    if (true) return false
     busy.value = true
     error.value = undefined
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/features/auth-otp/__tests__/signInSession.spec.ts (4 tests | 4 failed) 177ms
   ❯ signing in with a code (4)
     × leaves the tokens where the sync engine reads them 105ms
     × asks the server whose tokens these are, because the rows are keyed by it 28ms
     × keeps the

[Killed] EqualityOperator
features/auth-otp/model/useOtpSignIn.ts:67:23
   }
 
   const submit = async (): Promise<boolean> => {
-    if (busy.value || code.value.trim().length === 0) return false
+    if (busy.value || code.value.trim().length !== 0) return false
     busy.value = true
     error.value = undefined
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/features/auth-otp/__tests__/signInSession.spec.ts (4 tests | 4 failed) 172ms

   ❯ signing in with a code (4)
     × leaves the tokens where the sync engine reads them 99ms
     × asks the server whose tokens these are, because the rows are keyed by it 27ms

[Survived] BooleanLiteral
features/auth-otp/model/useOtpSignIn.ts:68:18
 
   const submit = async (): Promise<boolean> => {
     if (busy.value || code.value.trim().length === 0) return false
-    busy.value = true
+    busy.value = false
     error.value = undefined
 

[Killed] BlockStatement
features/auth-otp/model/useOtpSignIn.ts:71:9
     busy.value = true
     error.value = undefined
 
-    try {
-      const tokens = await signInWithCode(http, email.value.trim(), code.value.trim())
-
-      // Offered first so the next request carries them, and only then made a
-      // connection: what makes it one is the identity the server answers with.
-      connection.offer(tokens)
-      connection.signIn(await readOwnerId(http))
-
-      countdown.stop()
-      return true
-    } catch (caught) {
+    try {} catch (caught) {
       error.value = reasonFor(caught)
       return false
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6



 ❯ src/features/auth-otp/__tests__/signInSession.spec.ts (4 tests | 4 failed) 183ms
   ❯ signing in with a code (4)
     × leaves the tokens where the sync engine reads them 111ms
     × asks the server whose tokens these are, because the rows are keyed by it 27ms

[Survived] MethodExpression
features/auth-otp/model/useOtpSignIn.ts:72:69
     error.value = undefined
 
     try {
-      const tokens = await signInWithCode(http, email.value.trim(), code.value.trim())
+      const tokens = await signInWithCode(http, email.value.trim(), code.value)
 
       // Offered first so the next request carries them, and only then made a

[Survived] MethodExpression
features/auth-otp/model/useOtpSignIn.ts:72:49
     error.value = undefined
 
     try {
-      const tokens = await signInWithCode(http, email.value.trim(), code.value.trim())
+      const tokens = await signInWithCode(http, email.value, code.value.trim())
 
       // Offered first so the next request carries them, and only then made a

[Killed] CallExpression
features/auth-otp/model/useOtpSignIn.ts:76:7
 
       // Offered first so the next request carries them, and only then made a
       // connection: what makes it one is the identity the server answers with.
-      connection.offer(tokens)
+      ;
       connection.signIn(await readOwnerId(http))
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/features/auth-otp/__tests__/signInSession.spec.ts (4 tests | 2 failed) 217ms
   ❯ signing in with a code (4)
     × leaves the tokens where the sync engine reads them 122ms
     × keeps the refresh token for the next visit, and not the access token 31ms

[Killed] CallExpression
features/auth-otp/model/useOtpSignIn.ts:77:7
       // Offered first so the next request carries them, and only then made a
       // connection: what makes it one is the identity the server answers with.
       connection.offer(tokens)
-      connection.signIn(await readOwnerId(http))
+      ;
 
       countdown.stop()
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6



 ❯ src/features/auth-otp/__tests__/signInSession.spec.ts (4 tests | 3 failed) 209ms
   ❯ signing in with a code (4)

     × leaves the tokens where the sync engine reads them 115ms

[Survived] CallExpression
features/auth-otp/model/useOtpSignIn.ts:79:7
       connection.offer(tokens)
       connection.signIn(await readOwnerId(http))
 
-      countdown.stop()
+      ;
       return true
     } catch (caught) {

[Killed] BooleanLiteral
features/auth-otp/model/useOtpSignIn.ts:80:14
       connection.signIn(await readOwnerId(http))
 
       countdown.stop()
-      return true
+      return false
     } catch (caught) {
       error.value = reasonFor(caught)
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/features/auth-otp/__tests__/signInSession.spec.ts (4 tests | 1 failed) 220ms
   ❯ signing in with a code (4)
     × leaves the tokens where the sync engine reads them 131ms

[Killed] BlockStatement
features/auth-otp/model/useOtpSignIn.ts:81:22
 
       countdown.stop()
       return true
-    } catch (caught) {
-      error.value = reasonFor(caught)
-      return false
-    } finally {
+    } catch (caught) {} finally {
       busy.value = false
     }
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/features/auth-otp/__tests__/signInSession.spec.ts (4 tests | 1 failed) 215ms
   ❯ signing in with a code (4)
     × starts no connection when the code is refused 31ms

[Killed] BooleanLiteral
features/auth-otp/model/useOtpSignIn.ts:83:14
       return true
     } catch (caught) {
       error.value = reasonFor(caught)
-      return false
+      return true
     } finally {
       busy.value = false
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/features/auth-otp/__tests__/signInSession.spec.ts (4 tests | 1 failed) 233ms
   ❯ signing in with a code (4)
     × starts no connection when the code is refused 36ms

[Survived] BlockStatement
features/auth-otp/model/useOtpSignIn.ts:84:15
     } catch (caught) {
       error.value = reasonFor(caught)
       return false
-    } finally {
-      busy.value = false
-    }
+    } finally {}
   }
 

[Killed] ObjectLiteral
features/auth-otp/model/useOtpSignIn.ts:89:10
     }
   }
 
-  return { step, email, code, busy, error, countdown, send, submit }
+  return {}
 }
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


stderr | src/features/auth-otp/__tests__/signInSession.spec.ts > signing in with a code > leaves the tokens where the sync engine reads them
[Vue warn]: Invalid vnode type when creating vnode: undefined.
