[Killed] BlockStatement
features/auth-otp/model/useResendCountdown.ts:20:22
   const remaining = ref(0)
   let scheduled: Scheduled | undefined
 
-  const stop = () => {
-    scheduled?.cancel()
-    scheduled = undefined
-  }
+  const stop = () => {}
 
   // One second at a time rather than an interval: the port schedules a single
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


stderr | src/features/auth-otp/__tests__/useResendCountdown.spec.ts > useResendCountdown > starts again from the top, without the old count still running
[Vue warn] onScopeDispose() is called when there is no active effect scope to be associated with.


stderr | src/features/auth-o

[Killed] OptionalChaining
features/auth-otp/model/useResendCountdown.ts:21:5
   let scheduled: Scheduled | undefined
 
   const stop = () => {
-    scheduled?.cancel()
+    scheduled.cancel()
     scheduled = undefined
   }
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


stderr | src/features/auth-otp/__tests__/useResendCountdown.spec.ts > useResendCountdown > counts down one second at a time
[Vue warn] onScopeDispose() is called when there is no active effect scope to be associated with.

stderr | src/features/auth-otp/__tests__/useResendCountdown

[Killed] BlockStatement
features/auth-otp/model/useResendCountdown.ts:28:22
   // One second at a time rather than an interval: the port schedules a single
   // piece of work, and a countdown that re-arms itself stops on the tick that
   // reaches zero instead of on the one after it.
-  const tick = () => {
-    remaining.value -= 1
-    if (remaining.value > 0) scheduled = clock.schedule(tick, 1000)
-    else stop()
-  }
+  const tick = () => {}
 
   const start = (seconds: number = CODE_LIFETIME_SECONDS) => {
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


stderr | src/features/auth-otp/__tests__/useResendCountdown.spec.ts > useResendCountdown > counts down one second at a time
[Vue warn] onScopeDispose() is called when there is no active effect scope to be associated with.

stderr | src/features/auth-otp/__tests__/useResendCountdown

[Killed] AssignmentOperator
features/auth-otp/model/useResendCountdown.ts:29:5
   // piece of work, and a countdown that re-arms itself stops on the tick that
   // reaches zero instead of on the one after it.
   const tick = () => {
-    remaining.value -= 1
+    remaining.value += 1
     if (remaining.value > 0) scheduled = clock.schedule(tick, 1000)
     else stop()
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


stderr | src/features/auth-otp/__tests__/useResendCountdown.spec.ts > useResendCountdown > counts down one second at a time
[Vue warn] onScopeDispose() is called when there is no active effect scope to be associated with.

stderr | src/features/auth-otp/__tests__/useResendCountdown

[Killed] EqualityOperator
features/auth-otp/model/useResendCountdown.ts:30:9
   // reaches zero instead of on the one after it.
   const tick = () => {
     remaining.value -= 1
-    if (remaining.value > 0) scheduled = clock.schedule(tick, 1000)
+    if (remaining.value >= 0) scheduled = clock.schedule(tick, 1000)
     else stop()
   }
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


stderr | src/features/auth-otp/__tests__/useResendCountdown.spec.ts > useResendCountdown > stops itself at zero rather than counting past it
[Vue warn] onScopeDispose() is called when there is no active effect scope to be associated with.


 ❯ src/features/auth-otp/__tests__/useRes

[Killed] ConditionalExpression
features/auth-otp/model/useResendCountdown.ts:30:9
   // reaches zero instead of on the one after it.
   const tick = () => {
     remaining.value -= 1
-    if (remaining.value > 0) scheduled = clock.schedule(tick, 1000)
+    if (false) scheduled = clock.schedule(tick, 1000)
     else stop()
   }
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


stderr | src/features/auth-otp/__tests__/useResendCountdown.spec.ts > useResendCountdown > counts down one second at a time
[Vue warn] onScopeDispose() is called when there is no active effect scope to be associated with.

stderr | src/features/auth-otp/__tests__/useResendCountdown

[Survived] CallExpression
features/auth-otp/model/useResendCountdown.ts:31:10
   const tick = () => {
     remaining.value -= 1
     if (remaining.value > 0) scheduled = clock.schedule(tick, 1000)
-    else stop()
+    else ;
   }
 

[Killed] BlockStatement
features/auth-otp/model/useResendCountdown.ts:34:62
     else stop()
   }
 
-  const start = (seconds: number = CODE_LIFETIME_SECONDS) => {
-    stop()
-    remaining.value = seconds
-    if (seconds > 0) scheduled = clock.schedule(tick, 1000)
-  }
+  const start = (seconds: number = CODE_LIFETIME_SECONDS) => {}
 
   const canResend = computed(() => remaining.value <= 0)
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


stderr | src/features/auth-otp/__tests__/useResendCountdown.spec.ts > useResendCountdown > counts down one second at a time
[Vue warn] onScopeDispose() is called when there is no active effect scope to be associated with.

stderr | src/features/auth-otp/__tests__/useResendCountdown

[Killed] CallExpression
features/auth-otp/model/useResendCountdown.ts:35:5
   }
 
   const start = (seconds: number = CODE_LIFETIME_SECONDS) => {
-    stop()
+    ;
     remaining.value = seconds
     if (seconds > 0) scheduled = clock.schedule(tick, 1000)
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


stderr | src/features/auth-otp/__tests__/useResendCountdown.spec.ts > useResendCountdown > starts again from the top, without the old count still running
[Vue warn] onScopeDispose() is called when there is no active effect scope to be associated with.


 ❯ src/features/auth-otp/__t

[Killed] EqualityOperator
features/auth-otp/model/useResendCountdown.ts:37:9
   const start = (seconds: number = CODE_LIFETIME_SECONDS) => {
     stop()
     remaining.value = seconds
-    if (seconds > 0) scheduled = clock.schedule(tick, 1000)
+    if (seconds <= 0) scheduled = clock.schedule(tick, 1000)
   }
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


stderr | src/features/auth-otp/__tests__/useResendCountdown.spec.ts > useResendCountdown > counts down one second at a time
[Vue warn] onScopeDispose() is called when there is no active effect scope to be associated with.

stderr | src/features/auth-otp/__tests__/useResendCountdown

[Killed] ConditionalExpression
features/auth-otp/model/useResendCountdown.ts:37:9
   const start = (seconds: number = CODE_LIFETIME_SECONDS) => {
     stop()
     remaining.value = seconds
-    if (seconds > 0) scheduled = clock.schedule(tick, 1000)
+    if (false) scheduled = clock.schedule(tick, 1000)
   }
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


stderr | src/features/auth-otp/__tests__/useResendCountdown.spec.ts > useResendCountdown > counts down one second at a time
[Vue warn] onScopeDispose() is called when there is no active effect scope to be associated with.

[Killed] EqualityOperator
features/auth-otp/model/useResendCountdown.ts:40:36
     if (seconds > 0) scheduled = clock.schedule(tick, 1000)
   }
 
-  const canResend = computed(() => remaining.value <= 0)
+  const canResend = computed(() => remaining.value > 0)
 
   const label = computed(() => {
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6



stderr | src/features/auth-otp/__tests__/useResendCountdown.spec.ts > useResendCountdown > refuses another code until the wait is over
[Vue warn] onScopeDispose() is called when there is no active effect scope to be associated with.

[Killed] ConditionalExpression
features/auth-otp/model/useResendCountdown.ts:40:36
     if (seconds > 0) scheduled = clock.schedule(tick, 1000)
   }
 
-  const canResend = computed(() => remaining.value <= 0)
+  const canResend = computed(() => true)
 
   const label = computed(() => {
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6



stderr | src/features/auth-otp/__tests__/useResendCountdown.spec.ts > useResendCountdown > refuses another code until the wait is over
[Vue warn] onScopeDispose() is called when there is no active effect scope to be associated with.

[Killed] BlockStatement
features/auth-otp/model/useResendCountdown.ts:42:32
 
   const canResend = computed(() => remaining.value <= 0)
 
-  const label = computed(() => {
-    const minutes = Math.floor(remaining.value / 60)
-    const seconds = remaining.value % 60
-    return `${minutes}:${String(seconds).padStart(2, '0')}`
-  })
+  const label = computed(() => {})
 
   onScopeDispose(stop)
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6



stderr | src/features/auth-otp/__tests__/useResendCountdown.spec.ts > useResendCountdown > reads the wait as minutes and seconds
[Vue warn] onScopeDispose() is called when there is no active effect scope to be associated with.

[Killed] ArithmeticOperator
features/auth-otp/model/useResendCountdown.ts:43:32
   const canResend = computed(() => remaining.value <= 0)
 
   const label = computed(() => {
-    const minutes = Math.floor(remaining.value / 60)
+    const minutes = Math.floor(remaining.value * 60)
     const seconds = remaining.value % 60
     return `${minutes}:${String(seconds).padStart(2, '0')}`
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


stderr | src/features/auth-otp/__tests__/useResendCountdown.spec.ts > useResendCountdown > reads the wait as minutes and seconds
[Vue warn] onScopeDispose() is called when there is no active effect scope to be associated with.


 ❯ src/features/auth-otp/__tests__/useResendCountdown

[Killed] ArithmeticOperator
features/auth-otp/model/useResendCountdown.ts:44:21
 
   const label = computed(() => {
     const minutes = Math.floor(remaining.value / 60)
-    const seconds = remaining.value % 60
+    const seconds = remaining.value * 60
     return `${minutes}:${String(seconds).padStart(2, '0')}`
   })
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


stderr | src/features/auth-otp/__tests__/useResendCountdown.spec.ts > useResendCountdown > reads the wait as minutes and seconds
[Vue warn] onScopeDispose() is called when there is no active effect scope to be associated with.


 ❯ src/features/auth-otp/__tests__/useResendCountdown

[Killed] StringLiteral
features/auth-otp/model/useResendCountdown.ts:45:54
   const label = computed(() => {
     const minutes = Math.floor(remaining.value / 60)
     const seconds = remaining.value % 60
-    return `${minutes}:${String(seconds).padStart(2, '0')}`
+    return `${minutes}:${String(seconds).padStart(2, "")}`
   })
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


stderr | src/features/auth-otp/__tests__/useResendCountdown.spec.ts > useResendCountdown > reads the wait as minutes and seconds
[Vue warn] onScopeDispose() is called when there is no active effect scope to be associated with.


 ❯ src/features/auth-otp/__tests__/useResendCountdown

[Survived] CallExpression
features/auth-otp/model/useResendCountdown.ts:48:3
     return `${minutes}:${String(seconds).padStart(2, '0')}`
   })
 
-  onScopeDispose(stop)
+  ;
 
   return { remaining, canResend, label, start, stop }

[Killed] ObjectLiteral
features/auth-otp/model/useResendCountdown.ts:50:10
 
   onScopeDispose(stop)
 
-  return { remaining, canResend, label, start, stop }
+  return {}
 }
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


stderr | src/features/auth-otp/__tests__/useResendCountdown.spec.ts > useResendCountdown > counts down one second at a time
[Vue warn] onScopeDispose() is called when there is no active effect scope to be associated with.


stderr | src/features/auth-otp/__tests__/useResendCountdow
