[Killed] EqualityOperator
src/app/sync.ts:55:9
   const swap = async (connection: Connection | undefined): Promise<void> => {
     running?.stop()
     running = undefined
-    if (connection === undefined) return
+    if (connection !== undefined) return
 
     running = await startSiteSync(options, connection)
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/sync.spec.ts (6 tests | 4 failed) 5400ms
   ❯ the engine of the writing tab (6)
     × runs as soon as there is a connection to run over 1144ms
     × tells the screens a run has completed, so an empty list means empty 1060ms
     × runs again when the network

[Killed] ObjectLiteral
src/app/sync.ts:85:35
   const status = useSiteStatus()
   const deviceId = new LocalStorageDeviceId()
 
-  const engine = createSyncEngine({
-    db,
-    client: createHttpSyncClient({ http }),
-    deviceId: () => deviceId.current(),
-    ownerId: () => connection.ownerId,
-    now: () => toIsoDateTime(new Date()),
-    nowMs: () => Date.now(),
-    random: () => Math.random(),
-    refreshToken: () => renewSession(http),
-  })
+  const engine = createSyncEngine({})
 
   let stopped = false
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/sync.spec.ts (6 tests | 4 failed) 6262ms
   ❯ the engine of the writing tab (6)
     × runs as soon as there is a connection to run over 1411ms
     × tells the screens a run has completed, so an empty list means empty 1549ms
     × runs again when the network

[Killed] ObjectLiteral
src/app/sync.ts:87:34
 
   const engine = createSyncEngine({
     db,
-    client: createHttpSyncClient({ http }),
+    client: createHttpSyncClient({}),
     deviceId: () => deviceId.current(),
     ownerId: () => connection.ownerId,
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/sync.spec.ts (6 tests | 4 failed) 7475ms
   ❯ the engine of the writing tab (6)
     × runs as soon as there is a connection to run over 1707ms
     × tells the screens a run has completed, so an empty list means empty 1419ms
     × runs again when the network

[Killed] BooleanLiteral
src/app/sync.ts:99:20
   let stopped = false
 
   const run = async (): Promise<void> => {
-    if (stopped || !network.isOnline()) return
+    if (stopped || network.isOnline()) return
 
     status.runStarted()
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/sync.spec.ts (6 tests | 5 failed) 5567ms
   ❯ the engine of the writing tab (6)
     × runs as soon as there is a connection to run over 1274ms
     × tells the screens a run has completed, so an empty list means empty 1273ms
     × does not spend a request whe

[Killed] OptionalChaining
src/app/sync.ts:103:24
 
     status.runStarted()
     const result = await engine.runner.run()
-    status.runFinished(result.pull?.applied ?? 0, result.outcome === 'completed')
+    status.runFinished(result.pull.applied ?? 0, result.outcome === 'completed')
   }
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


⎯⎯⎯⎯⎯⎯ Unhandled Errors ⎯⎯⎯⎯⎯⎯

Vitest caught 1 unhandled error during the test run.
This might cause false positive tests. Resolve unhandled errors to make sure your tests are not affected.

[Killed] ArrowFunction
src/app/sync.ts:111:29
   // Joining a school changes what the server will send, and a tab is never
   // woken in the background: without this the catalogue would arrive at the
   // next reload rather than at the moment somebody joined.
-  useSyncRuns().adoptRunner(() => void run())
+  useSyncRuns().adoptRunner(() => undefined)
 
   // A database that already holds scope positions was filled by a run on some
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-dqpDW6



 ❯ src/app/__tests__/sync.spec.ts (8 tests | 1 failed) 3772ms
   ❯ the engine of the writing tab (8)
     × lets a screen ask for a run, for the school somebody has just joined 1260ms

[Killed] BlockStatement
src/app/sync.ts:122:17
 
   return {
     engine,
-    stop: () => {
-      stopped = true
-      offOnline()
-      useSyncRuns().adoptRunner(undefined)
-    },
+    stop: () => {},
   }
 }
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-dqpDW6


 ❯ src/app/__tests__/sync.spec.ts (8 tests | 2 failed) 3250ms
   ❯ the engine of the writing tab (8)
     × takes the run back when the engine stops, rather than leaving a dead one 483ms
     × stops the engine when the student signs out 333ms

[Killed] CallExpression
src/app/sync.ts:125:7
     stop: () => {
       stopped = true
       offOnline()
-      useSyncRuns().adoptRunner(undefined)
+      ;
     },
   }
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-dqpDW6



 ❯ src/app/__tests__/sync.spec.ts (8 tests | 1 failed) 2929ms

   ❯ the engine of the writing tab (8)

[Survived] EqualityOperator
src/app/sync.ts:133:10
 /** Whether this machine has ever read anything from the server. */
 export const hasSynced = async (engine: SyncEngine): Promise<boolean> => {
   const scopes = await engine.state.listScopes()
-  return scopes.length > 0
+  return scopes.length >= 0
 }
 
