[Killed] ObjectLiteral
src/pages/login/routes.ts:8:3
  * account if there is none. There is no second form for that.
  */
 export const routes: RouteRecordRaw[] = [
-  {
-    path: '/login',
-    name: 'login',
-    component: () => import('./ui/LoginPage.vue'),
-    meta: { public: true, chrome: false },
-  },
+  {},
 ]
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/guards.spec.ts (7 tests | 2 failed) 386ms
   ❯ who is let where (7)
     × sends a visitor with no session to sign in, carrying where they were going 65ms
     × keeps a signed-in student off the sign-in screen 34ms

[Killed] ArrowFunction
src/pages/login/routes.ts:11:16
   {
     path: '/login',
     name: 'login',
-    component: () => import('./ui/LoginPage.vue'),
+    component: () => undefined,
     meta: { public: true, chrome: false },
   },
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6



stderr | src/app/__tests__/guards.spec.ts > who is let where > sends a visitor with no session to sign in, carrying where they were going
[Vue Router warn]: uncaught error during route navigation:
TypeError: Cannot use 'in' operator to search for 'catch' in undefined

[Survived] BooleanLiteral
src/pages/login/routes.ts:12:35
     path: '/login',
     name: 'login',
     component: () => import('./ui/LoginPage.vue'),
-    meta: { public: true, chrome: false },
+    meta: { public: true, chrome: true },
   },
 ]

[Timeout] BooleanLiteral
src/pages/login/routes.ts:12:21
     path: '/login',
     name: 'login',
     component: () => import('./ui/LoginPage.vue'),
-    meta: { public: true, chrome: false },
+    meta: { public: false, chrome: false },
   },
 ]
