[Killed] BooleanLiteral
src/shared/status/useSiteStatus.ts:11:22
   const firstRunCompleted = ref(false)
   const done = ref(0)
   const writing = ref(false)
-  const joined = ref(false)
+  const joined = ref(true)
   const storage = ref<StorageDurability>('unknown')
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-dqpDW6


 ❯ src/pages/learning/__tests__/LearningPage.spec.ts (4 tests | 1 failed) 975ms
   ❯ the learning screen with nothing on it (4)
     × says nobody invited them once a finished run has found no school 162ms

[Survived] StringLiteral
src/shared/status/useSiteStatus.ts:12:42
   const done = ref(0)
   const writing = ref(false)
   const joined = ref(false)
-  const storage = ref<StorageDurability>('unknown')
+  const storage = ref<StorageDurability>("")
 
   const runStarted = () => {

[Killed] ObjectLiteral
src/shared/status/useSiteStatus.ts:24:10
     if (completed) firstRunCompleted.value = true
   }
 
-  return {
-    syncing: computed(() => inFlight.value > 0),
-    firstRunCompleted,
-    done,
-    writing,
-    joined,
-    storage,
-    runStarted,
-    runFinished,
-    markFilled: () => {
-      firstRunCompleted.value = true
-    },
-    markJoined: () => {
-      joined.value = true
-    },
-    markWriting: (isWriting: boolean) => {
-      writing.value = isWriting
-    },
-    markStorage: (durability: StorageDurability) => {
-      storage.value = durability
-    },
-  }
+  return {}
 })
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-dqpDW6



 ❯ src/features/join-school/__tests__/useJoinSchool.spec.ts (10 tests | 3 failed) 702ms
   ❯ arriving by a school link (10)
     × joins as the signed-in student and names the school by its identifier 94ms
     × asks for a run at once, so the catalogue does not wait for a reload

[Killed] BlockStatement
src/shared/status/useSiteStatus.ts:36:23
     markFilled: () => {
       firstRunCompleted.value = true
     },
-    markJoined: () => {
-      joined.value = true
-    },
+    markJoined: () => {},
     markWriting: (isWriting: boolean) => {
       writing.value = isWriting
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-dqpDW6


 ❯ src/features/join-school/__tests__/useJoinSchool.spec.ts (10 tests | 1 failed) 236ms
   ❯ arriving by a school link (10)
     × asks for a run at once, so the catalogue does not wait for a reload 64ms

[Killed] BooleanLiteral
src/shared/status/useSiteStatus.ts:37:22
       firstRunCompleted.value = true
     },
     markJoined: () => {
-      joined.value = true
+      joined.value = false
     },
     markWriting: (isWriting: boolean) => {
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-dqpDW6


 ❯ src/features/join-school/__tests__/useJoinSchool.spec.ts (10 tests | 1 failed) 746ms
   ❯ arriving by a school link (10)
     × asks for a run at once, so the catalogue does not wait for a reload 259ms
