[Killed] ArrowFunction
src/app/localData.ts:13:26
  * by it. A repository holding the empty owner would answer every screen with
  * nothing and look exactly like a school that has not arrived.
  */
-export const schoolsOf = (db: IDatabase): ISchoolRepository =>
-  createSqlSchoolRepository({
-    db,
-    ownerId: () => useConnection().connection.value?.ownerId ?? '',
-  })
+export const schoolsOf = () => undefined
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon


 ❯ src/app/__tests__/localData.spec.ts (2 tests | 2 failed) 608ms
   ❯ the local reads handed to the screens (2)
     × reads under whoever is signed in at the time of the read 600ms
     × names no owner at all while nobody is signed in 2ms

[Killed] LogicalOperator
src/app/localData.ts:16:20
 export const schoolsOf = (db: IDatabase): ISchoolRepository =>
   createSqlSchoolRepository({
     db,
-    ownerId: () => useConnection().connection.value?.ownerId ?? '',
+    ownerId: () => useConnection().connection.value?.ownerId && '',
   })
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon


 ❯ src/app/__tests__/localData.spec.ts (2 tests | 2 failed) 531ms

   ❯ the local reads handed to the screens (2)
     × reads under whoever is signed in at the time of the read 380ms
     × names no owner at all while nobody is signed in 20ms

[Killed] ArrowFunction
src/app/localData.ts:16:14
 export const schoolsOf = (db: IDatabase): ISchoolRepository =>
   createSqlSchoolRepository({
     db,
-    ownerId: () => useConnection().connection.value?.ownerId ?? '',
+    ownerId: () => undefined,
   })
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon


 ❯ src/app/__tests__/localData.spec.ts (2 tests | 2 failed) 1108ms
   ❯ the local reads handed to the screens (2)
     × reads under whoever is signed in at the time of the read 1057ms
     × names no owner at all while nobody is signed in 24ms
