[Killed] ArrowFunction
features/join-school/api/joining.ts:15:30
  * here is asked again: the catalogue, the courses and the lessons all come
  * down with the rest — see `app/__tests__/networkBoundary.spec.ts`.
  */
-export const resolveSchool = (http: HttpClient, code: string): Promise<ResolveSchoolResponse> =>
-  http.get<ResolveSchoolResponse>(Routes().join.resolve(code))
+export const resolveSchool = () => undefined
 
 /** The body `AddUserSchoolsRequest` describes; the wire has no shared type for it. */
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon


 ❯ src/features/join-school/__tests__/useJoinSchool.spec.ts (10 tests | 9 failed) 1985ms
   ❯ arriving by a school link (10)
     × asks the public resolve for the card, with the code as it was printed 1433ms
     × says the link leads nowhere when no school holds the code 195ms

[Killed] BlockStatement
features/join-school/api/joining.ts:28:21
   http: HttpClient,
   userId: UserId,
   schoolId: SchoolId,
-): Promise<void> => {
-  await http.post(Routes().edu.user(userId).schools.create(), {
-    schoolId,
-  } satisfies JoinSchoolBody)
-}
+): Promise<void> => {}
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon


 ❯ src/features/join-school/__tests__/useJoinSchool.spec.ts (10 tests | 3 failed) 2122ms
   ❯ arriving by a school link (10)
     × joins as the signed-in student and names the school by its identifier 332ms
     × says the school takes no students yet rather than showing a refusal
