[Killed] BooleanLiteral
features/join-school/model/joinNotice.ts:11:77
  * things to do next, and only one of the three is worth trying again.
  */
 const NOTICES: Partial<Record<JoinStage, JoinNotice>> = {
-  unknown: { title: 'join-unknown-title', text: 'join-unknown-text', retry: false },
+  unknown: { title: 'join-unknown-title', text: 'join-unknown-text', retry: true },
   closed: { title: 'join-closed-title', text: 'join-closed-text', retry: false },
   failed: { title: 'join-failed-title', text: 'join-failed-text', retry: true },
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon


 ❯ src/features/join-school/__tests__/JoinPanel.spec.ts (8 tests | 1 failed) 403ms
   ❯ the school page behind a joining link (8)
     × says a code nobody holds leads nowhere, and offers no way to join 47ms

[Killed] BooleanLiteral
features/join-school/model/joinNotice.ts:12:74
  */
 const NOTICES: Partial<Record<JoinStage, JoinNotice>> = {
   unknown: { title: 'join-unknown-title', text: 'join-unknown-text', retry: false },
-  closed: { title: 'join-closed-title', text: 'join-closed-text', retry: false },
+  closed: { title: 'join-closed-title', text: 'join-closed-text', retry: true },
   failed: { title: 'join-failed-title', text: 'join-failed-text', retry: true },
 }
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon



 ❯ src/features/join-school/__tests__/JoinPanel.spec.ts (8 tests | 1 failed) 339ms
   ❯ the school page behind a joining link (8)
     × explains a school that takes no students in words, never as a code 49ms

[Killed] ObjectLiteral
features/join-school/model/joinNotice.ts:12:11
  */
 const NOTICES: Partial<Record<JoinStage, JoinNotice>> = {
   unknown: { title: 'join-unknown-title', text: 'join-unknown-text', retry: false },
-  closed: { title: 'join-closed-title', text: 'join-closed-text', retry: false },
+  closed: {},
   failed: { title: 'join-failed-title', text: 'join-failed-text', retry: true },
 }
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon


 ❯ src/features/join-school/__tests__/JoinPanel.spec.ts (8 tests | 1 failed) 1697ms
   ❯ the school page behind a joining link (8)
     × explains a school that takes no students in words, never as a code 179ms

[Killed] BooleanLiteral
features/join-school/model/joinNotice.ts:13:74
 const NOTICES: Partial<Record<JoinStage, JoinNotice>> = {
   unknown: { title: 'join-unknown-title', text: 'join-unknown-text', retry: false },
   closed: { title: 'join-closed-title', text: 'join-closed-text', retry: false },
-  failed: { title: 'join-failed-title', text: 'join-failed-text', retry: true },
+  failed: { title: 'join-failed-title', text: 'join-failed-text', retry: false },
 }
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon


 ❯ src/features/join-school/__tests__/JoinPanel.spec.ts (8 tests | 1 failed) 1218ms
   ❯ the school page behind a joining link (8)
     × offers another try when the school could not be reached at all 152ms

[Killed] StringLiteral
features/join-school/model/joinNotice.ts:13:20
 const NOTICES: Partial<Record<JoinStage, JoinNotice>> = {
   unknown: { title: 'join-unknown-title', text: 'join-unknown-text', retry: false },
   closed: { title: 'join-closed-title', text: 'join-closed-text', retry: false },
-  failed: { title: 'join-failed-title', text: 'join-failed-text', retry: true },
+  failed: { title: "", text: 'join-failed-text', retry: true },
 }
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon


 ❯ src/features/join-school/__tests__/JoinPanel.spec.ts (8 tests | 1 failed) 407ms
   ❯ the school page behind a joining link (8)
     × offers another try when the school could not be reached at all 46ms

[Killed] ArrowFunction
features/join-school/model/joinNotice.ts:16:26
   failed: { title: 'join-failed-title', text: 'join-failed-text', retry: true },
 }
 
-export const noticeFor = (stage: JoinStage): JoinNotice | undefined => NOTICES[stage]
+export const noticeFor = () => undefined
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon


 ❯ src/features/join-school/__tests__/JoinPanel.spec.ts (8 tests | 3 failed) 1754ms
   ❯ the school page behind a joining link (8)
     × says a code nobody holds leads nowhere, and offers no way to join 89ms
     × explains a school that takes no students in words, never as a code
