[Killed] ArrowFunction
features/join-school/model/useJoinSchool.ts:13:23
 import { joinSchool, resolveSchool } from '../api'
 import type { JoinStage } from '../types'
 
-const isUnknownCode = (error: unknown): boolean =>
-  error instanceof HttpError && error.status === 404
+const isUnknownCode = () => undefined
 
 /** The school has no role to give a student, so there is nothing to join yet. */
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon


 ❯ src/features/join-school/__tests__/useJoinSchool.spec.ts (10 tests | 1 failed) 646ms
   ❯ arriving by a school link (10)
     × says the link leads nowhere when no school holds the code 55ms

 ❯ src/features/join-school/__tests__/JoinPanel.spec.ts (8 tests | 1 failed) 1343ms

[Killed] EqualityOperator
features/join-school/model/useJoinSchool.ts:14:33
 import type { JoinStage } from '../types'
 
 const isUnknownCode = (error: unknown): boolean =>
-  error instanceof HttpError && error.status === 404
+  error instanceof HttpError && error.status !== 404
 
 /** The school has no role to give a student, so there is nothing to join yet. */
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon


 ❯ src/features/join-school/__tests__/useJoinSchool.spec.ts (10 tests | 2 failed) 375ms
   ❯ arriving by a school link (10)

     × says the link leads nowhere when no school holds the code 102ms
     × tells an unreachable server apart from an unknown code 7ms

[Killed] ConditionalExpression
features/join-school/model/useJoinSchool.ts:14:3
 import type { JoinStage } from '../types'
 
 const isUnknownCode = (error: unknown): boolean =>
-  error instanceof HttpError && error.status === 404
+  true
 
 /** The school has no role to give a student, so there is nothing to join yet. */
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon


 ❯ src/features/join-school/__tests__/useJoinSchool.spec.ts (10 tests | 1 failed) 370ms
   ❯ arriving by a school link (10)
     × tells an unreachable server apart from an unknown code 28ms

 ❯ src/features/join-school/__tests__/JoinPanel.spec.ts (8 tests | 1 failed) 264ms

[Killed] ArrowFunction
features/join-school/model/useJoinSchool.ts:17:25
   error instanceof HttpError && error.status === 404
 
 /** The school has no role to give a student, so there is nothing to join yet. */
-const takesNoStudents = (error: unknown): boolean =>
-  error instanceof HttpError && error.status === 409
+const takesNoStudents = () => undefined
 
 /**
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon



 ❯ src/features/join-school/__tests__/useJoinSchool.spec.ts (10 tests | 1 failed) 162ms
   ❯ arriving by a school link (10)
     × says the school takes no students yet rather than showing a refusal 16ms

[Killed] EqualityOperator
features/join-school/model/useJoinSchool.ts:18:33
 
 /** The school has no role to give a student, so there is nothing to join yet. */
 const takesNoStudents = (error: unknown): boolean =>
-  error instanceof HttpError && error.status === 409
+  error instanceof HttpError && error.status !== 409
 
 /**
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon


 ❯ src/features/join-school/__tests__/useJoinSchool.spec.ts (10 tests | 2 failed) 107ms
   ❯ arriving by a school link (10)
     × says the school takes no students yet rather than showing a refusal 21ms
     × keeps a refused join apart from a school that is not taking students 4m

[Killed] ConditionalExpression
features/join-school/model/useJoinSchool.ts:18:33
 
 /** The school has no role to give a student, so there is nothing to join yet. */
 const takesNoStudents = (error: unknown): boolean =>
-  error instanceof HttpError && error.status === 409
+  error instanceof HttpError && true
 
 /**
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon


 ❯ src/features/join-school/__tests__/useJoinSchool.spec.ts (10 tests | 1 failed) 133ms

   ❯ arriving by a school link (10)
     × keeps a refused join apart from a school that is not taking students 21ms

[Killed] BlockStatement
features/join-school/model/useJoinSchool.ts:38:46
   const school = ref<SchoolCard | undefined>(undefined)
   const stage = ref<JoinStage>('resolving')
 
-  const resolve = async (): Promise<void> => {
-    stage.value = 'resolving'
-
-    try {
-      school.value = await resolveSchool(http, code)
-      stage.value = 'ready'
-    } catch (error) {
-      stage.value = isUnknownCode(error) ? 'unknown' : 'failed'
-
-      // A code nobody holds is an ordinary answer and says itself on the
-      // screen; anything else is a fault this site cannot explain, and the
-      // only record of it is here.
-      if (stage.value === 'failed') console.warn('the joining code could not be resolved', error)
-    }
-  }
+  const resolve = async (): Promise<void> => {}
 
   const join = async (): Promise<void> => {
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon


 ❯ src/features/join-school/__tests__/useJoinSchool.spec.ts (10 tests | 10 failed) 140ms
   ❯ arriving by a school link (10)
     × asks the public resolve for the card, with the code as it was printed 61ms
     × says the link leads nowhere when no school holds the code 15ms

[Killed] BlockStatement
features/join-school/model/useJoinSchool.ts:41:9
   const resolve = async (): Promise<void> => {
     stage.value = 'resolving'
 
-    try {
-      school.value = await resolveSchool(http, code)
-      stage.value = 'ready'
-    } catch (error) {
+    try {} catch (error) {
       stage.value = isUnknownCode(error) ? 'unknown' : 'failed'
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon


 ❯ src/features/join-school/__tests__/useJoinSchool.spec.ts (10 tests | 10 failed) 159ms
   ❯ arriving by a school link (10)
     × asks the public resolve for the card, with the code as it was printed 102ms
     × says the link leads nowhere when no school holds the code 14ms

[Killed] StringLiteral
features/join-school/model/useJoinSchool.ts:43:21
 
     try {
       school.value = await resolveSchool(http, code)
-      stage.value = 'ready'
+      stage.value = ""
     } catch (error) {
       stage.value = isUnknownCode(error) ? 'unknown' : 'failed'
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon


 ❯ src/features/join-school/__tests__/useJoinSchool.spec.ts (10 tests | 3 failed) 338ms
   ❯ arriving by a school link (10)
     × asks the public resolve for the card, with the code as it was printed 222ms
     × does not join for a visitor who has no session 4ms
     × retries th

[Killed] BlockStatement
features/join-school/model/useJoinSchool.ts:44:21
     try {
       school.value = await resolveSchool(http, code)
       stage.value = 'ready'
-    } catch (error) {
-      stage.value = isUnknownCode(error) ? 'unknown' : 'failed'
-
-      // A code nobody holds is an ordinary answer and says itself on the
-      // screen; anything else is a fault this site cannot explain, and the
-      // only record of it is here.
-      if (stage.value === 'failed') console.warn('the joining code could not be resolved', error)
-    }
+    } catch (error) {}
   }
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon


 ❯ src/features/join-school/__tests__/useJoinSchool.spec.ts (10 tests | 2 failed) 142ms
   ❯ arriving by a school link (10)
     × says the link leads nowhere when no school holds the code 20ms
     × tells an unreachable server apart from an unknown code 4ms

[Killed] EqualityOperator
features/join-school/model/useJoinSchool.ts:50:11
       // A code nobody holds is an ordinary answer and says itself on the
       // screen; anything else is a fault this site cannot explain, and the
       // only record of it is here.
-      if (stage.value === 'failed') console.warn('the joining code could not be resolved', error)
+      if (stage.value !== 'failed') console.warn('the joining code could not be resolved', error)
     }
   }
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon


 ❯ src/features/join-school/__tests__/useJoinSchool.spec.ts (10 tests | 2 failed) 201ms
   ❯ arriving by a school link (10)
     × says the link leads nowhere when no school holds the code 24ms
     × tells an unreachable server apart from an unknown code 7ms

[Killed] ConditionalExpression
features/join-school/model/useJoinSchool.ts:50:11
       // A code nobody holds is an ordinary answer and says itself on the
       // screen; anything else is a fault this site cannot explain, and the
       // only record of it is here.
-      if (stage.value === 'failed') console.warn('the joining code could not be resolved', error)
+      if (false) console.warn('the joining code could not be resolved', error)
     }
   }
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon



 ❯ src/features/join-school/__tests__/useJoinSchool.spec.ts (10 tests | 1 failed) 115ms
   ❯ arriving by a school link (10)
     × tells an unreachable server apart from an unknown code 18ms

[Killed] BlockStatement
features/join-school/model/useJoinSchool.ts:54:43
     }
   }
 
-  const join = async (): Promise<void> => {
-    const owner = connection.value?.ownerId
-    const target = school.value
-    if (owner === undefined || target === undefined) return
-
-    stage.value = 'joining'
-
-    try {
-      await joinSchool(http, owner, target.id)
-      status.markJoined()
-      runs.requestRun()
-      stage.value = 'joined'
-    } catch (error) {
-      stage.value = takesNoStudents(error) ? 'closed' : 'failed'
-
-      if (stage.value === 'failed') console.warn('the school could not be joined', error)
-    }
-  }
+  const join = async (): Promise<void> => {}
 
   /** The same step again: the one that could not be finished is the one to repeat. */
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon



 ❯ src/features/join-school/__tests__/useJoinSchool.spec.ts (10 tests | 5 failed) 210ms
   ❯ arriving by a school link (10)
     × joins as the signed-in student and names the school by its identifier 26ms
     × asks for a run at once, so the catalogue does not wait for a reload

[Killed] OptionalChaining
features/join-school/model/useJoinSchool.ts:55:19
   }
 
   const join = async (): Promise<void> => {
-    const owner = connection.value?.ownerId
+    const owner = connection.value.ownerId
     const target = school.value
     if (owner === undefined || target === undefined) return
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon



 ❯ src/features/join-school/__tests__/useJoinSchool.spec.ts (10 tests | 1 failed) 287ms
   ❯ arriving by a school link (10)
     × does not join for a visitor who has no session 48ms

[Killed] EqualityOperator
features/join-school/model/useJoinSchool.ts:57:9
   const join = async (): Promise<void> => {
     const owner = connection.value?.ownerId
     const target = school.value
-    if (owner === undefined || target === undefined) return
+    if (owner !== undefined || target === undefined) return
 
     stage.value = 'joining'
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon


 ❯ src/features/join-school/__tests__/useJoinSchool.spec.ts (10 tests | 6 failed) 195ms
   ❯ arriving by a school link (10)
     × joins as the signed-in student and names the school by its identifier 25ms
     × asks for a run at once, so the catalogue does not wait for a reload 5

[Killed] EqualityOperator
features/join-school/model/useJoinSchool.ts:57:32
   const join = async (): Promise<void> => {
     const owner = connection.value?.ownerId
     const target = school.value
-    if (owner === undefined || target === undefined) return
+    if (owner === undefined || target !== undefined) return
 
     stage.value = 'joining'
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon


 ❯ src/features/join-school/__tests__/useJoinSchool.spec.ts (10 tests | 5 failed) 188ms
   ❯ arriving by a school link (10)
     × joins as the signed-in student and names the school by its identifier 28ms
     × asks for a run at once, so the catalogue does not wait for a reload 8

[Killed] BlockStatement
features/join-school/model/useJoinSchool.ts:61:9
 
     stage.value = 'joining'
 
-    try {
-      await joinSchool(http, owner, target.id)
-      status.markJoined()
-      runs.requestRun()
-      stage.value = 'joined'
-    } catch (error) {
+    try {} catch (error) {
       stage.value = takesNoStudents(error) ? 'closed' : 'failed'
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon


 ❯ src/features/join-school/__tests__/useJoinSchool.spec.ts (10 tests | 5 failed) 378ms
   ❯ arriving by a school link (10)
     × joins as the signed-in student and names the school by its identifier 40ms
     × asks for a run at once, so the catalogue does not wait for a reload 8

[Killed] CallExpression
features/join-school/model/useJoinSchool.ts:63:7
 
     try {
       await joinSchool(http, owner, target.id)
-      status.markJoined()
+      ;
       runs.requestRun()
       stage.value = 'joined'
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon



 ❯ src/features/join-school/__tests__/useJoinSchool.spec.ts (10 tests | 1 failed) 169ms
   ❯ arriving by a school link (10)
     × asks for a run at once, so the catalogue does not wait for a reload 80ms

[Killed] CallExpression
features/join-school/model/useJoinSchool.ts:64:7
     try {
       await joinSchool(http, owner, target.id)
       status.markJoined()
-      runs.requestRun()
+      ;
       stage.value = 'joined'
     } catch (error) {
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon



 ❯ src/features/join-school/__tests__/useJoinSchool.spec.ts (10 tests | 1 failed) 156ms
   ❯ arriving by a school link (10)
     × asks for a run at once, so the catalogue does not wait for a reload 14ms

[Killed] StringLiteral
features/join-school/model/useJoinSchool.ts:65:21
       await joinSchool(http, owner, target.id)
       status.markJoined()
       runs.requestRun()
-      stage.value = 'joined'
+      stage.value = ""
     } catch (error) {
       stage.value = takesNoStudents(error) ? 'closed' : 'failed'
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon



 ❯ src/features/join-school/__tests__/useJoinSchool.spec.ts (10 tests | 2 failed) 233ms
   ❯ arriving by a school link (10)
     × joins as the signed-in student and names the school by its identifier 65ms
     × retries the join once the school is known 6ms

[Killed] BlockStatement
features/join-school/model/useJoinSchool.ts:66:21
       status.markJoined()
       runs.requestRun()
       stage.value = 'joined'
-    } catch (error) {
-      stage.value = takesNoStudents(error) ? 'closed' : 'failed'
-
-      if (stage.value === 'failed') console.warn('the school could not be joined', error)
-    }
+    } catch (error) {}
   }
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon



 ❯ src/features/join-school/__tests__/useJoinSchool.spec.ts (10 tests | 2 failed) 334ms
   ❯ arriving by a school link (10)
     × says the school takes no students yet rather than showing a refusal 32ms
     × keeps a refused join apart from a school that is not taking students 5

[Killed] StringLiteral
features/join-school/model/useJoinSchool.ts:67:46
       runs.requestRun()
       stage.value = 'joined'
     } catch (error) {
-      stage.value = takesNoStudents(error) ? 'closed' : 'failed'
+      stage.value = takesNoStudents(error) ? "" : 'failed'
 
       if (stage.value === 'failed') console.warn('the school could not be joined', error)
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon



 ❯ src/features/join-school/__tests__/useJoinSchool.spec.ts (10 tests | 1 failed) 443ms
   ❯ arriving by a school link (10)
     × says the school takes no students yet rather than showing a refusal 112ms

[Killed] EqualityOperator
features/join-school/model/useJoinSchool.ts:69:11
     } catch (error) {
       stage.value = takesNoStudents(error) ? 'closed' : 'failed'
 
-      if (stage.value === 'failed') console.warn('the school could not be joined', error)
+      if (stage.value !== 'failed') console.warn('the school could not be joined', error)
     }
   }
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon


 ❯ src/features/join-school/__tests__/useJoinSchool.spec.ts (10 tests | 2 failed) 533ms
   ❯ arriving by a school link (10)
     × says the school takes no students yet rather than showing a refusal 109ms
     × keeps a refused join apart from a school that is not taking students 1

[Killed] ConditionalExpression
features/join-school/model/useJoinSchool.ts:69:11
     } catch (error) {
       stage.value = takesNoStudents(error) ? 'closed' : 'failed'
 
-      if (stage.value === 'failed') console.warn('the school could not be joined', error)
+      if (true) console.warn('the school could not be joined', error)
     }
   }
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon



 ❯ src/features/join-school/__tests__/useJoinSchool.spec.ts (10 tests | 1 failed) 226ms
   ❯ arriving by a school link (10)
     × says the school takes no students yet rather than showing a refusal 49ms

[Killed] ArrowFunction
features/join-school/model/useJoinSchool.ts:74:17
   }
 
   /** The same step again: the one that could not be finished is the one to repeat. */
-  const retry = (): Promise<void> => (school.value === undefined ? resolve() : join())
+  const retry = () => undefined
 
   return { school, stage, resolve, join, retry }
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon


 ❯ src/features/join-school/__tests__/useJoinSchool.spec.ts (10 tests | 2 failed) 148ms
   ❯ arriving by a school link (10)
     × retries the step that failed: the lookup while there is no school 41ms
     × retries the join once the school is known 7ms

[Killed] ConditionalExpression
features/join-school/model/useJoinSchool.ts:74:39
   }
 
   /** The same step again: the one that could not be finished is the one to repeat. */
-  const retry = (): Promise<void> => (school.value === undefined ? resolve() : join())
+  const retry = (): Promise<void> => (true ? resolve() : join())
 
   return { school, stage, resolve, join, retry }
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon



 ❯ src/features/join-school/__tests__/useJoinSchool.spec.ts (10 tests | 1 failed) 243ms
   ❯ arriving by a school link (10)
     × retries the join once the school is known 45ms
