[Killed] BlockStatement
pages/learning/model/pickLearningView.ts:24:77
  * signed in without a link; the second is thirty seconds of waiting. Saying
  * the first while a backfill is running tells a student their school is gone.
  */
-export const pickLearningView = (input: LearningViewInput): LearningView => {
-  if (input.schools > 0) return 'schools'
-  if (!input.filled || input.joined) return 'arriving'
-
-  return 'uninvited'
-}
+export const pickLearningView = (input: LearningViewInput): LearningView => {}
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon



 ❯ src/pages/learning/__tests__/pickLearningView.spec.ts (5 tests | 5 failed) 49ms
   ❯ what the learning screen has to say when it has nothing (5)
     × shows the schools once there are any 38ms
     × waits rather than concluding anything before a run has finished 2ms

[Killed] ConditionalExpression
pages/learning/model/pickLearningView.ts:25:7
  * the first while a backfill is running tells a student their school is gone.
  */
 export const pickLearningView = (input: LearningViewInput): LearningView => {
-  if (input.schools > 0) return 'schools'
+  if (false) return 'schools'
   if (!input.filled || input.joined) return 'arriving'
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon


 ❯ src/pages/learning/__tests__/pickLearningView.spec.ts (5 tests | 2 failed) 132ms
   ❯ what the learning screen has to say when it has nothing (5)
     × shows the schools once there are any 109ms
     × prefers what is on the machine to what a run has said about it 7ms

[Killed] EqualityOperator
pages/learning/model/pickLearningView.ts:25:7
  * the first while a backfill is running tells a student their school is gone.
  */
 export const pickLearningView = (input: LearningViewInput): LearningView => {
-  if (input.schools > 0) return 'schools'
+  if (input.schools <= 0) return 'schools'
   if (!input.filled || input.joined) return 'arriving'
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon



 ❯ src/pages/learning/__tests__/pickLearningView.spec.ts (5 tests | 5 failed) 162ms
   ❯ what the learning screen has to say when it has nothing (5)

     × shows the schools once there are any 138ms

[Killed] ConditionalExpression
pages/learning/model/pickLearningView.ts:26:7
  */
 export const pickLearningView = (input: LearningViewInput): LearningView => {
   if (input.schools > 0) return 'schools'
-  if (!input.filled || input.joined) return 'arriving'
+  if (true) return 'arriving'
 
   return 'uninvited'
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon



 ❯ src/pages/learning/__tests__/pickLearningView.spec.ts (5 tests | 1 failed) 79ms

   ❯ what the learning screen has to say when it has nothing (5)
     × says nobody invited them only once a run has finished and found nothing 23ms

[Killed] ConditionalExpression
pages/learning/model/pickLearningView.ts:26:7
  */
 export const pickLearningView = (input: LearningViewInput): LearningView => {
   if (input.schools > 0) return 'schools'
-  if (!input.filled || input.joined) return 'arriving'
+  if (false) return 'arriving'
 
   return 'uninvited'
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon


 ❯ src/pages/learning/__tests__/pickLearningView.spec.ts (5 tests | 2 failed) 81ms
   ❯ what the learning screen has to say when it has nothing (5)
     × waits rather than concluding anything before a run has finished 56ms
     × never says that to somebody who has just joined a s

[Killed] StringLiteral
pages/learning/model/pickLearningView.ts:28:10
   if (input.schools > 0) return 'schools'
   if (!input.filled || input.joined) return 'arriving'
 
-  return 'uninvited'
+  return ""
 }
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon



 ❯ src/pages/learning/__tests__/pickLearningView.spec.ts (5 tests | 1 failed) 64ms
   ❯ what the learning screen has to say when it has nothing (5)
     × says nobody invited them only once a run has finished and found nothing 25ms
