[Killed] BlockStatement
pages/learning/model/useJoinedSchools.ts:14:39
  * what the student sees in their lists, and a second source for it would let
  * the screen say one thing while the lists say another.
  */
-export const useJoinedSchools = () => {
-  const repository = useLocalSchools()
-  const status = useSiteStatus()
-  const schools = ref<readonly LocalSchool[]>([])
-
-  const reload = async (): Promise<void> => {
-    try {
-      schools.value = await repository.list()
-    } catch (error) {
-      // A reading tab can hold an image written before the writing tab created
-      // the schema. An unreadable table is one moment of "nothing yet", not a
-      // screen worth failing, and the next run re-reads it.
-      console.warn('the local schools could not be read', error)
-    }
-  }
-
-  onMounted(() => void reload())
-  watch([status.done, status.firstRunCompleted], () => void reload())
-
-  return { schools }
-}
+export const useJoinedSchools = () => {}
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon


 ❯ src/pages/learning/__tests__/LearningPage.spec.ts (4 tests | 4 failed) 161ms
   ❯ the learning screen with nothing on it (4)
     × promises the courses are coming while the first run is still going 70ms
     × reads the schools again as synchronisation brings more 14ms
     × s

[Survived] ArrayDeclaration
pages/learning/model/useJoinedSchools.ts:17:47
 export const useJoinedSchools = () => {
   const repository = useLocalSchools()
   const status = useSiteStatus()
-  const schools = ref<readonly LocalSchool[]>([])
+  const schools = ref<readonly LocalSchool[]>(["Stryker was here"])
 
   const reload = async (): Promise<void> => {

[Killed] BlockStatement
pages/learning/model/useJoinedSchools.ts:19:45
   const status = useSiteStatus()
   const schools = ref<readonly LocalSchool[]>([])
 
-  const reload = async (): Promise<void> => {
-    try {
-      schools.value = await repository.list()
-    } catch (error) {
-      // A reading tab can hold an image written before the writing tab created
-      // the schema. An unreadable table is one moment of "nothing yet", not a
-      // screen worth failing, and the next run re-reads it.
-      console.warn('the local schools could not be read', error)
-    }
-  }
+  const reload = async (): Promise<void> => {}
 
   onMounted(() => void reload())
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon



 ❯ src/pages/learning/__tests__/LearningPage.spec.ts (4 tests | 1 failed) 229ms
   ❯ the learning screen with nothing on it (4)
     × reads the schools again as synchronisation brings more 69ms

[Killed] BlockStatement
pages/learning/model/useJoinedSchools.ts:20:9
   const schools = ref<readonly LocalSchool[]>([])
 
   const reload = async (): Promise<void> => {
-    try {
-      schools.value = await repository.list()
-    } catch (error) {
+    try {} catch (error) {
       // A reading tab can hold an image written before the writing tab created
       // the schema. An unreadable table is one moment of "nothing yet", not a
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon


 ❯ src/pages/learning/__tests__/LearningPage.spec.ts (4 tests | 1 failed) 282ms

   ❯ the learning screen with nothing on it (4)
     × reads the schools again as synchronisation brings more 71ms

[Survived] BlockStatement
pages/learning/model/useJoinedSchools.ts:22:21
   const reload = async (): Promise<void> => {
     try {
       schools.value = await repository.list()
-    } catch (error) {
-      // A reading tab can hold an image written before the writing tab created
-      // the schema. An unreadable table is one moment of "nothing yet", not a
-      // screen worth failing, and the next run re-reads it.
-      console.warn('the local schools could not be read', error)
-    }
+    } catch (error) {}
   }
 

[Killed] ArrowFunction
pages/learning/model/useJoinedSchools.ts:30:13
     }
   }
 
-  onMounted(() => void reload())
+  onMounted(() => undefined)
   watch([status.done, status.firstRunCompleted], () => void reload())
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon


 ❯ src/pages/learning/__tests__/LearningPage.spec.ts (4 tests | 1 failed) 119ms
   ❯ the learning screen with nothing on it (4)
     × reads the schools again as synchronisation brings more 43ms

[Killed] ArrowFunction
pages/learning/model/useJoinedSchools.ts:31:50
   }
 
   onMounted(() => void reload())
-  watch([status.done, status.firstRunCompleted], () => void reload())
+  watch([status.done, status.firstRunCompleted], () => undefined)
 
   return { schools }
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon



 ❯ src/pages/learning/__tests__/LearningPage.spec.ts (4 tests | 1 failed) 194ms
   ❯ the learning screen with nothing on it (4)
     × reads the schools again as synchronisation brings more 57ms

[Killed] ArrayDeclaration
pages/learning/model/useJoinedSchools.ts:31:9
   }
 
   onMounted(() => void reload())
-  watch([status.done, status.firstRunCompleted], () => void reload())
+  watch([], () => void reload())
 
   return { schools }
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon


 ❯ src/pages/learning/__tests__/LearningPage.spec.ts (4 tests | 1 failed) 204ms
   ❯ the learning screen with nothing on it (4)
     × reads the schools again as synchronisation brings more 44ms
