[Killed] BlockStatement
src/shared/data/useLocalSchools.ts:15:57
  */
 export const schoolRepositoryKey: InjectionKey<ISchoolRepository> = Symbol('vidya.schools')
 
-export const useLocalSchools = (): ISchoolRepository => {
-  const schools = inject(schoolRepositoryKey, null)
-  if (schools === null) throw new Error('no local schools were provided to this application')
-
-  return schools
-}
+export const useLocalSchools = (): ISchoolRepository => {}
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon



 ❯ src/shared/data/__tests__/useLocalSchools.spec.ts (2 tests | 1 failed) 172ms
   ❯ reading the schools this machine holds (2)
     × refuses to answer from nowhere when nothing was provided 82ms

[Killed] ConditionalExpression
src/shared/data/useLocalSchools.ts:17:7
 
 export const useLocalSchools = (): ISchoolRepository => {
   const schools = inject(schoolRepositoryKey, null)
-  if (schools === null) throw new Error('no local schools were provided to this application')
+  if (true) throw new Error('no local schools were provided to this application')
 
   return schools
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon


stderr | src/shared/data/__tests__/useLocalSchools.spec.ts > reading the schools this machine holds > hands the screen the repository the composition root built
[Vue warn]: Component is missing template or render function:  { setup: [Function: setup], components: {} }

[Killed] EqualityOperator
src/shared/data/useLocalSchools.ts:17:7
 
 export const useLocalSchools = (): ISchoolRepository => {
   const schools = inject(schoolRepositoryKey, null)
-  if (schools === null) throw new Error('no local schools were provided to this application')
+  if (schools !== null) throw new Error('no local schools were provided to this application')
 
   return schools
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon


stderr | src/shared/data/__tests__/useLocalSchools.spec.ts > reading the schools this machine holds > hands the screen the repository the composition root built
[Vue warn]: Component is missing template or render function:  { setup: [Function: setup], components: {} }
