[Killed] BlockStatement
src/shared/sync/useSyncRuns.ts:17:52
  * tab has no engine to offer, so its request is answered by the writing tab's
  * next run rather than by this one.
  */
-export const useSyncRuns = createGlobalState(() => {
-  const runner = ref<SyncRun | undefined>(undefined)
-
-  return {
-    /** Offered by the writing tab while its engine lives, withdrawn when it stops. */
-    adoptRunner: (run: SyncRun | undefined): void => {
-      runner.value = run
-    },
-
-    /** Answers whether there was an engine in this tab to ask. */
-    requestRun: (): boolean => {
-      const run = runner.value
-      if (run === undefined) return false
-
-      run()
-      return true
-    },
-  }
-})
+export const useSyncRuns = createGlobalState(() => {})
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon


 ❯ src/app/__tests__/sync.spec.ts (8 tests | 8 failed) 42ms
   ❯ the engine of the writing tab (8)
     × stays silent while nobody is signed in 15ms
     × runs as soon as there is a connection to run over 2ms
     × tells the screens a run has completed, so an empty list means em

[Killed] BlockStatement
src/shared/sync/useSyncRuns.ts:22:54
 
   return {
     /** Offered by the writing tab while its engine lives, withdrawn when it stops. */
-    adoptRunner: (run: SyncRun | undefined): void => {
-      runner.value = run
-    },
+    adoptRunner: (run: SyncRun | undefined): void => {},
 
     /** Answers whether there was an engine in this tab to ask. */
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon



 ❯ src/shared/sync/__tests__/useSyncRuns.spec.ts (3 tests | 1 failed) 95ms
   ❯ asking for a sync run from a screen (3)
     × runs the engine the writing tab offered 48ms

[Killed] BlockStatement
src/shared/sync/useSyncRuns.ts:27:32
     },
 
     /** Answers whether there was an engine in this tab to ask. */
-    requestRun: (): boolean => {
-      const run = runner.value
-      if (run === undefined) return false
-
-      run()
-      return true
-    },
+    requestRun: (): boolean => {},
   }
 })
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon



 ❯ src/shared/sync/__tests__/useSyncRuns.spec.ts (3 tests | 3 failed) 127ms
   ❯ asking for a sync run from a screen (3)
     × answers that there was nothing to ask while no engine is offered 76ms
     × runs the engine the writing tab offered 10ms

[Killed] BooleanLiteral
src/shared/sync/useSyncRuns.ts:29:37
     /** Answers whether there was an engine in this tab to ask. */
     requestRun: (): boolean => {
       const run = runner.value
-      if (run === undefined) return false
+      if (run === undefined) return true
 
       run()
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon


 ❯ src/shared/sync/__tests__/useSyncRuns.spec.ts (3 tests | 2 failed) 121ms
   ❯ asking for a sync run from a screen (3)
     × answers that there was nothing to ask while no engine is offered 53ms
     × stops running an engine that has been withdrawn 10ms

[Killed] EqualityOperator
src/shared/sync/useSyncRuns.ts:29:11
     /** Answers whether there was an engine in this tab to ask. */
     requestRun: (): boolean => {
       const run = runner.value
-      if (run === undefined) return false
+      if (run !== undefined) return false
 
       run()
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon



 ❯ src/shared/sync/__tests__/useSyncRuns.spec.ts (3 tests | 3 failed) 198ms

   ❯ asking for a sync run from a screen (3)
     × answers that there was nothing to ask while no engine is offered 50ms

[Killed] CallExpression
src/shared/sync/useSyncRuns.ts:31:7
       const run = runner.value
       if (run === undefined) return false
 
-      run()
+      ;
       return true
     },
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon


 ❯ src/shared/sync/__tests__/useSyncRuns.spec.ts (3 tests | 1 failed) 28ms
   ❯ asking for a sync run from a screen (3)
     × runs the engine the writing tab offered 10ms

 ❯ src/features/join-school/__tests__/useJoinSchool.spec.ts (10 tests | 1 failed) 132ms

[Killed] BooleanLiteral
src/shared/sync/useSyncRuns.ts:32:14
       if (run === undefined) return false
 
       run()
-      return true
+      return false
     },
   }
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-JKJMon


 ❯ src/shared/sync/__tests__/useSyncRuns.spec.ts (3 tests | 1 failed) 26ms

   ❯ asking for a sync run from a screen (3)
     × runs the engine the writing tab offered 19ms
