[Killed] ArrowFunction
src/app/connection.ts:18:33
  * request rather than captured, because it is replaced whole whenever a token
  * is renewed and a client holding the old one would go on sending it.
  */
-export const createSiteClient = (): HttpClient =>
-  httpClientFor({ baseUrl: config.apiBaseUrl, session: () => useConnection().session.value })
+export const createSiteClient = () => undefined
 
 /**
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/connection.spec.ts (4 tests | 1 failed) 43ms
   ❯ the transport of the one connection (4)
     × sends the session it holds now, not the one it was built with 23ms

[Killed] ArrowFunction
src/app/connection.ts:19:56
  * is renewed and a client holding the old one would go on sending it.
  */
 export const createSiteClient = (): HttpClient =>
-  httpClientFor({ baseUrl: config.apiBaseUrl, session: () => useConnection().session.value })
+  httpClientFor({ baseUrl: config.apiBaseUrl, session: () => undefined })
 
 /**
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/connection.spec.ts (4 tests | 1 failed) 152ms

   ❯ the transport of the one connection (4)
     × sends the session it holds now, not the one it was built with 134ms

[Killed] OptionalChaining
src/app/connection.ts:31:24
  */
 export const renewSession = async (http: HttpClient): Promise<boolean> => {
   const { connection, adopt } = useConnection()
-  const refreshToken = connection.value?.session.refreshToken
+  const refreshToken = connection.value.session.refreshToken
   if (refreshToken === undefined) return false
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/connection.spec.ts (4 tests | 1 failed) 104ms
   ❯ the transport of the one connection (4)
     × does not ask for a renewal it has no token for 20ms

[Killed] BooleanLiteral
src/app/connection.ts:32:42
 export const renewSession = async (http: HttpClient): Promise<boolean> => {
   const { connection, adopt } = useConnection()
   const refreshToken = connection.value?.session.refreshToken
-  if (refreshToken === undefined) return false
+  if (refreshToken === undefined) return true
 
   try {
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/connection.spec.ts (4 tests | 1 failed) 133ms
   ❯ the transport of the one connection (4)

     × does not ask for a renewal it has no token for 78ms

[Killed] ConditionalExpression
src/app/connection.ts:32:7
 export const renewSession = async (http: HttpClient): Promise<boolean> => {
   const { connection, adopt } = useConnection()
   const refreshToken = connection.value?.session.refreshToken
-  if (refreshToken === undefined) return false
+  if (true) return false
 
   try {
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/connection.spec.ts (4 tests | 2 failed) 67ms
   ❯ the transport of the one connection (4)
     × takes the renewed session, so the next run carries it 32ms
     × answers that it could not renew, and signs nobody out for it 4ms

[Killed] BlockStatement
src/app/connection.ts:34:7
   const refreshToken = connection.value?.session.refreshToken
   if (refreshToken === undefined) return false
 
-  try {
-    const renewed = await http.post<RefreshTokensResponse>(Routes().auth.tokens.refresh(), {
-      refreshToken,
-    } satisfies RefreshTokensRequest)
-
-    adopt({
-      session: { accessToken: renewed.accessToken, refreshToken: renewed.refreshToken },
-      needsSignIn: false,
-    })
-
-    return true
-  } catch (error) {
+  try {} catch (error) {
     // Reported by answering `false`: the run defers and the connection is
     // marked as needing a sign-in. Raising here would end the session, which
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/connection.spec.ts (4 tests | 2 failed) 69ms
   ❯ the transport of the one connection (4)
     × takes the renewed session, so the next run carries it 24ms
     × answers that it could not renew, and signs nobody out for it 4ms

[Killed] ObjectLiteral
src/app/connection.ts:40:16
     } satisfies RefreshTokensRequest)
 
     adopt({
-      session: { accessToken: renewed.accessToken, refreshToken: renewed.refreshToken },
+      session: {},
       needsSignIn: false,
     })
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/connection.spec.ts (4 tests | 1 failed) 49ms

   ❯ the transport of the one connection (4)
     × takes the renewed session, so the next run carries it 21ms

[Survived] BooleanLiteral
src/app/connection.ts:41:20
 
     adopt({
       session: { accessToken: renewed.accessToken, refreshToken: renewed.refreshToken },
-      needsSignIn: false,
+      needsSignIn: true,
     })
 

[Killed] BlockStatement
src/app/connection.ts:45:19
     })
 
     return true
-  } catch (error) {
-    // Reported by answering `false`: the run defers and the connection is
-    // marked as needing a sign-in. Raising here would end the session, which
-    // is what must not happen.
-    console.warn('the session could not be renewed', error)
-    adopt({ needsSignIn: true })
-
-    return false
-  }
+  } catch (error) {}
 }
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/connection.spec.ts (4 tests | 1 failed) 140ms
   ❯ the transport of the one connection (4)
     × answers that it could not renew, and signs nobody out for it 50ms

[Killed] BooleanLiteral
src/app/connection.ts:50:26
     // marked as needing a sign-in. Raising here would end the session, which
     // is what must not happen.
     console.warn('the session could not be renewed', error)
-    adopt({ needsSignIn: true })
+    adopt({ needsSignIn: false })
 
     return false
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/connection.spec.ts (4 tests | 1 failed) 87ms
   ❯ the transport of the one connection (4)
     × answers that it could not renew, and signs nobody out for it 27ms

[Killed] ObjectLiteral
src/app/connection.ts:50:11
     // marked as needing a sign-in. Raising here would end the session, which
     // is what must not happen.
     console.warn('the session could not be renewed', error)
-    adopt({ needsSignIn: true })
+    adopt({})
 
     return false
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/connection.spec.ts (4 tests | 1 failed) 183ms
   ❯ the transport of the one connection (4)
     × answers that it could not renew, and signs nobody out for it 35ms
