[Survived] OptionalChaining
src/app/persistentStorage.ts:17:41
  * settings screen says which promise was given.
  */
 export const requestPersistentStorage = async (
-  manager: StorageManager | undefined = globalThis.navigator?.storage,
+  manager: StorageManager | undefined = globalThis.navigator.storage,
 ): Promise<StorageDurability> => {
   if (typeof manager?.persist !== 'function') return 'unknown'

[Killed] BlockStatement
src/app/persistentStorage.ts:18:34
  */
 export const requestPersistentStorage = async (
   manager: StorageManager | undefined = globalThis.navigator?.storage,
-): Promise<StorageDurability> => {
-  if (typeof manager?.persist !== 'function') return 'unknown'
-
-  try {
-    return (await manager.persist()) ? 'persistent' : 'temporary'
-  } catch (error) {
-    // A browser that throws here has told us nothing about what it will keep,
-    // which is exactly what 'unknown' says.
-    console.warn('the browser refused to answer about persistent storage', error)
-    return 'unknown'
-  }
-}
+): Promise<StorageDurability> => {}
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/persistentStorage.spec.ts (4 tests | 4 failed) 232ms
   ❯ asking the browser to keep the local database (4)
     × says the data is kept when the browser grants it 125ms
     × says the data may be evicted when the browser refuses 3ms
     × promises nothing wh

[Killed] OptionalChaining
src/app/persistentStorage.ts:19:14
 export const requestPersistentStorage = async (
   manager: StorageManager | undefined = globalThis.navigator?.storage,
 ): Promise<StorageDurability> => {
-  if (typeof manager?.persist !== 'function') return 'unknown'
+  if (typeof manager.persist !== 'function') return 'unknown'
 
   try {
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/persistentStorage.spec.ts (4 tests | 1 failed) 82ms
   ❯ asking the browser to keep the local database (4)
     × promises nothing where the browser has no such api 22ms

[Killed] ConditionalExpression
src/app/persistentStorage.ts:19:7
 export const requestPersistentStorage = async (
   manager: StorageManager | undefined = globalThis.navigator?.storage,
 ): Promise<StorageDurability> => {
-  if (typeof manager?.persist !== 'function') return 'unknown'
+  if (true) return 'unknown'
 
   try {
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/persistentStorage.spec.ts (4 tests | 3 failed) 161ms
   ❯ asking the browser to keep the local database (4)
     × says the data is kept when the browser grants it 95ms
     × says the data may be evicted when the browser refuses 21ms
     × promises nothing, r

[Killed] BlockStatement
src/app/persistentStorage.ts:21:7
 ): Promise<StorageDurability> => {
   if (typeof manager?.persist !== 'function') return 'unknown'
 
-  try {
-    return (await manager.persist()) ? 'persistent' : 'temporary'
-  } catch (error) {
+  try {} catch (error) {
     // A browser that throws here has told us nothing about what it will keep,
     // which is exactly what 'unknown' says.
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/persistentStorage.spec.ts (4 tests | 3 failed) 139ms
   ❯ asking the browser to keep the local database (4)
     × says the data is kept when the browser grants it 105ms
     × says the data may be evicted when the browser refuses 5ms
     × promises nothing, r

[Killed] BlockStatement
src/app/persistentStorage.ts:23:19
 
   try {
     return (await manager.persist()) ? 'persistent' : 'temporary'
-  } catch (error) {
-    // A browser that throws here has told us nothing about what it will keep,
-    // which is exactly what 'unknown' says.
-    console.warn('the browser refused to answer about persistent storage', error)
-    return 'unknown'
-  }
+  } catch (error) {}
 }
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/persistentStorage.spec.ts (4 tests | 1 failed) 192ms
   ❯ asking the browser to keep the local database (4)
     × promises nothing, rather than failing, when the browser throws 26ms
