[Survived] BlockStatement
src/app/i18n.ts:6:33
 import { installSectionMessages } from './sections'
 
 /** Both bundles, each holding its own language, assembled once at startup. */
-export const createI18n = () => {
-  installSectionMessages()
-  return fluent
-}
+export const createI18n = () => {}
 

[Survived] CallExpression
src/app/i18n.ts:7:3
 
 /** Both bundles, each holding its own language, assembled once at startup. */
 export const createI18n = () => {
-  installSectionMessages()
+  ;
   return fluent
 }
