[Killed] BlockStatement
src/app/router/guards.ts:13:75
  * the address they asked for rather than to the root — a lesson, or a school's
  * joining page.
  */
-export const requireSession: NavigationGuardWithThis<undefined> = (to) => {
-  if (to.meta.public) return true
-  if (useConnection().isSignedIn.value) return true
-
-  return { name: 'login', query: to.fullPath === '/' ? {} : { redirect: to.fullPath } }
-}
+export const requireSession: NavigationGuardWithThis<undefined> = (to) => {}
 
 /** A signed-in student has no business on the sign-in screen. */
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6



 ❯ src/app/__tests__/guards.spec.ts (7 tests | 1 failed) 530ms
   ❯ who is let where (7)
     × sends a visitor with no session to sign in, carrying where they were going 122ms

[Killed] BooleanLiteral
src/app/router/guards.ts:14:30
  * joining page.
  */
 export const requireSession: NavigationGuardWithThis<undefined> = (to) => {
-  if (to.meta.public) return true
+  if (to.meta.public) return false
   if (useConnection().isSignedIn.value) return true
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/guards.spec.ts (7 tests | 4 failed) 332ms

   ❯ who is let where (7)
     × sends a visitor with no session to sign in, carrying where they were going 57ms
     × asks nothing of the joining link: it is read before there is an account 5ms

[Killed] ConditionalExpression
src/app/router/guards.ts:14:7
  * joining page.
  */
 export const requireSession: NavigationGuardWithThis<undefined> = (to) => {
-  if (to.meta.public) return true
+  if (true) return true
   if (useConnection().isSignedIn.value) return true
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/guards.spec.ts (7 tests | 1 failed) 781ms

   ❯ who is let where (7)
     × sends a visitor with no session to sign in, carrying where they were going 425ms

[Killed] BooleanLiteral
src/app/router/guards.ts:15:48
  */
 export const requireSession: NavigationGuardWithThis<undefined> = (to) => {
   if (to.meta.public) return true
-  if (useConnection().isSignedIn.value) return true
+  if (useConnection().isSignedIn.value) return false
 
   return { name: 'login', query: to.fullPath === '/' ? {} : { redirect: to.fullPath } }
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/guards.spec.ts (7 tests | 3 failed) 620ms
   ❯ who is let where (7)
     × lets a signed-in student reach their own screens 45ms
     × keeps a signed-in student off the sign-in screen 14ms
     × opens a lesson of a school by its code 6ms

[Killed] ConditionalExpression
src/app/router/guards.ts:15:7
  */
 export const requireSession: NavigationGuardWithThis<undefined> = (to) => {
   if (to.meta.public) return true
-  if (useConnection().isSignedIn.value) return true
+  if (true) return true
 
   return { name: 'login', query: to.fullPath === '/' ? {} : { redirect: to.fullPath } }
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/guards.spec.ts (7 tests | 1 failed) 460ms
   ❯ who is let where (7)
     × sends a visitor with no session to sign in, carrying where they were going 185ms

[Killed] EqualityOperator
src/app/router/guards.ts:17:34
   if (to.meta.public) return true
   if (useConnection().isSignedIn.value) return true
 
-  return { name: 'login', query: to.fullPath === '/' ? {} : { redirect: to.fullPath } }
+  return { name: 'login', query: to.fullPath !== '/' ? {} : { redirect: to.fullPath } }
 }
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/guards.spec.ts (7 tests | 1 failed) 377ms

   ❯ who is let where (7)
     × sends a visitor with no session to sign in, carrying where they were going 172ms

[Killed] ConditionalExpression
src/app/router/guards.ts:17:34
   if (to.meta.public) return true
   if (useConnection().isSignedIn.value) return true
 
-  return { name: 'login', query: to.fullPath === '/' ? {} : { redirect: to.fullPath } }
+  return { name: 'login', query: true ? {} : { redirect: to.fullPath } }
 }
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/guards.spec.ts (7 tests | 1 failed) 497ms
   ❯ who is let where (7)
     × sends a visitor with no session to sign in, carrying where they were going 225ms

[Killed] BlockStatement
src/app/router/guards.ts:21:82
 }
 
 /** A signed-in student has no business on the sign-in screen. */
-export const skipLoginWhenSignedIn: NavigationGuardWithThis<undefined> = (to) => {
-  if (to.name !== 'login') return true
-  return useConnection().isSignedIn.value ? { path: '/' } : true
-}
+export const skipLoginWhenSignedIn: NavigationGuardWithThis<undefined> = (to) => {}
 
 /**
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/guards.spec.ts (7 tests | 1 failed) 583ms
   ❯ who is let where (7)
     × keeps a signed-in student off the sign-in screen 16ms

[Killed] EqualityOperator
src/app/router/guards.ts:22:7
 
 /** A signed-in student has no business on the sign-in screen. */
 export const skipLoginWhenSignedIn: NavigationGuardWithThis<undefined> = (to) => {
-  if (to.name !== 'login') return true
+  if (to.name === 'login') return true
   return useConnection().isSignedIn.value ? { path: '/' } : true
 }
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


stderr | src/app/__tests__/guards.spec.ts > who is let where > lets a signed-in student reach their own screens
[Vue Router warn]: Detected a possibly infinite redirection in a navigation guard when going from "/" to "/". Aborting to avoid a Stack Overflow.
 Are you always returnin

[Killed] ConditionalExpression
src/app/router/guards.ts:22:7
 
 /** A signed-in student has no business on the sign-in screen. */
 export const skipLoginWhenSignedIn: NavigationGuardWithThis<undefined> = (to) => {
-  if (to.name !== 'login') return true
+  if (true) return true
   return useConnection().isSignedIn.value ? { path: '/' } : true
 }
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/guards.spec.ts (7 tests | 1 failed) 394ms
   ❯ who is let where (7)
     × keeps a signed-in student off the sign-in screen 22ms

[Killed] BooleanLiteral
src/app/router/guards.ts:23:61
 /** A signed-in student has no business on the sign-in screen. */
 export const skipLoginWhenSignedIn: NavigationGuardWithThis<undefined> = (to) => {
   if (to.name !== 'login') return true
-  return useConnection().isSignedIn.value ? { path: '/' } : true
+  return useConnection().isSignedIn.value ? { path: '/' } : false
 }
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/guards.spec.ts (7 tests | 1 failed) 931ms
   ❯ who is let where (7)
     × sends a visitor with no session to sign in, carrying where they were going 335ms

[Survived] StringLiteral
src/app/router/guards.ts:23:53
 /** A signed-in student has no business on the sign-in screen. */
 export const skipLoginWhenSignedIn: NavigationGuardWithThis<undefined> = (to) => {
   if (to.name !== 'login') return true
-  return useConnection().isSignedIn.value ? { path: '/' } : true
+  return useConnection().isSignedIn.value ? { path: "" } : true
 }
 

[Killed] BlockStatement
src/app/router/guards.ts:34:78
  * work, and the day one of them is the one people paste is the day the code
  * stops being the school's name.
  */
-export const requireSchoolCode: NavigationGuardWithThis<undefined> = (to) => {
-  const code = codeIn(to)
-  if (code === undefined || isSchoolCode(code)) return true
-
-  return { name: 'not-found', params: { pathMatch: to.path.slice(1).split('/') }, query: to.query }
-}
+export const requireSchoolCode: NavigationGuardWithThis<undefined> = (to) => {}
 
 const codeIn = (to: RouteLocationNormalized): string | undefined => {
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6



 ❯ src/app/__tests__/guards.spec.ts (7 tests | 2 failed) 412ms
   ❯ who is let where (7)
     × refuses an identifier where a school code belongs 82ms
     × refuses an identifier in a joining link as well, before any request 3ms

[Killed] BooleanLiteral
src/app/router/guards.ts:36:56
  */
 export const requireSchoolCode: NavigationGuardWithThis<undefined> = (to) => {
   const code = codeIn(to)
-  if (code === undefined || isSchoolCode(code)) return true
+  if (code === undefined || isSchoolCode(code)) return false
 
   return { name: 'not-found', params: { pathMatch: to.path.slice(1).split('/') }, query: to.query }
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/guards.spec.ts (7 tests | 7 failed) 72ms

   ❯ who is let where (7)
     × sends a visitor with no session to sign in, carrying where they were going 42ms
     × asks nothing of the joining link: it is read before there is an account 5ms

[Killed] ConditionalExpression
src/app/router/guards.ts:36:7
  */
 export const requireSchoolCode: NavigationGuardWithThis<undefined> = (to) => {
   const code = codeIn(to)
-  if (code === undefined || isSchoolCode(code)) return true
+  if (false) return true
 
   return { name: 'not-found', params: { pathMatch: to.path.slice(1).split('/') }, query: to.query }
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


stderr | src/app/__tests__/guards.spec.ts > who is let where > sends a visitor with no session to sign in, carrying where they were going
[Vue Router warn]: Detected a possibly infinite redirection in a navigation guard when going from "/" to "/s/AB3K7Q". Aborting to avoid a Stack

[Survived] MethodExpression
src/app/router/guards.ts:38:52
   const code = codeIn(to)
   if (code === undefined || isSchoolCode(code)) return true
 
-  return { name: 'not-found', params: { pathMatch: to.path.slice(1).split('/') }, query: to.query }
+  return { name: 'not-found', params: { pathMatch: to.path.split('/') }, query: to.query }
 }
 

[Killed] StringLiteral
src/app/router/guards.ts:38:18
   const code = codeIn(to)
   if (code === undefined || isSchoolCode(code)) return true
 
-  return { name: 'not-found', params: { pathMatch: to.path.slice(1).split('/') }, query: to.query }
+  return { name: "", params: { pathMatch: to.path.slice(1).split('/') }, query: to.query }
 }
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/guards.spec.ts (7 tests | 2 failed) 174ms
   ❯ who is let where (7)
     × refuses an identifier where a school code belongs 15ms
     × refuses an identifier in a joining link as well, before any request 4ms

[Killed] BlockStatement
src/app/router/guards.ts:41:69
   return { name: 'not-found', params: { pathMatch: to.path.slice(1).split('/') }, query: to.query }
 }
 
-const codeIn = (to: RouteLocationNormalized): string | undefined => {
-  const raw = to.params.code
-  const code = Array.isArray(raw) ? raw[0] : raw
-
-  return code === undefined || code === '' ? undefined : code
-}
+const codeIn = (to: RouteLocationNormalized): string | undefined => {}
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/guards.spec.ts (7 tests | 2 failed) 201ms
   ❯ who is let where (7)
     × refuses an identifier where a school code belongs 34ms
     × refuses an identifier in a joining link as well, before any request 2ms

[Killed] ConditionalExpression
src/app/router/guards.ts:45:10
   const raw = to.params.code
   const code = Array.isArray(raw) ? raw[0] : raw
 
-  return code === undefined || code === '' ? undefined : code
+  return true ? undefined : code
 }
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/guards.spec.ts (7 tests | 2 failed) 170ms
   ❯ who is let where (7)
     × refuses an identifier where a school code belongs 35ms
     × refuses an identifier in a joining link as well, before any request 3ms

[Killed] EqualityOperator
src/app/router/guards.ts:45:10
   const raw = to.params.code
   const code = Array.isArray(raw) ? raw[0] : raw
 
-  return code === undefined || code === '' ? undefined : code
+  return code !== undefined || code === '' ? undefined : code
 }
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6



 ❯ src/app/__tests__/guards.spec.ts (7 tests | 2 failed) 877ms
   ❯ who is let where (7)
     × refuses an identifier where a school code belongs 108ms
     × refuses an identifier in a joining link as well, before any request 46ms
