[Killed] BlockStatement
src/app/saveOnExit.ts:17:87
  * running. What it buys is the writes that were made outside a transaction,
  * which the adapter exports on its own schedule.
  */
-export const saveOnExit = (db: IDatabase, page: Document = document): (() => void) => {
-  const save = () => {
-    void db.save().catch((error: unknown) => {
-      console.warn('the local database could not be written out on the way out', error)
-    })
-  }
-
-  const onHidden = () => {
-    if (page.visibilityState === 'hidden') save()
-  }
-
-  page.addEventListener('visibilitychange', onHidden)
-  page.defaultView?.addEventListener('pagehide', save)
-
-  return () => {
-    page.removeEventListener('visibilitychange', onHidden)
-    page.defaultView?.removeEventListener('pagehide', save)
-  }
-}
+export const saveOnExit = (db: IDatabase, page: Document = document): (() => void) => {}
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/saveOnExit.spec.ts (5 tests | 4 failed) 1475ms
   ❯ writing the database out on the way out (5)
     × writes when the tab is hidden 285ms
     × writes when the page goes away 8ms
     × stops listening once the caller lets go 22ms

[Killed] BlockStatement
src/app/saveOnExit.ts:18:22
  * which the adapter exports on its own schedule.
  */
 export const saveOnExit = (db: IDatabase, page: Document = document): (() => void) => {
-  const save = () => {
-    void db.save().catch((error: unknown) => {
-      console.warn('the local database could not be written out on the way out', error)
-    })
-  }
+  const save = () => {}
 
   const onHidden = () => {
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/saveOnExit.spec.ts (5 tests | 3 failed) 1843ms
   ❯ writing the database out on the way out (5)
     × writes when the tab is hidden 585ms
     × writes when the page goes away 66ms
     × reports a write it could not finish instead of losing it in a rejection

[Killed] BlockStatement
src/app/saveOnExit.ts:19:46
  */
 export const saveOnExit = (db: IDatabase, page: Document = document): (() => void) => {
   const save = () => {
-    void db.save().catch((error: unknown) => {
-      console.warn('the local database could not be written out on the way out', error)
-    })
+    void db.save().catch((error: unknown) => {})
   }
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/saveOnExit.spec.ts (5 tests | 1 failed) 1871ms
   ❯ writing the database out on the way out (5)
     × reports a write it could not finish instead of losing it in a rejection 1316ms

[Survived] StringLiteral
src/app/saveOnExit.ts:20:20
 export const saveOnExit = (db: IDatabase, page: Document = document): (() => void) => {
   const save = () => {
     void db.save().catch((error: unknown) => {
-      console.warn('the local database could not be written out on the way out', error)
+      console.warn("", error)
     })
   }

[Killed] BlockStatement
src/app/saveOnExit.ts:24:26
     })
   }
 
-  const onHidden = () => {
-    if (page.visibilityState === 'hidden') save()
-  }
+  const onHidden = () => {}
 
   page.addEventListener('visibilitychange', onHidden)
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/saveOnExit.spec.ts (5 tests | 1 failed) 728ms
   ❯ writing the database out on the way out (5)
     × writes when the tab is hidden 345ms

[Killed] EqualityOperator
src/app/saveOnExit.ts:25:9
   }
 
   const onHidden = () => {
-    if (page.visibilityState === 'hidden') save()
+    if (page.visibilityState !== 'hidden') save()
   }
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/saveOnExit.spec.ts (5 tests | 2 failed) 1174ms
   ❯ writing the database out on the way out (5)
     × writes when the tab is hidden 724ms
     × does not write on every switch back to the tab 276ms

[Killed] CallExpression
src/app/saveOnExit.ts:25:44
   }
 
   const onHidden = () => {
-    if (page.visibilityState === 'hidden') save()
+    if (page.visibilityState === 'hidden') ;
   }
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/saveOnExit.spec.ts (5 tests | 1 failed) 618ms

   ❯ writing the database out on the way out (5)
     × writes when the tab is hidden 328ms

[Killed] StringLiteral
src/app/saveOnExit.ts:28:25
     if (page.visibilityState === 'hidden') save()
   }
 
-  page.addEventListener('visibilitychange', onHidden)
+  page.addEventListener("", onHidden)
   page.defaultView?.addEventListener('pagehide', save)
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/saveOnExit.spec.ts (5 tests | 1 failed) 488ms
   ❯ writing the database out on the way out (5)
     × writes when the tab is hidden 282ms

[Survived] OptionalChaining
src/app/saveOnExit.ts:29:3
   }
 
   page.addEventListener('visibilitychange', onHidden)
-  page.defaultView?.addEventListener('pagehide', save)
+  page.defaultView.addEventListener('pagehide', save)
 
   return () => {

[Killed] BlockStatement
src/app/saveOnExit.ts:31:16
   page.addEventListener('visibilitychange', onHidden)
   page.defaultView?.addEventListener('pagehide', save)
 
-  return () => {
-    page.removeEventListener('visibilitychange', onHidden)
-    page.defaultView?.removeEventListener('pagehide', save)
-  }
+  return () => {}
 }
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6



 ❯ src/app/__tests__/saveOnExit.spec.ts (5 tests | 1 failed) 421ms
   ❯ writing the database out on the way out (5)
     × stops listening once the caller lets go 228ms

[Killed] StringLiteral
src/app/saveOnExit.ts:32:30
   page.defaultView?.addEventListener('pagehide', save)
 
   return () => {
-    page.removeEventListener('visibilitychange', onHidden)
+    page.removeEventListener("", onHidden)
     page.defaultView?.removeEventListener('pagehide', save)
   }
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/saveOnExit.spec.ts (5 tests | 1 failed) 479ms
   ❯ writing the database out on the way out (5)
     × stops listening once the caller lets go 244ms

[Survived] OptionalChaining
src/app/saveOnExit.ts:33:5
 
   return () => {
     page.removeEventListener('visibilitychange', onHidden)
-    page.defaultView?.removeEventListener('pagehide', save)
+    page.defaultView.removeEventListener('pagehide', save)
   }
 }

[Killed] StringLiteral
src/app/saveOnExit.ts:33:43
 
   return () => {
     page.removeEventListener('visibilitychange', onHidden)
-    page.defaultView?.removeEventListener('pagehide', save)
+    page.defaultView?.removeEventListener("", save)
   }
 }
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/saveOnExit.spec.ts (5 tests | 1 failed) 195ms
   ❯ writing the database out on the way out (5)
     × stops listening once the caller lets go 79ms
