[Killed] ArrayDeclaration
src/app/sections.ts:28:30
 const sections: Section[] = [learning, homework, settings, school, join, login]
 
 /** The catch-all comes after everything a section might own. */
-const fallbacks: Section[] = [notFound]
+const fallbacks: Section[] = []
 
 export const sectionRoutes = (): RouteRecordRaw[] =>
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/guards.spec.ts (7 tests | 2 failed) 589ms
   ❯ who is let where (7)
     × refuses an identifier where a school code belongs 18ms
     × refuses an identifier in a joining link as well, before any request 6ms

[Killed] ArrowFunction
src/app/sections.ts:30:30
 /** The catch-all comes after everything a section might own. */
 const fallbacks: Section[] = [notFound]
 
-export const sectionRoutes = (): RouteRecordRaw[] =>
-  [...sections, ...fallbacks].flatMap((section) => section.routes ?? [])
+export const sectionRoutes = () => undefined
 
 export const installSectionMessages = (): void => {
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/wiring.spec.ts (0 test)

 ❯ src/app/__tests__/guards.spec.ts (7 tests | 7 failed) 159ms
   ❯ who is let where (7)
     × sends a visitor with no session to sign in, carrying where they were going 109ms

[Killed] LogicalOperator
src/app/sections.ts:31:52
 const fallbacks: Section[] = [notFound]
 
 export const sectionRoutes = (): RouteRecordRaw[] =>
-  [...sections, ...fallbacks].flatMap((section) => section.routes ?? [])
+  [...sections, ...fallbacks].flatMap((section) => section.routes && [])
 
 export const installSectionMessages = (): void => {
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


stderr | src/app/__tests__/guards.spec.ts > who is let where > sends a visitor with no session to sign in, carrying where they were going
[Vue Router warn]: No match found for location with path "/s/AB3K7Q"

stderr | src/app/__tests__/guards.spec.ts > who is let where > asks nothin

[Killed] ArrowFunction
src/app/sections.ts:31:39
 const fallbacks: Section[] = [notFound]
 
 export const sectionRoutes = (): RouteRecordRaw[] =>
-  [...sections, ...fallbacks].flatMap((section) => section.routes ?? [])
+  [...sections, ...fallbacks].flatMap(() => undefined)
 
 export const installSectionMessages = (): void => {
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/wiring.spec.ts (0 test)

 ❯ src/app/__tests__/guards.spec.ts (7 tests | 7 failed) 230ms
   ❯ who is let where (7)
     × sends a visitor with no session to sign in, carrying where they were going 182ms

[Survived] BlockStatement
src/app/sections.ts:33:51
 export const sectionRoutes = (): RouteRecordRaw[] =>
   [...sections, ...fallbacks].flatMap((section) => section.routes ?? [])
 
-export const installSectionMessages = (): void => {
-  addMessages(authMessages)
-  for (const section of sections) {
-    if (section.messages) addMessages(section.messages)
-  }
-}
+export const installSectionMessages = (): void => {}
 

[Survived] CallExpression
src/app/sections.ts:34:3
   [...sections, ...fallbacks].flatMap((section) => section.routes ?? [])
 
 export const installSectionMessages = (): void => {
-  addMessages(authMessages)
+  ;
   for (const section of sections) {
     if (section.messages) addMessages(section.messages)

[Survived] BlockStatement
src/app/sections.ts:35:35
 
 export const installSectionMessages = (): void => {
   addMessages(authMessages)
-  for (const section of sections) {
-    if (section.messages) addMessages(section.messages)
-  }
+  for (const section of sections) {}
 }
 

[Survived] ConditionalExpression
src/app/sections.ts:36:9
 export const installSectionMessages = (): void => {
   addMessages(authMessages)
   for (const section of sections) {
-    if (section.messages) addMessages(section.messages)
+    if (true) addMessages(section.messages)
   }
 }

[Survived] ConditionalExpression
src/app/sections.ts:36:9
 export const installSectionMessages = (): void => {
   addMessages(authMessages)
   for (const section of sections) {
-    if (section.messages) addMessages(section.messages)
+    if (false) addMessages(section.messages)
   }
 }
