[Survived] StringLiteral
src/app/site.ts:14:17
  * replaces this one, that image is written whole on every committed write,
  * which is also why only one tab may write it.
  */
-const DB_NAME = 'vidya'
+const DB_NAME = ""
 
 export const openSite = (): Promise<IDatabase> => useSqlJsPersistence().open(DB_NAME)

[Survived] ArrowFunction
src/app/site.ts:16:25
  */
 const DB_NAME = 'vidya'
 
-export const openSite = (): Promise<IDatabase> => useSqlJsPersistence().open(DB_NAME)
+export const openSite = () => undefined
 
 /**

[Survived] ArrowFunction
src/app/site.ts:28:28
  * empty for a moment, it is empty and wrong, and a student cannot tell that
  * apart from having no courses.
  */
-export const migrateSite = (db: IDatabase): Promise<void> =>
-  runMigrations(db, deviceMigrations, () => toIsoDateTime(new Date()))
+export const migrateSite = () => undefined
 

[Survived] ArrowFunction
src/app/site.ts:29:39
  * apart from having no courses.
  */
 export const migrateSite = (db: IDatabase): Promise<void> =>
-  runMigrations(db, deviceMigrations, () => toIsoDateTime(new Date()))
+  runMigrations(db, deviceMigrations, () => undefined)
 
