[Survived] BlockStatement
src/app/startupFailure.ts:18:60
 const TITLE = 'Не удалось открыть данные'
 const TEXT = 'Хранилище браузера недоступно. Обновите страницу или откройте сайт в другом окне.'
 
-export function showStartupFailure(selector: string): void {
-  createApp({
-    render: () => h('main', { class: 'startup-failure' }, [h('h1', TITLE), h('p', TEXT)]),
-  }).mount(selector)
-}
+export function showStartupFailure(selector: string): void {}
 

[Survived] ArrowFunction
src/app/startupFailure.ts:20:13
 
 export function showStartupFailure(selector: string): void {
   createApp({
-    render: () => h('main', { class: 'startup-failure' }, [h('h1', TITLE), h('p', TEXT)]),
+    render: () => undefined,
   }).mount(selector)
 }

[Survived] StringLiteral
src/app/startupFailure.ts:20:38
 
 export function showStartupFailure(selector: string): void {
   createApp({
-    render: () => h('main', { class: 'startup-failure' }, [h('h1', TITLE), h('p', TEXT)]),
+    render: () => h('main', { class: "" }, [h('h1', TITLE), h('p', TEXT)]),
   }).mount(selector)
 }
