[Killed] BlockStatement
src/app/sync.ts:51:77
   let running: RunningSync | undefined
   let queue: Promise<void> = Promise.resolve()
 
-  const swap = async (connection: Connection | undefined): Promise<void> => {
-    running?.stop()
-    running = undefined
-    if (connection === undefined) return
-
-    running = await startSiteSync(options, connection)
-  }
+  const swap = async (connection: Connection | undefined): Promise<void> => {}
 
   const unwatch = watch(
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/sync.spec.ts (6 tests | 4 failed) 8484ms
   ❯ the engine of the writing tab (6)
     × runs as soon as there is a connection to run over 1702ms
     × tells the screens a run has completed, so an empty list means empty 1176ms
     × runs again when the network

[Killed] OptionalChaining
src/app/sync.ts:52:5
   let queue: Promise<void> = Promise.resolve()
 
   const swap = async (connection: Connection | undefined): Promise<void> => {
-    running?.stop()
+    running.stop()
     running = undefined
     if (connection === undefined) return
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6



 ❯ src/app/__tests__/sync.spec.ts (6 tests | 4 failed) 6947ms

   ❯ the engine of the writing tab (6)
     × runs as soon as there is a connection to run over 1453ms

[Killed] ConditionalExpression
src/app/sync.ts:54:9
   const swap = async (connection: Connection | undefined): Promise<void> => {
     running?.stop()
     running = undefined
-    if (connection === undefined) return
+    if (true) return
 
     running = await startSiteSync(options, connection)
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/sync.spec.ts (6 tests | 4 failed) 6345ms
   ❯ the engine of the writing tab (6)
     × runs as soon as there is a connection to run over 1563ms
     × tells the screens a run has completed, so an empty list means empty 1431ms
     × runs again when the network

[Killed] ConditionalExpression
src/app/sync.ts:54:9
   const swap = async (connection: Connection | undefined): Promise<void> => {
     running?.stop()
     running = undefined
-    if (connection === undefined) return
+    if (false) return
 
     running = await startSiteSync(options, connection)
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6



 ❯ src/app/__tests__/sync.spec.ts (6 tests | 4 failed) 6266ms
   ❯ the engine of the writing tab (6)
     × runs as soon as there is a connection to run over 1352ms
     × tells the screens a run has completed, so an empty list means empty 1253ms

[Killed] BlockStatement
src/app/sync.ts:61:21
 
   const unwatch = watch(
     useConnection().connection,
-    (connection) => {
-      // Serialised: a sign-in followed at once by another must not leave two
-      // engines started in the order their set-up happened to finish.
-      queue = queue.then(() => swap(connection))
-    },
+    (connection) => {},
     { immediate: true },
   )
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/sync.spec.ts (6 tests | 4 failed) 5364ms
   ❯ the engine of the writing tab (6)
     × runs as soon as there is a connection to run over 1316ms
     × tells the screens a run has completed, so an empty list means empty 1282ms
     × runs again when the network

[Killed] ArrowFunction
src/app/sync.ts:64:26
     (connection) => {
       // Serialised: a sign-in followed at once by another must not leave two
       // engines started in the order their set-up happened to finish.
-      queue = queue.then(() => swap(connection))
+      queue = queue.then(() => undefined)
     },
     { immediate: true },
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/sync.spec.ts (6 tests | 4 failed) 6056ms
   ❯ the engine of the writing tab (6)
     × runs as soon as there is a connection to run over 1571ms
     × tells the screens a run has completed, so an empty list means empty 1300ms
     × runs again when the network

[Survived] BooleanLiteral
src/app/sync.ts:66:18
       // engines started in the order their set-up happened to finish.
       queue = queue.then(() => swap(connection))
     },
-    { immediate: true },
+    { immediate: false },
   )
 

[Killed] BlockStatement
src/app/sync.ts:69:16
     { immediate: true },
   )
 
-  return () => {
-    unwatch()
-    running?.stop()
-    running = undefined
-  }
+  return () => {}
 }
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


(node:3013147) PromiseRejectionHandledWarning: Promise rejection was handled asynchronously (rejection id: 2)
(Use `node --trace-warnings ...` to show where the warning was created)

(node:3013147) PromiseRejectionHandledWarning: Promise rejection was handled asynchronously (reject

[Killed] CallExpression
src/app/sync.ts:70:5
   )
 
   return () => {
-    unwatch()
+    ;
     running?.stop()
     running = undefined
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


(node:3013126) PromiseRejectionHandledWarning: Promise rejection was handled asynchronously (rejection id: 2)
(Use `node --trace-warnings ...` to show where the warning was created)

(node:3013126) PromiseRejectionHandledWarning: Promise rejection was handled asynchronously (reject

[Killed] OptionalChaining
src/app/sync.ts:71:5
 
   return () => {
     unwatch()
-    running?.stop()
+    running.stop()
     running = undefined
   }
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/sync.spec.ts (6 tests | 2 failed) 1950ms
   ❯ the engine of the writing tab (6)
     × stays silent while nobody is signed in 664ms
     × stops the engine when the student signs out 388ms

[Killed] ArrowFunction
src/app/sync.ts:87:15
   const engine = createSyncEngine({
     db,
     client: createHttpSyncClient({ http }),
-    deviceId: () => deviceId.current(),
+    deviceId: () => undefined,
     ownerId: () => connection.ownerId,
     now: () => toIsoDateTime(new Date()),
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6



 ❯ src/app/__tests__/sync.spec.ts (6 tests | 4 failed) 6191ms
   ❯ the engine of the writing tab (6)
     × runs as soon as there is a connection to run over 1202ms
     × tells the screens a run has completed, so an empty list means empty 1163ms

[Killed] ArrowFunction
src/app/sync.ts:88:14
     db,
     client: createHttpSyncClient({ http }),
     deviceId: () => deviceId.current(),
-    ownerId: () => connection.ownerId,
+    ownerId: () => undefined,
     now: () => toIsoDateTime(new Date()),
     nowMs: () => Date.now(),
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/sync.spec.ts (6 tests | 4 failed) 6079ms

   ❯ the engine of the writing tab (6)
     × runs as soon as there is a connection to run over 1360ms
     × tells the screens a run has completed, so an empty list means empty 1449ms

[Survived] ArrowFunction
src/app/sync.ts:89:10
     client: createHttpSyncClient({ http }),
     deviceId: () => deviceId.current(),
     ownerId: () => connection.ownerId,
-    now: () => toIsoDateTime(new Date()),
+    now: () => undefined,
     nowMs: () => Date.now(),
     random: () => Math.random(),

[Survived] ArrowFunction
src/app/sync.ts:90:12
     deviceId: () => deviceId.current(),
     ownerId: () => connection.ownerId,
     now: () => toIsoDateTime(new Date()),
-    nowMs: () => Date.now(),
+    nowMs: () => undefined,
     random: () => Math.random(),
     refreshToken: () => renewSession(http),

[Survived] ArrowFunction
src/app/sync.ts:91:13
     ownerId: () => connection.ownerId,
     now: () => toIsoDateTime(new Date()),
     nowMs: () => Date.now(),
-    random: () => Math.random(),
+    random: () => undefined,
     refreshToken: () => renewSession(http),
   })

[Survived] ArrowFunction
src/app/sync.ts:92:19
     now: () => toIsoDateTime(new Date()),
     nowMs: () => Date.now(),
     random: () => Math.random(),
-    refreshToken: () => renewSession(http),
+    refreshToken: () => undefined,
   })
 

[Killed] BooleanLiteral
src/app/sync.ts:95:17
     refreshToken: () => renewSession(http),
   })
 
-  let stopped = false
+  let stopped = true
 
   const run = async (): Promise<void> => {
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/sync.spec.ts (6 tests | 4 failed) 5248ms
   ❯ the engine of the writing tab (6)
     × runs as soon as there is a connection to run over 1129ms
     × tells the screens a run has completed, so an empty list means empty 1076ms
     × runs again when the network

[Killed] BlockStatement
src/app/sync.ts:97:42
 
   let stopped = false
 
-  const run = async (): Promise<void> => {
-    if (stopped || !network.isOnline()) return
-
-    status.runStarted()
-    const result = await engine.runner.run()
-    status.runFinished(result.pull?.applied ?? 0, result.outcome === 'completed')
-  }
+  const run = async (): Promise<void> => {}
 
   const offOnline = network.onOnline(() => void run())
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/sync.spec.ts (6 tests | 4 failed) 5285ms
   ❯ the engine of the writing tab (6)
     × runs as soon as there is a connection to run over 1275ms
     × tells the screens a run has completed, so an empty list means empty 1237ms
     × runs again when the network

[Killed] ConditionalExpression
src/app/sync.ts:98:9
   let stopped = false
 
   const run = async (): Promise<void> => {
-    if (stopped || !network.isOnline()) return
+    if (true) return
 
     status.runStarted()
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/sync.spec.ts (6 tests | 4 failed) 4926ms
   ❯ the engine of the writing tab (6)
     × runs as soon as there is a connection to run over 1129ms
     × tells the screens a run has completed, so an empty list means empty 1078ms
     × runs again when the network

[Killed] LogicalOperator
src/app/sync.ts:98:9
   let stopped = false
 
   const run = async (): Promise<void> => {
-    if (stopped || !network.isOnline()) return
+    if (stopped && !network.isOnline()) return
 
     status.runStarted()
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6



 ❯ src/app/__tests__/sync.spec.ts (6 tests | 1 failed) 1193ms
   ❯ the engine of the writing tab (6)
     × does not spend a request where the browser says there is no network 170ms

[Survived] CallExpression
src/app/sync.ts:100:5
   const run = async (): Promise<void> => {
     if (stopped || !network.isOnline()) return
 
-    status.runStarted()
+    ;
     const result = await engine.runner.run()
     status.runFinished(result.pull?.applied ?? 0, result.outcome === 'completed')

[Killed] ConditionalExpression
src/app/sync.ts:102:51
 
     status.runStarted()
     const result = await engine.runner.run()
-    status.runFinished(result.pull?.applied ?? 0, result.outcome === 'completed')
+    status.runFinished(result.pull?.applied ?? 0, false)
   }
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/sync.spec.ts (6 tests | 1 failed) 2287ms
   ❯ the engine of the writing tab (6)
     × tells the screens a run has completed, so an empty list means empty 1079ms

[Killed] EqualityOperator
src/app/sync.ts:102:51
 
     status.runStarted()
     const result = await engine.runner.run()
-    status.runFinished(result.pull?.applied ?? 0, result.outcome === 'completed')
+    status.runFinished(result.pull?.applied ?? 0, result.outcome !== 'completed')
   }
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6



 ❯ src/app/__tests__/sync.spec.ts (6 tests | 1 failed) 2306ms
   ❯ the engine of the writing tab (6)
     × tells the screens a run has completed, so an empty list means empty 1063ms

[Killed] ArrowFunction
src/app/sync.ts:105:38
     status.runFinished(result.pull?.applied ?? 0, result.outcome === 'completed')
   }
 
-  const offOnline = network.onOnline(() => void run())
+  const offOnline = network.onOnline(() => undefined)
 
   // A database that already holds scope positions was filled by a run on some
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/sync.spec.ts (6 tests | 1 failed) 2143ms
   ❯ the engine of the writing tab (6)
     × runs again when the network comes back 1113ms

[Survived] ConditionalExpression
src/app/sync.ts:110:7
   // A database that already holds scope positions was filled by a run on some
   // other day: the courses are there, and the screens must not promise to
   // fetch them again before saying so.
-  if (await hasSynced(engine)) status.markFilled()
+  if (true) status.markFilled()
 
   void run()

[Survived] ConditionalExpression
src/app/sync.ts:110:7
   // A database that already holds scope positions was filled by a run on some
   // other day: the courses are there, and the screens must not promise to
   // fetch them again before saying so.
-  if (await hasSynced(engine)) status.markFilled()
+  if (false) status.markFilled()
 
   void run()

[Killed] BlockStatement
src/app/sync.ts:116:17
 
   return {
     engine,
-    stop: () => {
-      stopped = true
-      offOnline()
-    },
+    stop: () => {},
   }
 }
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/sync.spec.ts (6 tests | 1 failed) 1687ms
   ❯ the engine of the writing tab (6)
     × stops the engine when the student signs out 590ms

[Survived] BooleanLiteral
src/app/sync.ts:117:17
   return {
     engine,
     stop: () => {
-      stopped = true
+      stopped = false
       offOnline()
     },

[Survived] CallExpression
src/app/sync.ts:118:7
     engine,
     stop: () => {
       stopped = true
-      offOnline()
+      ;
     },
   }

[Survived] BlockStatement
src/app/sync.ts:124:74
 }
 
 /** Whether this machine has ever read anything from the server. */
-export const hasSynced = async (engine: SyncEngine): Promise<boolean> => {
-  const scopes = await engine.state.listScopes()
-  return scopes.length > 0
-}
+export const hasSynced = async (engine: SyncEngine): Promise<boolean> => {}
 

[Survived] ConditionalExpression
src/app/sync.ts:126:10
 /** Whether this machine has ever read anything from the server. */
 export const hasSynced = async (engine: SyncEngine): Promise<boolean> => {
   const scopes = await engine.state.listScopes()
-  return scopes.length > 0
+  return false
 }
 

[Survived] ConditionalExpression
src/app/sync.ts:126:10
 /** Whether this machine has ever read anything from the server. */
 export const hasSynced = async (engine: SyncEngine): Promise<boolean> => {
   const scopes = await engine.state.listScopes()
-  return scopes.length > 0
+  return true
 }
 
