[Survived] StringLiteral
src/app/writerElection.ts:2:28
 /** The lock that names the tab allowed to write the local database. */
-export const WRITER_LOCK = 'vidya.student.writer'
+export const WRITER_LOCK = ""
 
 export interface ElectWriterOptions {

[Killed] BlockStatement
src/app/writerElection.ts:53:47
   const { locks, name, onElected } = options
 
   let release = (): void => {}
-  const held = new Promise<void>((resolve) => {
-    release = resolve
-  })
+  const held = new Promise<void>((resolve) => {})
 
   const hold = async (): Promise<void> => {
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/writerElection.spec.ts (6 tests | 2 failed) 2135ms

   ❯ the one tab that writes (6)
     × hands the role to a waiting tab when the writer lets go 1028ms
     × keeps the lock while the writer holds it, and only then gives it back 1036ms

[Killed] BlockStatement
src/app/writerElection.ts:57:43
     release = resolve
   })
 
-  const hold = async (): Promise<void> => {
-    await onElected()
-    await held
-  }
+  const hold = async (): Promise<void> => {}
 
   if (locks === undefined) {
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/writerElection.spec.ts (6 tests | 1 failed) 1158ms
   ❯ the one tab that writes (6)
     × hands the role to a waiting tab when the writer lets go 1029ms

[Killed] BlockStatement
src/app/writerElection.ts:62:28
     await held
   }
 
-  if (locks === undefined) {
-    return { writes: Promise.resolve(onElected()).then(() => true), release }
-  }
+  if (locks === undefined) {}
 
   let decide: (writes: boolean) => void = () => {}
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/writerElection.spec.ts (6 tests | 1 failed) 230ms
   ❯ the one tab that writes (6)
     × writes anyway where the browser has no such lock 58ms

[Killed] ConditionalExpression
src/app/writerElection.ts:62:7
     await held
   }
 
-  if (locks === undefined) {
+  if (true) {
     return { writes: Promise.resolve(onElected()).then(() => true), release }
   }
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6



 ❯ src/app/__tests__/writerElection.spec.ts (6 tests | 3 failed) 287ms
   ❯ the one tab that writes (6)
     × refuses the second tab while the first is open 171ms
     × keeps the lock while the writer holds it, and only then gives it back 5ms

[Killed] BooleanLiteral
src/app/writerElection.ts:63:62
   }
 
   if (locks === undefined) {
-    return { writes: Promise.resolve(onElected()).then(() => true), release }
+    return { writes: Promise.resolve(onElected()).then(() => false), release }
   }
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/writerElection.spec.ts (6 tests | 1 failed) 397ms
   ❯ the one tab that writes (6)
     × writes anyway where the browser has no such lock 55ms

[Killed] ArrowFunction
src/app/writerElection.ts:63:56
   }
 
   if (locks === undefined) {
-    return { writes: Promise.resolve(onElected()).then(() => true), release }
+    return { writes: Promise.resolve(onElected()).then(() => undefined), release }
   }
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6



 ❯ src/app/__tests__/writerElection.spec.ts (6 tests | 1 failed) 215ms
   ❯ the one tab that writes (6)
     × writes anyway where the browser has no such lock 33ms

[Timeout] BlockStatement
src/app/writerElection.ts:67:52
   }
 
   let decide: (writes: boolean) => void = () => {}
-  const writes = new Promise<boolean>((resolve) => {
-    decide = resolve
-  })
+  const writes = new Promise<boolean>((resolve) => {})
 
   const requested = locks.request(name, { ifAvailable: true }, async (lock) => {

[Killed] BooleanLiteral
src/app/writerElection.ts:71:56
     decide = resolve
   })
 
-  const requested = locks.request(name, { ifAvailable: true }, async (lock) => {
+  const requested = locks.request(name, { ifAvailable: false }, async (lock) => {
     if (lock === null) {
       decide(false)
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/writerElection.spec.ts (6 tests | 2 failed) 60420ms

   ❯ the one tab that writes (6)
     × refuses the second tab while the first is open 30090ms
     × hands the role to a waiting tab when the writer lets go 30162ms

[Timeout] BlockStatement
src/app/writerElection.ts:71:80
     decide = resolve
   })
 
-  const requested = locks.request(name, { ifAvailable: true }, async (lock) => {
-    if (lock === null) {
-      decide(false)
-      return
-    }
-
-    try {
-      await onElected()
-    } finally {
-      // Settled whatever the work did, or a start-up that failed inside it
-      // would hang on a promise nothing else resolves.
-      decide(true)
-    }
-
-    await held
-  })
+  const requested = locks.request(name, { ifAvailable: true }, async (lock) => {})
 
   // A caller that does not watch `writes` — a tab taking the role over hours

[Killed] EqualityOperator
src/app/writerElection.ts:72:9
   })
 
   const requested = locks.request(name, { ifAvailable: true }, async (lock) => {
-    if (lock === null) {
+    if (lock !== null) {
       decide(false)
       return
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6



stderr | src/app/__tests__/writerElection.spec.ts > the one tab that writes > settles even when preparing the database fails inside the lock
the writing tab could not take the role Error: no schema

[Killed] BlockStatement
src/app/writerElection.ts:72:24
   })
 
   const requested = locks.request(name, { ifAvailable: true }, async (lock) => {
-    if (lock === null) {
-      decide(false)
-      return
-    }
+    if (lock === null) {}
 
     try {
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/writerElection.spec.ts (6 tests | 1 failed) 90ms
   ❯ the one tab that writes (6)
     × refuses the second tab while the first is open 17ms

[Killed] BooleanLiteral
src/app/writerElection.ts:73:14
 
   const requested = locks.request(name, { ifAvailable: true }, async (lock) => {
     if (lock === null) {
-      decide(false)
+      decide(true)
       return
     }
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/writerElection.spec.ts (6 tests | 2 failed) 1117ms
   ❯ the one tab that writes (6)
     × refuses the second tab while the first is open 18ms
     × hands the role to a waiting tab when the writer lets go 1007ms

[Killed] BlockStatement
src/app/writerElection.ts:77:9
       return
     }
 
-    try {
-      await onElected()
-    } finally {
+    try {} finally {
       // Settled whatever the work did, or a start-up that failed inside it
       // would hang on a promise nothing else resolves.
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/writerElection.spec.ts (6 tests | 1 failed) 243ms
   ❯ the one tab that writes (6)
     × lets the first tab write, and runs its work before saying so 100ms

[Timeout] BlockStatement
src/app/writerElection.ts:79:15
 
     try {
       await onElected()
-    } finally {
-      // Settled whatever the work did, or a start-up that failed inside it
-      // would hang on a promise nothing else resolves.
-      decide(true)
-    }
+    } finally {}
 
     await held

[Killed] BooleanLiteral
src/app/writerElection.ts:82:14
     } finally {
       // Settled whatever the work did, or a start-up that failed inside it
       // would hang on a promise nothing else resolves.
-      decide(true)
+      decide(false)
     }
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


stderr | src/app/__tests__/writerElection.spec.ts > the one tab that writes > settles even when preparing the database fails inside the lock
the writing tab could not take the role Error: no schema

[Survived] BlockStatement
src/app/writerElection.ts:90:44
 
   // A caller that does not watch `writes` — a tab taking the role over hours
   // later — would otherwise lose the reason inside an unhandled rejection.
-  void requested.catch((error: unknown) => {
-    console.error('the writing tab could not take the role', error)
-  })
+  void requested.catch((error: unknown) => {})
 
   void writes.then((writesHere) => {

[Survived] StringLiteral
src/app/writerElection.ts:91:19
   // A caller that does not watch `writes` — a tab taking the role over hours
   // later — would otherwise lose the reason inside an unhandled rejection.
   void requested.catch((error: unknown) => {
-    console.error('the writing tab could not take the role', error)
+    console.error("", error)
   })
 

[Killed] BlockStatement
src/app/writerElection.ts:94:36
     console.error('the writing tab could not take the role', error)
   })
 
-  void writes.then((writesHere) => {
-    if (writesHere) return
-
-    // Queued behind the tab that has it: when that tab closes, this one takes
-    // over without the student reloading anything.
-    void locks
-      .request(name, () => hold())
-      .catch((error: unknown) => {
-        console.error('the writing tab could not take the role', error)
-      })
-  })
+  void writes.then((writesHere) => {})
 
   return { writes, release }
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/writerElection.spec.ts (6 tests | 1 failed) 1128ms
   ❯ the one tab that writes (6)
     × hands the role to a waiting tab when the writer lets go 1034ms

[Killed] ConditionalExpression
src/app/writerElection.ts:95:9
   })
 
   void writes.then((writesHere) => {
-    if (writesHere) return
+    if (true) return
 
     // Queued behind the tab that has it: when that tab closes, this one takes
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/writerElection.spec.ts (6 tests | 1 failed) 1105ms
   ❯ the one tab that writes (6)
     × hands the role to a waiting tab when the writer lets go 1015ms

[Survived] ConditionalExpression
src/app/writerElection.ts:95:9
   })
 
   void writes.then((writesHere) => {
-    if (writesHere) return
+    if (false) return
 
     // Queued behind the tab that has it: when that tab closes, this one takes

[Killed] ArrowFunction
src/app/writerElection.ts:100:22
     // Queued behind the tab that has it: when that tab closes, this one takes
     // over without the student reloading anything.
     void locks
-      .request(name, () => hold())
+      .request(name, () => undefined)
       .catch((error: unknown) => {
         console.error('the writing tab could not take the role', error)
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6



 ❯ src/app/__tests__/writerElection.spec.ts (6 tests | 1 failed) 1088ms
   ❯ the one tab that writes (6)
     × hands the role to a waiting tab when the writer lets go 1009ms

[Survived] BlockStatement
src/app/writerElection.ts:101:34
     // over without the student reloading anything.
     void locks
       .request(name, () => hold())
-      .catch((error: unknown) => {
-        console.error('the writing tab could not take the role', error)
-      })
+      .catch((error: unknown) => {})
   })
 

[Survived] StringLiteral
src/app/writerElection.ts:102:23
     void locks
       .request(name, () => hold())
       .catch((error: unknown) => {
-        console.error('the writing tab could not take the role', error)
+        console.error("", error)
       })
   })

[Killed] ObjectLiteral
src/app/writerElection.ts:106:10
       })
   })
 
-  return { writes, release }
+  return {}
 }
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


stderr | src/app/__tests__/writerElection.spec.ts > the one tab that writes > settles even when preparing the database fails inside the lock
the writing tab could not take the role Error: no schema
