[Killed] ArrayDeclaration
src/pages/homework/routes.ts:4:41
 import type { RouteRecordRaw } from 'vue-router'
 
 /** Every school's homework in one list: it belongs to the person, not a school. */
-export const routes: RouteRecordRaw[] = [
-  {
-    path: '/homework',
-    name: 'homework',
-    component: () => import('./ui/HomeworkPage.vue'),
-  },
-]
+export const routes: RouteRecordRaw[] = []
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6



 ❯ src/app/__tests__/wiring.spec.ts (5 tests | 1 failed) 39ms
   ❯ the site as one thing (5)
     × points every link in the shell at a route that exists 18ms

[Killed] StringLiteral
src/pages/homework/routes.ts:6:11
 /** Every school's homework in one list: it belongs to the person, not a school. */
 export const routes: RouteRecordRaw[] = [
   {
-    path: '/homework',
+    path: "",
     name: 'homework',
     component: () => import('./ui/HomeworkPage.vue'),
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6



 ❯ src/app/__tests__/wiring.spec.ts (5 tests | 1 failed) 31ms
   ❯ the site as one thing (5)
     × points every link in the shell at a route that exists 16ms

[Killed] ArrowFunction
src/pages/homework/routes.ts:8:16
   {
     path: '/homework',
     name: 'homework',
-    component: () => import('./ui/HomeworkPage.vue'),
+    component: () => undefined,
   },
 ]
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6



stderr | src/app/__tests__/guards.spec.ts > who is let where > lets a signed-in student reach their own screens
[Vue Router warn]: uncaught error during route navigation:
TypeError: Cannot use 'in' operator to search for 'catch' in undefined
