[Killed] StringLiteral
src/pages/join/routes.ts:11:11
  */
 export const routes: RouteRecordRaw[] = [
   {
-    path: '/j/:code',
+    path: "",
     name: 'join',
     component: () => import('./ui/JoinPage.vue'),
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/guards.spec.ts (7 tests | 2 failed) 148ms
   ❯ who is let where (7)

     × asks nothing of the joining link: it is read before there is an account 23ms
     × keeps a signed-in student off the sign-in screen 34ms

[Killed] ArrowFunction
src/pages/join/routes.ts:13:16
   {
     path: '/j/:code',
     name: 'join',
-    component: () => import('./ui/JoinPage.vue'),
+    component: () => undefined,
     meta: { public: true, chrome: false },
   },
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6



stderr | src/app/__tests__/guards.spec.ts > who is let where > asks nothing of the joining link: it is read before there is an account
[Vue Router warn]: uncaught error during route navigation:
TypeError: Cannot use 'in' operator to search for 'catch' in undefined

[Killed] BooleanLiteral
src/pages/join/routes.ts:14:21
     path: '/j/:code',
     name: 'join',
     component: () => import('./ui/JoinPage.vue'),
-    meta: { public: true, chrome: false },
+    meta: { public: false, chrome: false },
   },
 ]
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6



 ❯ src/app/__tests__/guards.spec.ts (7 tests | 1 failed) 178ms

   ❯ who is let where (7)
     × asks nothing of the joining link: it is read before there is an account 15ms

[Survived] BooleanLiteral
src/pages/join/routes.ts:14:35
     path: '/j/:code',
     name: 'join',
     component: () => import('./ui/JoinPage.vue'),
-    meta: { public: true, chrome: false },
+    meta: { public: true, chrome: true },
   },
 ]
