[Killed] StringLiteral
src/pages/learning/routes.ts:11:11
 export const routes: RouteRecordRaw[] = [
   {
     path: '/',
-    name: 'learning',
+    name: "",
     component: () => import('./ui/LearningPage.vue'),
   },
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/guards.spec.ts (7 tests | 1 failed) 157ms

   ❯ who is let where (7)
     × keeps a signed-in student off the sign-in screen 21ms

[Killed] ArrowFunction
src/pages/learning/routes.ts:12:16
   {
     path: '/',
     name: 'learning',
-    component: () => import('./ui/LearningPage.vue'),
+    component: () => undefined,
   },
 ]
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


stderr | src/app/__tests__/guards.spec.ts > who is let where > keeps a signed-in student off the sign-in screen
[Vue Router warn]: uncaught error during route navigation:
TypeError: Cannot use 'in' operator to search for 'catch' in undefined
