[Killed] StringLiteral
src/pages/not-found/routes.ts:7:11
 export const routes: RouteRecordRaw[] = [
   {
     path: '/:pathMatch(.*)*',
-    name: 'not-found',
+    name: "",
     component: () => import('./ui/NotFoundPage.vue'),
     meta: { public: true },
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/guards.spec.ts (7 tests | 2 failed) 139ms

   ❯ who is let where (7)
     × refuses an identifier where a school code belongs 7ms

[Killed] ArrowFunction
src/pages/not-found/routes.ts:8:16
   {
     path: '/:pathMatch(.*)*',
     name: 'not-found',
-    component: () => import('./ui/NotFoundPage.vue'),
+    component: () => undefined,
     meta: { public: true },
   },
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


stderr | src/app/__tests__/guards.spec.ts > who is let where > refuses an identifier where a school code belongs
[Vue Router warn]: uncaught error during route navigation:
TypeError: Cannot use 'in' operator to search for 'catch' in undefined

[Killed] BooleanLiteral
src/pages/not-found/routes.ts:9:21
     path: '/:pathMatch(.*)*',
     name: 'not-found',
     component: () => import('./ui/NotFoundPage.vue'),
-    meta: { public: true },
+    meta: { public: false },
   },
 ]
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/guards.spec.ts (7 tests | 1 failed) 394ms
   ❯ who is let where (7)
     × refuses an identifier in a joining link as well, before any request 39ms
