[Survived] ArrowFunction
src/pages/school/routes.ts:14:16
   {
     path: '/s/:code',
     name: 'school',
-    component: () => import('./ui/SchoolPage.vue'),
+    component: () => undefined,
   },
   {

[Survived] ObjectLiteral
src/pages/school/routes.ts:16:3
     name: 'school',
     component: () => import('./ui/SchoolPage.vue'),
   },
-  {
-    path: '/s/:code/c/:courseId',
-    name: 'course',
-    component: () => import('./ui/CoursePage.vue'),
-  },
+  {},
   {
     path: '/s/:code/c/:courseId/l/:lessonId',

[Survived] ArrowFunction
src/pages/school/routes.ts:19:16
   {
     path: '/s/:code/c/:courseId',
     name: 'course',
-    component: () => import('./ui/CoursePage.vue'),
+    component: () => undefined,
   },
   {

[Killed] ObjectLiteral
src/pages/school/routes.ts:21:3
     name: 'course',
     component: () => import('./ui/CoursePage.vue'),
   },
-  {
-    path: '/s/:code/c/:courseId/l/:lessonId',
-    name: 'lesson',
-    component: () => import('./ui/LessonPage.vue'),
-  },
+  {},
 ]
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/guards.spec.ts (7 tests | 1 failed) 197ms
   ❯ who is let where (7)
     × opens a lesson of a school by its code 19ms

[Killed] StringLiteral
src/pages/school/routes.ts:23:11
   },
   {
     path: '/s/:code/c/:courseId/l/:lessonId',
-    name: 'lesson',
+    name: "",
     component: () => import('./ui/LessonPage.vue'),
   },
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/guards.spec.ts (7 tests | 1 failed) 310ms
   ❯ who is let where (7)
     × opens a lesson of a school by its code 50ms

[Killed] ArrowFunction
src/pages/school/routes.ts:24:16
   {
     path: '/s/:code/c/:courseId/l/:lessonId',
     name: 'lesson',
-    component: () => import('./ui/LessonPage.vue'),
+    component: () => undefined,
   },
 ]
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6



stderr | src/app/__tests__/guards.spec.ts > who is let where > opens a lesson of a school by its code
[Vue Router warn]: uncaught error during route navigation:
TypeError: Cannot use 'in' operator to search for 'catch' in undefined
