[Killed] ArrayDeclaration
src/pages/settings/routes.ts:4:41
 import type { RouteRecordRaw } from 'vue-router'
 
 /** The person's own settings, and what the site can say about its own data. */
-export const routes: RouteRecordRaw[] = [
-  {
-    path: '/settings',
-    name: 'settings',
-    component: () => import('./ui/SettingsPage.vue'),
-  },
-]
+export const routes: RouteRecordRaw[] = []
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/wiring.spec.ts (5 tests | 1 failed) 32ms

   ❯ the site as one thing (5)
     × points every link in the shell at a route that exists 16ms

[Survived] StringLiteral
src/pages/settings/routes.ts:7:11
 export const routes: RouteRecordRaw[] = [
   {
     path: '/settings',
-    name: 'settings',
+    name: "",
     component: () => import('./ui/SettingsPage.vue'),
   },

[Survived] ArrowFunction
src/pages/settings/routes.ts:8:16
   {
     path: '/settings',
     name: 'settings',
-    component: () => import('./ui/SettingsPage.vue'),
+    component: () => undefined,
   },
 ]
