[Killed] BlockStatement
src/shared/api/useHttp.ts:13:42
  */
 export const httpClientKey: InjectionKey<HttpClient> = Symbol('vidya.httpClient')
 
-export const useHttp = (): HttpClient => {
-  const client = inject(httpClientKey, null)
-  if (client === null) throw new Error('no transport was provided to this application')
-
-  return client
-}
+export const useHttp = (): HttpClient => {}
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6



 ❯ src/features/auth-otp/__tests__/signInSession.spec.ts (4 tests | 4 failed) 163ms
   ❯ signing in with a code (4)
     × leaves the tokens where the sync engine reads them 110ms
     × asks the server whose tokens these are, because the rows are keyed by it 15ms

[Killed] ConditionalExpression
src/shared/api/useHttp.ts:15:7
 
 export const useHttp = (): HttpClient => {
   const client = inject(httpClientKey, null)
-  if (client === null) throw new Error('no transport was provided to this application')
+  if (true) throw new Error('no transport was provided to this application')
 
   return client
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


stderr | src/features/auth-otp/__tests__/signInSession.spec.ts > signing in with a code > leaves the tokens where the sync engine reads them
[Vue warn]: Invalid vnode type when creating vnode: undefined.

[Killed] EqualityOperator
src/shared/api/useHttp.ts:15:7
 
 export const useHttp = (): HttpClient => {
   const client = inject(httpClientKey, null)
-  if (client === null) throw new Error('no transport was provided to this application')
+  if (client !== null) throw new Error('no transport was provided to this application')
 
   return client
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


stderr | src/features/auth-otp/__tests__/signInSession.spec.ts > signing in with a code > leaves the tokens where the sync engine reads them
[Vue warn]: Invalid vnode type when creating vnode: undefined.
