[Killed] StringLiteral
src/shared/connection/tokenStore.ts:16:24
  * server who the bearer is would be a request made before there is a token to
  * make it with.
  */
-const CONNECTION_KEY = 'vidya.student.connection'
+const CONNECTION_KEY = ""
 
 const storage = (): Storage | undefined => {
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6



 ❯ src/shared/connection/__tests__/useConnection.spec.ts (7 tests | 2 failed) 45ms
   ❯ the one connection (7)

     × comes back after a reload without the access token 16ms

[Killed] BlockStatement
src/shared/connection/tokenStore.ts:18:44
  */
 const CONNECTION_KEY = 'vidya.student.connection'
 
-const storage = (): Storage | undefined => {
-  try {
-    return window.localStorage
-    // Storage throws rather than returns null when a browser has it disabled.
-  } catch {
-    return undefined
-  }
-}
+const storage = (): Storage | undefined => {}
 
 export const readStored = (): StoredConnection | undefined => {
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/shared/connection/__tests__/useConnection.spec.ts (7 tests | 2 failed) 52ms
   ❯ the one connection (7)

     × comes back after a reload without the access token 12ms
     × takes a renewed session and keeps the new refresh token for next time 5ms

[Killed] BlockStatement
src/shared/connection/tokenStore.ts:19:7
 const CONNECTION_KEY = 'vidya.student.connection'
 
 const storage = (): Storage | undefined => {
-  try {
-    return window.localStorage
-    // Storage throws rather than returns null when a browser has it disabled.
-  } catch {
+  try {} catch {
     return undefined
   }
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/shared/connection/__tests__/useConnection.spec.ts (7 tests | 2 failed) 39ms
   ❯ the one connection (7)
     × comes back after a reload without the access token 11ms
     × takes a renewed session and keeps the new refresh token for next time 8ms

[Survived] BlockStatement
src/shared/connection/tokenStore.ts:22:11
   try {
     return window.localStorage
     // Storage throws rather than returns null when a browser has it disabled.
-  } catch {
-    return undefined
-  }
+  } catch {}
 }
 

[Killed] BlockStatement
src/shared/connection/tokenStore.ts:27:63
   }
 }
 
-export const readStored = (): StoredConnection | undefined => {
-  const raw = storage()?.getItem(CONNECTION_KEY)
-  if (!raw) return undefined
-
-  try {
-    const parsed = JSON.parse(raw) as { ownerId?: string; refreshToken?: string }
-    if (!parsed.ownerId || !parsed.refreshToken) return undefined
-
-    return { ownerId: asId<UserId>(parsed.ownerId), refreshToken: parsed.refreshToken }
-    // Anything unreadable is treated as nobody being signed in: the visitor
-    // signs in again, which is recoverable, where a throw at start-up is not.
-  } catch {
-    return undefined
-  }
-}
+export const readStored = (): StoredConnection | undefined => {}
 
 export const writeStored = (connection: StoredConnection): void => {
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/shared/connection/__tests__/useConnection.spec.ts (7 tests | 1 failed) 52ms
   ❯ the one connection (7)
     × comes back after a reload without the access token 20ms

[Survived] OptionalChaining
src/shared/connection/tokenStore.ts:28:15
 }
 
 export const readStored = (): StoredConnection | undefined => {
-  const raw = storage()?.getItem(CONNECTION_KEY)
+  const raw = storage().getItem(CONNECTION_KEY)
   if (!raw) return undefined
 

[Killed] ConditionalExpression
src/shared/connection/tokenStore.ts:29:7
 
 export const readStored = (): StoredConnection | undefined => {
   const raw = storage()?.getItem(CONNECTION_KEY)
-  if (!raw) return undefined
+  if (true) return undefined
 
   try {
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/shared/connection/__tests__/useConnection.spec.ts (7 tests | 1 failed) 35ms

   ❯ the one connection (7)
     × comes back after a reload without the access token 12ms

[Killed] BooleanLiteral
src/shared/connection/tokenStore.ts:29:7
 
 export const readStored = (): StoredConnection | undefined => {
   const raw = storage()?.getItem(CONNECTION_KEY)
-  if (!raw) return undefined
+  if (raw) return undefined
 
   try {
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/shared/connection/__tests__/useConnection.spec.ts (7 tests | 1 failed) 49ms
   ❯ the one connection (7)
     × comes back after a reload without the access token 17ms

[Killed] BlockStatement
src/shared/connection/tokenStore.ts:31:7
   const raw = storage()?.getItem(CONNECTION_KEY)
   if (!raw) return undefined
 
-  try {
-    const parsed = JSON.parse(raw) as { ownerId?: string; refreshToken?: string }
-    if (!parsed.ownerId || !parsed.refreshToken) return undefined
-
-    return { ownerId: asId<UserId>(parsed.ownerId), refreshToken: parsed.refreshToken }
-    // Anything unreadable is treated as nobody being signed in: the visitor
-    // signs in again, which is recoverable, where a throw at start-up is not.
-  } catch {
+  try {} catch {
     return undefined
   }
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/shared/connection/__tests__/useConnection.spec.ts (7 tests | 1 failed) 148ms
   ❯ the one connection (7)

     × comes back after a reload without the access token 68ms

[Killed] BooleanLiteral
src/shared/connection/tokenStore.ts:33:28
 
   try {
     const parsed = JSON.parse(raw) as { ownerId?: string; refreshToken?: string }
-    if (!parsed.ownerId || !parsed.refreshToken) return undefined
+    if (!parsed.ownerId || parsed.refreshToken) return undefined
 
     return { ownerId: asId<UserId>(parsed.ownerId), refreshToken: parsed.refreshToken }
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/shared/connection/__tests__/useConnection.spec.ts (7 tests | 1 failed) 90ms

   ❯ the one connection (7)
     × comes back after a reload without the access token 27ms

[Killed] ConditionalExpression
src/shared/connection/tokenStore.ts:33:9
 
   try {
     const parsed = JSON.parse(raw) as { ownerId?: string; refreshToken?: string }
-    if (!parsed.ownerId || !parsed.refreshToken) return undefined
+    if (true) return undefined
 
     return { ownerId: asId<UserId>(parsed.ownerId), refreshToken: parsed.refreshToken }
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6



 ❯ src/shared/connection/__tests__/useConnection.spec.ts (7 tests | 1 failed) 165ms
   ❯ the one connection (7)
     × comes back after a reload without the access token 72ms

[Survived] BlockStatement
src/shared/connection/tokenStore.ts:38:11
     return { ownerId: asId<UserId>(parsed.ownerId), refreshToken: parsed.refreshToken }
     // Anything unreadable is treated as nobody being signed in: the visitor
     // signs in again, which is recoverable, where a throw at start-up is not.
-  } catch {
-    return undefined
-  }
+  } catch {}
 }
 

[Killed] BlockStatement
src/shared/connection/tokenStore.ts:43:68
   }
 }
 
-export const writeStored = (connection: StoredConnection): void => {
-  storage()?.setItem(CONNECTION_KEY, JSON.stringify(connection))
-}
+export const writeStored = (connection: StoredConnection): void => {}
 
 export const clearStored = (): void => {
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6



 ❯ src/shared/connection/__tests__/useConnection.spec.ts (7 tests | 1 failed) 43ms
   ❯ the one connection (7)
     × takes a renewed session and keeps the new refresh token for next time 21ms

[Survived] OptionalChaining
src/shared/connection/tokenStore.ts:44:3
 }
 
 export const writeStored = (connection: StoredConnection): void => {
-  storage()?.setItem(CONNECTION_KEY, JSON.stringify(connection))
+  storage().setItem(CONNECTION_KEY, JSON.stringify(connection))
 }
 

[Killed] BlockStatement
src/shared/connection/tokenStore.ts:47:40
   storage()?.setItem(CONNECTION_KEY, JSON.stringify(connection))
 }
 
-export const clearStored = (): void => {
-  storage()?.removeItem(CONNECTION_KEY)
-}
+export const clearStored = (): void => {}
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6



 ❯ src/shared/connection/__tests__/useConnection.spec.ts (7 tests | 1 failed) 38ms
   ❯ the one connection (7)
     × leaves nothing behind when the student signs out 16ms

[Survived] OptionalChaining
src/shared/connection/tokenStore.ts:48:3
 }
 
 export const clearStored = (): void => {
-  storage()?.removeItem(CONNECTION_KEY)
+  storage().removeItem(CONNECTION_KEY)
 }
 
