[Killed] BlockStatement
src/shared/connection/useConnection.ts:30:25
   const connection = ref<Connection | undefined>(undefined)
   const offered = ref<Session | undefined>(undefined)
 
-  const restore = () => {
-    const stored = readStored()
-    if (stored === undefined) return
-
-    connection.value = {
-      baseUrl: config.apiBaseUrl,
-      ownerId: stored.ownerId,
-      session: { accessToken: '', refreshToken: stored.refreshToken },
-      needsSignIn: false,
-    }
-  }
+  const restore = () => {}
 
   /** Hands the transport the tokens a sign-in has just been given. */
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6



 ❯ src/shared/connection/__tests__/useConnection.spec.ts (7 tests | 1 failed) 66ms
   ❯ the one connection (7)

     × comes back after a reload without the access token 16ms

[Killed] ConditionalExpression
src/shared/connection/useConnection.ts:32:9
 
   const restore = () => {
     const stored = readStored()
-    if (stored === undefined) return
+    if (false) return
 
     connection.value = {
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/shared/connection/__tests__/useConnection.spec.ts (7 tests | 1 failed) 44ms
   ❯ the one connection (7)
     × treats a stored value it cannot read as nobody being signed in 10ms

[Killed] EqualityOperator
src/shared/connection/useConnection.ts:32:9
 
   const restore = () => {
     const stored = readStored()
-    if (stored === undefined) return
+    if (stored !== undefined) return
 
     connection.value = {
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6



 ❯ src/shared/connection/__tests__/useConnection.spec.ts (7 tests | 2 failed) 59ms
   ❯ the one connection (7)
     × comes back after a reload without the access token 23ms
     × treats a stored value it cannot read as nobody being signed in 7ms

[Killed] StringLiteral
src/shared/connection/useConnection.ts:37:31
     connection.value = {
       baseUrl: config.apiBaseUrl,
       ownerId: stored.ownerId,
-      session: { accessToken: '', refreshToken: stored.refreshToken },
+      session: { accessToken: "Stryker was here!", refreshToken: stored.refreshToken },
       needsSignIn: false,
     }
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/shared/connection/__tests__/useConnection.spec.ts (7 tests | 1 failed) 41ms
   ❯ the one connection (7)
     × comes back after a reload without the access token 17ms

[Survived] BooleanLiteral
src/shared/connection/useConnection.ts:38:20
       baseUrl: config.apiBaseUrl,
       ownerId: stored.ownerId,
       session: { accessToken: '', refreshToken: stored.refreshToken },
-      needsSignIn: false,
+      needsSignIn: true,
     }
   }

[Killed] BlockStatement
src/shared/connection/useConnection.ts:43:39
   }
 
   /** Hands the transport the tokens a sign-in has just been given. */
-  const offer = (session: Session) => {
-    offered.value = session
-  }
+  const offer = (session: Session) => {}
 
   const signIn = (ownerId: UserId) => {
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/shared/connection/__tests__/useConnection.spec.ts (7 tests | 4 failed) 149ms
   ❯ the one connection (7)
     × carries the offered tokens until the server says whose they are 48ms
     × takes a renewed session and keeps the new refresh token for next time 16ms
     × recor

[Killed] BlockStatement
src/shared/connection/useConnection.ts:47:39
     offered.value = session
   }
 
-  const signIn = (ownerId: UserId) => {
-    const session = offered.value
-    if (session === undefined) throw new Error('no tokens were offered to sign in with')
-
-    writeStored({ ownerId, refreshToken: session.refreshToken })
-    connection.value = { baseUrl: config.apiBaseUrl, ownerId, session, needsSignIn: false }
-    offered.value = undefined
-  }
+  const signIn = (ownerId: UserId) => {}
 
   /** Takes the session a renewal produced, or records that it was refused. */
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/shared/connection/__tests__/useConnection.spec.ts (7 tests | 3 failed) 38ms
   ❯ the one connection (7)
     × refuses to sign in with tokens nobody offered 11ms
     × takes a renewed session and keeps the new refresh token for next time 5ms
     × records a refused renewal

[Killed] EqualityOperator
src/shared/connection/useConnection.ts:49:9
 
   const signIn = (ownerId: UserId) => {
     const session = offered.value
-    if (session === undefined) throw new Error('no tokens were offered to sign in with')
+    if (session !== undefined) throw new Error('no tokens were offered to sign in with')
 
     writeStored({ ownerId, refreshToken: session.refreshToken })
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/shared/connection/__tests__/useConnection.spec.ts (7 tests | 3 failed) 34ms
   ❯ the one connection (7)
     × takes a renewed session and keeps the new refresh token for next time 8ms
     × records a refused renewal without taking away what is already here 1ms
     × leave

[Killed] ConditionalExpression
src/shared/connection/useConnection.ts:49:9
 
   const signIn = (ownerId: UserId) => {
     const session = offered.value
-    if (session === undefined) throw new Error('no tokens were offered to sign in with')
+    if (true) throw new Error('no tokens were offered to sign in with')
 
     writeStored({ ownerId, refreshToken: session.refreshToken })
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/shared/connection/__tests__/useConnection.spec.ts (7 tests | 3 failed) 32ms

   ❯ the one connection (7)
     × takes a renewed session and keeps the new refresh token for next time 8ms

[Survived] BooleanLiteral
src/shared/connection/useConnection.ts:52:85
     if (session === undefined) throw new Error('no tokens were offered to sign in with')
 
     writeStored({ ownerId, refreshToken: session.refreshToken })
-    connection.value = { baseUrl: config.apiBaseUrl, ownerId, session, needsSignIn: false }
+    connection.value = { baseUrl: config.apiBaseUrl, ownerId, session, needsSignIn: true }
     offered.value = undefined
   }

[Killed] BlockStatement
src/shared/connection/useConnection.ts:57:80
   }
 
   /** Takes the session a renewal produced, or records that it was refused. */
-  const adopt = (changes: Partial<Omit<Connection, 'baseUrl' | 'ownerId'>>) => {
-    const current = connection.value
-    if (current === undefined) return
-
-    if (changes.session) {
-      writeStored({ ownerId: current.ownerId, refreshToken: changes.session.refreshToken })
-    }
-
-    connection.value = { ...current, ...changes }
-  }
+  const adopt = (changes: Partial<Omit<Connection, 'baseUrl' | 'ownerId'>>) => {}
 
   const signOut = () => {
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/shared/connection/__tests__/useConnection.spec.ts (7 tests | 2 failed) 51ms

   ❯ the one connection (7)

     × takes a renewed session and keeps the new refresh token for next time 15ms

[Killed] ConditionalExpression
src/shared/connection/useConnection.ts:59:9
   /** Takes the session a renewal produced, or records that it was refused. */
   const adopt = (changes: Partial<Omit<Connection, 'baseUrl' | 'ownerId'>>) => {
     const current = connection.value
-    if (current === undefined) return
+    if (true) return
 
     if (changes.session) {
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/shared/connection/__tests__/useConnection.spec.ts (7 tests | 2 failed) 49ms

   ❯ the one connection (7)
     × takes a renewed session and keeps the new refresh token for next time 14ms
     × records a refused renewal without taking away what is already here 4ms

[Killed] EqualityOperator
src/shared/connection/useConnection.ts:59:9
   /** Takes the session a renewal produced, or records that it was refused. */
   const adopt = (changes: Partial<Omit<Connection, 'baseUrl' | 'ownerId'>>) => {
     const current = connection.value
-    if (current === undefined) return
+    if (current !== undefined) return
 
     if (changes.session) {
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6



 ❯ src/shared/connection/__tests__/useConnection.spec.ts (7 tests | 2 failed) 100ms

   ❯ the one connection (7)
     × takes a renewed session and keeps the new refresh token for next time 39ms

[Killed] ConditionalExpression
src/shared/connection/useConnection.ts:61:9
     const current = connection.value
     if (current === undefined) return
 
-    if (changes.session) {
+    if (false) {
       writeStored({ ownerId: current.ownerId, refreshToken: changes.session.refreshToken })
     }
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6



 ❯ src/shared/connection/__tests__/useConnection.spec.ts (7 tests | 1 failed) 45ms
   ❯ the one connection (7)
     × takes a renewed session and keeps the new refresh token for next time 17ms

[Killed] ConditionalExpression
src/shared/connection/useConnection.ts:61:9
     const current = connection.value
     if (current === undefined) return
 
-    if (changes.session) {
+    if (true) {
       writeStored({ ownerId: current.ownerId, refreshToken: changes.session.refreshToken })
     }
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/shared/connection/__tests__/useConnection.spec.ts (7 tests | 1 failed) 25ms
   ❯ the one connection (7)
     × records a refused renewal without taking away what is already here 7ms

 ❯ src/app/__tests__/connection.spec.ts (4 tests | 1 failed) 63ms

[Killed] BlockStatement
src/shared/connection/useConnection.ts:68:25
     connection.value = { ...current, ...changes }
   }
 
-  const signOut = () => {
-    clearStored()
-    connection.value = undefined
-    offered.value = undefined
-  }
+  const signOut = () => {}
 
   return {
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/shared/connection/__tests__/useConnection.spec.ts (7 tests | 3 failed) 54ms
   ❯ the one connection (7)
     × refuses to sign in with tokens nobody offered 17ms
     × leaves nothing behind when the student signs out 8ms
     × treats a stored value it cannot read as nobody

[Killed] CallExpression
src/shared/connection/useConnection.ts:69:5
   }
 
   const signOut = () => {
-    clearStored()
+    ;
     connection.value = undefined
     offered.value = undefined
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6



 ❯ src/shared/connection/__tests__/useConnection.spec.ts (7 tests | 1 failed) 67ms

   ❯ the one connection (7)
     × leaves nothing behind when the student signs out 17ms

[Killed] ObjectLiteral
src/shared/connection/useConnection.ts:74:10
     offered.value = undefined
   }
 
-  return {
-    connection,
-    session: computed(() => connection.value?.session ?? offered.value),
-    isSignedIn: computed(() => connection.value !== undefined),
-    restore,
-    offer,
-    signIn,
-    adopt,
-    signOut,
-  }
+  return {}
 })
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/shared/connection/__tests__/useConnection.spec.ts (7 tests | 7 failed) 61ms

   ❯ the one connection (7)
     × carries the offered tokens until the server says whose they are 48ms
     × refuses to sign in with tokens nobody offered 1ms

[Killed] OptionalChaining
src/shared/connection/useConnection.ts:76:29
 
   return {
     connection,
-    session: computed(() => connection.value?.session ?? offered.value),
+    session: computed(() => connection.value.session ?? offered.value),
     isSignedIn: computed(() => connection.value !== undefined),
     restore,
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/shared/connection/__tests__/useConnection.spec.ts (7 tests | 2 failed) 117ms
   ❯ the one connection (7)
     × carries the offered tokens until the server says whose they are 64ms
     × leaves nothing behind when the student signs out 2ms

[Killed] ArrowFunction
src/shared/connection/useConnection.ts:76:23
 
   return {
     connection,
-    session: computed(() => connection.value?.session ?? offered.value),
+    session: computed(() => undefined),
     isSignedIn: computed(() => connection.value !== undefined),
     restore,
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/shared/connection/__tests__/useConnection.spec.ts (7 tests | 1 failed) 35ms
   ❯ the one connection (7)
     × carries the offered tokens until the server says whose they are 22ms

 ❯ src/app/__tests__/connection.spec.ts (4 tests | 1 failed) 53ms

[Killed] ConditionalExpression
src/shared/connection/useConnection.ts:77:32
   return {
     connection,
     session: computed(() => connection.value?.session ?? offered.value),
-    isSignedIn: computed(() => connection.value !== undefined),
+    isSignedIn: computed(() => true),
     restore,
     offer,
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6



 ❯ src/shared/connection/__tests__/useConnection.spec.ts (7 tests | 1 failed) 41ms

   ❯ the one connection (7)
     × carries the offered tokens until the server says whose they are 29ms

[Killed] ArrowFunction
src/shared/connection/useConnection.ts:77:26
   return {
     connection,
     session: computed(() => connection.value?.session ?? offered.value),
-    isSignedIn: computed(() => connection.value !== undefined),
+    isSignedIn: computed(() => undefined),
     restore,
     offer,
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/shared/connection/__tests__/useConnection.spec.ts (7 tests | 2 failed) 51ms
   ❯ the one connection (7)
     × carries the offered tokens until the server says whose they are 33ms
     × records a refused renewal without taking away what is already here 3ms
