[Survived] StringLiteral
src/shared/i18n/fluent.ts:18:42
  * the other one.
  */
 export const enBundle = new FluentBundle('en')
-export const ruBundle = new FluentBundle('ru')
+export const ruBundle = new FluentBundle("")
 
 const bundles: Record<Locale, FluentBundle> = { en: enBundle, ru: ruBundle }

[Survived] BlockStatement
src/shared/i18n/fluent.ts:25:46
 /** Where the chosen language is remembered between visits. */
 const localeKey = 'vidya.locale'
 
-const remembered = (): Locale | undefined => {
-  try {
-    const stored = localStorage.getItem(localeKey)
-    return Locales.find((candidate) => candidate === stored)
-  } catch {
-    // Storage can be refused outright — a private window, a locked-down
-    // browser. A language nobody could remember is not a reason to fail.
-    return undefined
-  }
-}
+const remembered = (): Locale | undefined => {}
 
 /** The system's language when nothing was chosen here before. */

[Survived] BlockStatement
src/shared/i18n/fluent.ts:26:7
 const localeKey = 'vidya.locale'
 
 const remembered = (): Locale | undefined => {
-  try {
-    const stored = localStorage.getItem(localeKey)
-    return Locales.find((candidate) => candidate === stored)
-  } catch {
+  try {} catch {
     // Storage can be refused outright — a private window, a locked-down
     // browser. A language nobody could remember is not a reason to fail.

[Survived] ConditionalExpression
src/shared/i18n/fluent.ts:28:40
 const remembered = (): Locale | undefined => {
   try {
     const stored = localStorage.getItem(localeKey)
-    return Locales.find((candidate) => candidate === stored)
+    return Locales.find((candidate) => false)
   } catch {
     // Storage can be refused outright — a private window, a locked-down

[Survived] EqualityOperator
src/shared/i18n/fluent.ts:28:40
 const remembered = (): Locale | undefined => {
   try {
     const stored = localStorage.getItem(localeKey)
-    return Locales.find((candidate) => candidate === stored)
+    return Locales.find((candidate) => candidate !== stored)
   } catch {
     // Storage can be refused outright — a private window, a locked-down

[Survived] BlockStatement
src/shared/i18n/fluent.ts:29:11
   try {
     const stored = localStorage.getItem(localeKey)
     return Locales.find((candidate) => candidate === stored)
-  } catch {
-    // Storage can be refused outright — a private window, a locked-down
-    // browser. A language nobody could remember is not a reason to fail.
-    return undefined
-  }
+  } catch {}
 }
 

[Killed] BlockStatement
src/shared/i18n/fluent.ts:37:33
 }
 
 /** The system's language when nothing was chosen here before. */
-const preferred = (): Locale => {
-  const spoken = typeof navigator === 'undefined' ? '' : navigator.language
-  return Locales.find((candidate) => spoken.startsWith(candidate)) ?? 'ru'
-}
+const preferred = (): Locale => {}
 
 export const locale = ref<Locale>(remembered() ?? preferred())
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


stderr | src/pages/settings/__tests__/SyncState.spec.ts > what the settings screen says about the data > says a run is going on while one is
[Vue warn]: Unhandled error during execution of watcher callback


stderr | src/pages/settings/__tests__/SyncState.spec.ts > what the setting

[Killed] EqualityOperator
src/shared/i18n/fluent.ts:38:18
 
 /** The system's language when nothing was chosen here before. */
 const preferred = (): Locale => {
-  const spoken = typeof navigator === 'undefined' ? '' : navigator.language
+  const spoken = typeof navigator !== 'undefined' ? '' : navigator.language
   return Locales.find((candidate) => spoken.startsWith(candidate)) ?? 'ru'
 }
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/pages/settings/__tests__/SyncState.spec.ts (4 tests | 4 failed) 191ms
   ❯ what the settings screen says about the data (4)
     × says a run is going on while one is 124ms
     × tells a reading tab that another one keeps the data up to date 22ms
     × says which promise t

[Killed] ConditionalExpression
src/shared/i18n/fluent.ts:38:18
 
 /** The system's language when nothing was chosen here before. */
 const preferred = (): Locale => {
-  const spoken = typeof navigator === 'undefined' ? '' : navigator.language
+  const spoken = true ? '' : navigator.language
   return Locales.find((candidate) => spoken.startsWith(candidate)) ?? 'ru'
 }
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/pages/settings/__tests__/SyncState.spec.ts (4 tests | 4 failed) 247ms
   ❯ what the settings screen says about the data (4)
     × says a run is going on while one is 140ms
     × tells a reading tab that another one keeps the data up to date 57ms
     × says which promise t

[Killed] LogicalOperator
src/shared/i18n/fluent.ts:39:10
 /** The system's language when nothing was chosen here before. */
 const preferred = (): Locale => {
   const spoken = typeof navigator === 'undefined' ? '' : navigator.language
-  return Locales.find((candidate) => spoken.startsWith(candidate)) ?? 'ru'
+  return Locales.find(candidate => spoken.startsWith(candidate)) && 'ru'
 }
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6



 ❯ src/pages/settings/__tests__/SyncState.spec.ts (4 tests | 4 failed) 159ms
   ❯ what the settings screen says about the data (4)
     × says a run is going on while one is 105ms
     × tells a reading tab that another one keeps the data up to date 19ms

[Killed] MethodExpression
src/shared/i18n/fluent.ts:39:38
 /** The system's language when nothing was chosen here before. */
 const preferred = (): Locale => {
   const spoken = typeof navigator === 'undefined' ? '' : navigator.language
-  return Locales.find((candidate) => spoken.startsWith(candidate)) ?? 'ru'
+  return Locales.find((candidate) => spoken.endsWith(candidate)) ?? 'ru'
 }
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/pages/settings/__tests__/SyncState.spec.ts (4 tests | 4 failed) 174ms
   ❯ what the settings screen says about the data (4)
     × says a run is going on while one is 115ms
     × tells a reading tab that another one keeps the data up to date 19ms
     × says which promise t

[Killed] LogicalOperator
src/shared/i18n/fluent.ts:42:35
   return Locales.find((candidate) => spoken.startsWith(candidate)) ?? 'ru'
 }
 
-export const locale = ref<Locale>(remembered() ?? preferred())
+export const locale = ref<Locale>(remembered() && preferred())
 
 export const fluent = createFluentVue({ bundles: [bundles[locale.value]] })
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6



stderr | src/pages/settings/__tests__/SyncState.spec.ts > what the settings screen says about the data > says a run is going on while one is
[Vue warn]: Unhandled error during execution of watcher callback

stderr | src/pages/settings/__tests__/SyncState.spec.ts > what the setting

[Killed] BlockStatement
src/shared/i18n/fluent.ts:47:26
 export const fluent = createFluentVue({ bundles: [bundles[locale.value]] })
 
 /** Switching is a bundle swap, so the screen re-renders without a reload. */
-watch(locale, (value) => {
-  fluent.bundles = [bundles[value]]
-
-  try {
-    localStorage.setItem(localeKey, value)
-  } catch {
-    // The language still changed; it just will not survive the next visit.
-  }
-})
+watch(locale, (value) => {})
 
 /** Adds a slice's translations to both bundles at once. */
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6



 ❯ src/shared/i18n/__tests__/fluent.spec.ts (6 tests | 1 failed) 65ms
   ❯ fluent bundles (6)
     × swaps the active bundle when the language changes 43ms

[Survived] BlockStatement
src/shared/i18n/fluent.ts:50:7
 watch(locale, (value) => {
   fluent.bundles = [bundles[value]]
 
-  try {
-    localStorage.setItem(localeKey, value)
-  } catch {
+  try {} catch {
     // The language still changed; it just will not survive the next visit.
   }

[Survived] CallExpression
src/shared/i18n/fluent.ts:51:5
   fluent.bundles = [bundles[value]]
 
   try {
-    localStorage.setItem(localeKey, value)
+    ;
   } catch {
     // The language still changed; it just will not survive the next visit.

[Killed] BlockStatement
src/shared/i18n/fluent.ts:58:64
 })
 
 /** Adds a slice's translations to both bundles at once. */
-export const addMessages = (messages: LocaleMessages): void => {
-  enBundle.addResource(new FluentResource(messages.en), { allowOverrides: true })
-  ruBundle.addResource(new FluentResource(messages.ru), { allowOverrides: true })
-}
+export const addMessages = (messages: LocaleMessages): void => {}
 
 addMessages({ en: enMessages, ru: ruMessages })
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6



 ❯ src/shared/i18n/__tests__/fluent.spec.ts (6 tests | 4 failed) 58ms
   ❯ fluent bundles (6)
     × holds English in the English bundle 41ms
     × holds Russian in the Russian bundle 3ms

[Survived] BooleanLiteral
src/shared/i18n/fluent.ts:59:75
 
 /** Adds a slice's translations to both bundles at once. */
 export const addMessages = (messages: LocaleMessages): void => {
-  enBundle.addResource(new FluentResource(messages.en), { allowOverrides: true })
+  enBundle.addResource(new FluentResource(messages.en), { allowOverrides: false })
   ruBundle.addResource(new FluentResource(messages.ru), { allowOverrides: true })
 }

[Survived] BooleanLiteral
src/shared/i18n/fluent.ts:60:75
 /** Adds a slice's translations to both bundles at once. */
 export const addMessages = (messages: LocaleMessages): void => {
   enBundle.addResource(new FluentResource(messages.en), { allowOverrides: true })
-  ruBundle.addResource(new FluentResource(messages.ru), { allowOverrides: true })
+  ruBundle.addResource(new FluentResource(messages.ru), { allowOverrides: false })
 }
 

[Killed] ObjectLiteral
src/shared/i18n/fluent.ts:63:13
   ruBundle.addResource(new FluentResource(messages.ru), { allowOverrides: true })
 }
 
-addMessages({ en: enMessages, ru: ruMessages })
+addMessages({})
 
 /**
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6



 ❯ src/shared/i18n/__tests__/fluent.spec.ts (6 tests | 3 failed) 69ms
   ❯ fluent bundles (6)
     × holds English in the English bundle 30ms
     × holds Russian in the Russian bundle 4ms

[Survived] BlockStatement
src/shared/i18n/fluent.ts:71:51
  * Almost everything is translated in a template through `$t`. What is not is
  * the text of something said by a layer with no template of its own.
  */
-export const translate = (key: string): string => {
-  const bundle = bundles[locale.value]
-  const message = bundle.getMessage(key)
-  return message?.value ? bundle.formatPattern(message.value) : key
-}
+export const translate = (key: string): string => {}
 

[Survived] OptionalChaining
src/shared/i18n/fluent.ts:74:10
 export const translate = (key: string): string => {
   const bundle = bundles[locale.value]
   const message = bundle.getMessage(key)
-  return message?.value ? bundle.formatPattern(message.value) : key
+  return message.value ? bundle.formatPattern(message.value) : key
 }
 
