[Killed] ObjectLiteral
src/shared/lib/clock.ts:12:35
   schedule(work: () => void, delayMs: number): Scheduled
 }
 
-export const systemClock: Clock = {
-  schedule: (work, delayMs) => {
-    const handle = setTimeout(work, delayMs)
-    return { cancel: () => clearTimeout(handle) }
-  },
-}
+export const systemClock: Clock = {}
 
 /** A clock whose time only moves when a test or a story moves it. */
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/features/auth-otp/__tests__/signInSession.spec.ts (4 tests | 4 failed) 605ms
   ❯ signing in with a code (4)
     × leaves the tokens where the sync engine reads them 451ms
     × asks the server whose tokens these are, because the rows are keyed by it 57ms
     × keeps the

[Survived] BlockStatement
src/shared/lib/clock.ts:13:32
 }
 
 export const systemClock: Clock = {
-  schedule: (work, delayMs) => {
-    const handle = setTimeout(work, delayMs)
-    return { cancel: () => clearTimeout(handle) }
-  },
+  schedule: (work, delayMs) => {},
 }
 

[Survived] ArrowFunction
src/shared/lib/clock.ts:15:22
 export const systemClock: Clock = {
   schedule: (work, delayMs) => {
     const handle = setTimeout(work, delayMs)
-    return { cancel: () => clearTimeout(handle) }
+    return { cancel: () => undefined }
   },
 }

[Killed] ArrayDeclaration
src/shared/lib/clock.ts:21:53
 
 /** A clock whose time only moves when a test or a story moves it. */
 export const manualClock = () => {
-  let pending: { work: () => void; at: number }[] = []
+  let pending: { work: () => void; at: number }[] = ["Stryker was here"]
   let elapsed = 0
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


stderr | src/features/auth-otp/__tests__/useResendCountdown.spec.ts > useResendCountdown > stops itself at zero rather than counting past it
[Vue warn] onScopeDispose() is called when there is no active effect scope to be associated with.

stderr | src/features/auth-otp/__tests__/u

[Killed] BlockStatement
src/shared/lib/clock.ts:24:70
   let pending: { work: () => void; at: number }[] = []
   let elapsed = 0
 
-  const schedule = (work: () => void, delayMs: number): Scheduled => {
-    const entry = { work, at: elapsed + delayMs }
-    pending.push(entry)
-    return { cancel: () => (pending = pending.filter((held) => held !== entry)) }
-  }
+  const schedule = (work: () => void, delayMs: number): Scheduled => {}
 
   // Time moves to each piece of work in turn rather than to the end of the
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


stderr | src/features/auth-otp/__tests__/useResendCountdown.spec.ts > useResendCountdown > counts down one second at a time
[Vue warn] onScopeDispose() is called when there is no active effect scope to be associated with.


stderr | src/features/auth-otp/__tests__/useResendCountdow

[Killed] ArithmeticOperator
src/shared/lib/clock.ts:25:31
   let elapsed = 0
 
   const schedule = (work: () => void, delayMs: number): Scheduled => {
-    const entry = { work, at: elapsed + delayMs }
+    const entry = { work, at: elapsed - delayMs }
     pending.push(entry)
     return { cancel: () => (pending = pending.filter((held) => held !== entry)) }
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6



stderr | src/features/auth-otp/__tests__/useResendCountdown.spec.ts > useResendCountdown > counts down one second at a time
[Vue warn] onScopeDispose() is called when there is no active effect scope to be associated with.

stderr | src/features/auth-otp/__tests__/useResendCountdow

[Killed] CallExpression
src/shared/lib/clock.ts:26:5
 
   const schedule = (work: () => void, delayMs: number): Scheduled => {
     const entry = { work, at: elapsed + delayMs }
-    pending.push(entry)
+    ;
     return { cancel: () => (pending = pending.filter((held) => held !== entry)) }
   }
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6



stderr | src/features/auth-otp/__tests__/useResendCountdown.spec.ts > useResendCountdown > counts down one second at a time
[Vue warn] onScopeDispose() is called when there is no active effect scope to be associated with.

stderr | src/features/auth-otp/__tests__/useResendCountdow

[Killed] ArrowFunction
src/shared/lib/clock.ts:27:22
   const schedule = (work: () => void, delayMs: number): Scheduled => {
     const entry = { work, at: elapsed + delayMs }
     pending.push(entry)
-    return { cancel: () => (pending = pending.filter((held) => held !== entry)) }
+    return { cancel: () => undefined }
   }
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6



stderr | src/features/auth-otp/__tests__/useResendCountdown.spec.ts > useResendCountdown > starts again from the top, without the old count still running
[Vue warn] onScopeDispose() is called when there is no active effect scope to be associated with.

[Killed] EqualityOperator
src/shared/lib/clock.ts:27:64
   const schedule = (work: () => void, delayMs: number): Scheduled => {
     const entry = { work, at: elapsed + delayMs }
     pending.push(entry)
-    return { cancel: () => (pending = pending.filter((held) => held !== entry)) }
+    return { cancel: () => (pending = pending.filter((held) => held === entry)) }
   }
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


stderr | src/features/auth-otp/__tests__/useResendCountdown.spec.ts > useResendCountdown > starts again from the top, without the old count still running
[Vue warn] onScopeDispose() is called when there is no active effect scope to be associated with.

stderr | src/features/auth-ot

[Killed] BlockStatement
src/shared/lib/clock.ts:33:41
   // Time moves to each piece of work in turn rather than to the end of the
   // window: work that re-arms itself — a countdown asking for the next second —
   // measures its delay from the moment it ran, as a real timer would.
-  const advance = (ms: number): void => {
-    const target = elapsed + ms
-
-    for (;;) {
-      const due = pending
-        .filter((entry) => entry.at <= target)
-        .sort((first, second) => first.at - second.at)
-
-      const next = due[0]
-      if (!next) break
-
-      pending = pending.filter((entry) => entry !== next)
-      elapsed = next.at
-      next.work()
-    }
-
-    elapsed = target
-  }
+  const advance = (ms: number): void => {}
 
   return {
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


stderr | src/features/auth-otp/__tests__/useResendCountdown.spec.ts > useResendCountdown > reads the wait as minutes and seconds
[Vue warn] onScopeDispose() is called when there is no active effect scope to be associated with.

stderr | src/features/auth-otp/__tests__/useResendCoun

[Killed] ArithmeticOperator
src/shared/lib/clock.ts:34:20
   // window: work that re-arms itself — a countdown asking for the next second —
   // measures its delay from the moment it ran, as a real timer would.
   const advance = (ms: number): void => {
-    const target = elapsed + ms
+    const target = elapsed - ms
 
     for (;;) {
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


stderr | src/features/auth-otp/__tests__/useResendCountdown.spec.ts > useResendCountdown > counts down one second at a time
[Vue warn] onScopeDispose() is called when there is no active effect scope to be associated with.

stderr | src/features/auth-otp/__tests__/useResendCountdown

[Killed] ConditionalExpression
src/shared/lib/clock.ts:36:5
   const advance = (ms: number): void => {
     const target = elapsed + ms
 
-    for (;;) {
-      const due = pending
-        .filter((entry) => entry.at <= target)
-        .sort((first, second) => first.at - second.at)
-
-      const next = due[0]
-      if (!next) break
-
-      pending = pending.filter((entry) => entry !== next)
-      elapsed = next.at
-      next.work()
-    }
+    for (; false;) {
+  const due = pending.filter(entry => entry.at <= target).sort((first, second) => first.at - second.at);
+  const next = due[0];
+  if (!next) break;
+  pending = pending.filter(entry => entry !== next);
+  elapsed = next.at;
+  next.work();
+}
 
     elapsed = target
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


stderr | src/features/auth-otp/__tests__/useResendCountdown.spec.ts > useResendCountdown > counts down one second at a time
[Vue warn] onScopeDispose() is called when there is no active effect scope to be associated with.

stderr | src/features/auth-otp/__tests__/useResendCountdown

[Timeout] BlockStatement
src/shared/lib/clock.ts:36:14
   const advance = (ms: number): void => {
     const target = elapsed + ms
 
-    for (;;) {
-      const due = pending
-        .filter((entry) => entry.at <= target)
-        .sort((first, second) => first.at - second.at)
-
-      const next = due[0]
-      if (!next) break
-
-      pending = pending.filter((entry) => entry !== next)
-      elapsed = next.at
-      next.work()
-    }
+    for (;;) {}
 
     elapsed = target

[Killed] MethodExpression
src/shared/lib/clock.ts:37:19
     const target = elapsed + ms
 
     for (;;) {
-      const due = pending
-        .filter((entry) => entry.at <= target)
+      const due = pending
         .sort((first, second) => first.at - second.at)
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


stderr | src/features/auth-otp/__tests__/useResendCountdown.spec.ts > useResendCountdown > counts down one second at a time
[Vue warn] onScopeDispose() is called when there is no active effect scope to be associated with.

stderr | src/features/auth-otp/__tests__/useResendCountdown

[Survived] MethodExpression
src/shared/lib/clock.ts:37:19
     const target = elapsed + ms
 
     for (;;) {
-      const due = pending
-        .filter((entry) => entry.at <= target)
-        .sort((first, second) => first.at - second.at)
+      const due = pending.filter(entry => entry.at <= target)
 
       const next = due[0]

[Killed] EqualityOperator
src/shared/lib/clock.ts:38:28
 
     for (;;) {
       const due = pending
-        .filter((entry) => entry.at <= target)
+        .filter((entry) => entry.at < target)
         .sort((first, second) => first.at - second.at)
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


stderr | src/features/auth-otp/__tests__/useResendCountdown.spec.ts > useResendCountdown > counts down one second at a time
[Vue warn] onScopeDispose() is called when there is no active effect scope to be associated with.

stderr | src/features/auth-otp/__tests__/useResendCountdown

[Killed] ConditionalExpression
src/shared/lib/clock.ts:38:28
 
     for (;;) {
       const due = pending
-        .filter((entry) => entry.at <= target)
+        .filter((entry) => false)
         .sort((first, second) => first.at - second.at)
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


stderr | src/features/auth-otp/__tests__/useResendCountdown.spec.ts > useResendCountdown > counts down one second at a time
[Vue warn] onScopeDispose() is called when there is no active effect scope to be associated with.

stderr | src/features/auth-otp/__tests__/useResendCountdown

[Survived] ArithmeticOperator
src/shared/lib/clock.ts:39:34
     for (;;) {
       const due = pending
         .filter((entry) => entry.at <= target)
-        .sort((first, second) => first.at - second.at)
+        .sort((first, second) => first.at + second.at)
 
       const next = due[0]

[Survived] ArrowFunction
src/shared/lib/clock.ts:39:15
     for (;;) {
       const due = pending
         .filter((entry) => entry.at <= target)
-        .sort((first, second) => first.at - second.at)
+        .sort(() => undefined)
 
       const next = due[0]

[Killed] ConditionalExpression
src/shared/lib/clock.ts:42:11
         .sort((first, second) => first.at - second.at)
 
       const next = due[0]
-      if (!next) break
+      if (false) break
 
       pending = pending.filter((entry) => entry !== next)
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


stderr | src/features/auth-otp/__tests__/useResendCountdown.spec.ts > useResendCountdown > counts down one second at a time
[Vue warn] onScopeDispose() is called when there is no active effect scope to be associated with.

stderr | src/features/auth-otp/__tests__/useResendCountdown

[Killed] ConditionalExpression
src/shared/lib/clock.ts:42:11
         .sort((first, second) => first.at - second.at)
 
       const next = due[0]
-      if (!next) break
+      if (true) break
 
       pending = pending.filter((entry) => entry !== next)
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


stderr | src/features/auth-otp/__tests__/useResendCountdown.spec.ts > useResendCountdown > counts down one second at a time
[Vue warn] onScopeDispose() is called when there is no active effect scope to be associated with.

stderr | src/features/auth-otp/__tests__/useResendCountdown

[Timeout] EqualityOperator
src/shared/lib/clock.ts:44:43
       const next = due[0]
       if (!next) break
 
-      pending = pending.filter((entry) => entry !== next)
+      pending = pending.filter((entry) => entry === next)
       elapsed = next.at
       next.work()

[Timeout] ConditionalExpression
src/shared/lib/clock.ts:44:43
       const next = due[0]
       if (!next) break
 
-      pending = pending.filter((entry) => entry !== next)
+      pending = pending.filter((entry) => true)
       elapsed = next.at
       next.work()

[Killed] CallExpression
src/shared/lib/clock.ts:46:7
 
       pending = pending.filter((entry) => entry !== next)
       elapsed = next.at
-      next.work()
+      ;
     }
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


stderr | src/features/auth-otp/__tests__/useResendCountdown.spec.ts > useResendCountdown > counts down one second at a time
[Vue warn] onScopeDispose() is called when there is no active effect scope to be associated with.

stderr | src/features/auth-otp/__tests__/useResendCountdown

[Killed] BlockStatement
src/shared/lib/clock.ts:55:19
   return {
     schedule,
     advance,
-    get pending() {
-      return pending.length
-    },
+    get pending() {},
   }
 }
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


stderr | src/features/auth-otp/__tests__/useResendCountdown.spec.ts > useResendCountdown > stops itself at zero rather than counting past it
[Vue warn] onScopeDispose() is called when there is no active effect scope to be associated with.

stderr | src/features/auth-otp/__tests__/u
