[Killed] ArrowFunction
src/shared/platform/browserNetwork.ts:11:31
  * for what it is asked here — whether to attempt a run at all — and it is why
  * a failed run is a retry rather than a claim about the network.
  */
-export const browserNetwork = (): INetworkStatus => ({
-  isOnline: () => navigator.onLine,
-
-  onOnline: (handler) => {
-    window.addEventListener('online', handler)
-    return () => window.removeEventListener('online', handler)
-  },
-})
+export const browserNetwork = () => undefined
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/shared/platform/__tests__/browserNetwork.spec.ts (2 tests | 2 failed) 23ms
   ❯ what the browser says about the network (2)
     × reports what the browser reports 14ms
     × calls back when the connection returns 3ms

[Killed] ObjectLiteral
src/shared/platform/browserNetwork.ts:11:54
  * for what it is asked here — whether to attempt a run at all — and it is why
  * a failed run is a retry rather than a claim about the network.
  */
-export const browserNetwork = (): INetworkStatus => ({
-  isOnline: () => navigator.onLine,
-
-  onOnline: (handler) => {
-    window.addEventListener('online', handler)
-    return () => window.removeEventListener('online', handler)
-  },
-})
+export const browserNetwork = (): INetworkStatus => ({})
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6



 ❯ src/shared/platform/__tests__/browserNetwork.spec.ts (2 tests | 2 failed) 123ms
   ❯ what the browser says about the network (2)
     × reports what the browser reports 97ms
     × calls back when the connection returns 19ms

[Killed] ArrowFunction
src/shared/platform/browserNetwork.ts:12:13
  * a failed run is a retry rather than a claim about the network.
  */
 export const browserNetwork = (): INetworkStatus => ({
-  isOnline: () => navigator.onLine,
+  isOnline: () => undefined,
 
   onOnline: (handler) => {
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/shared/platform/__tests__/browserNetwork.spec.ts (2 tests | 1 failed) 2900ms
   ❯ what the browser says about the network (2)
     × reports what the browser reports 2168ms

[Killed] BlockStatement
src/shared/platform/browserNetwork.ts:14:26
 export const browserNetwork = (): INetworkStatus => ({
   isOnline: () => navigator.onLine,
 
-  onOnline: (handler) => {
-    window.addEventListener('online', handler)
-    return () => window.removeEventListener('online', handler)
-  },
+  onOnline: (handler) => {},
 })
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/shared/platform/__tests__/browserNetwork.spec.ts (2 tests | 1 failed) 27ms
   ❯ what the browser says about the network (2)
     × calls back when the connection returns 13ms

[Killed] ArrowFunction
src/shared/platform/browserNetwork.ts:16:12
 
   onOnline: (handler) => {
     window.addEventListener('online', handler)
-    return () => window.removeEventListener('online', handler)
+    return () => undefined
   },
 })
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6



 ❯ src/shared/platform/__tests__/browserNetwork.spec.ts (2 tests | 1 failed) 71ms
   ❯ what the browser says about the network (2)

     × calls back when the connection returns 30ms

[Killed] StringLiteral
src/shared/platform/browserNetwork.ts:16:45
 
   onOnline: (handler) => {
     window.addEventListener('online', handler)
-    return () => window.removeEventListener('online', handler)
+    return () => window.removeEventListener("", handler)
   },
 })
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/shared/platform/__tests__/browserNetwork.spec.ts (2 tests | 1 failed) 35ms
   ❯ what the browser says about the network (2)
     × calls back when the connection returns 15ms
