[Killed] StringLiteral
src/shared/platform/localStorageDeviceId.ts:4:13
 import type { DeviceId, IDeviceId } from '@vidya/client'
 import { asId } from '@vidya/domain'
 
-const KEY = 'vidya.student.deviceId'
+const KEY = ""
 
 /**
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6



 ❯ src/shared/platform/__tests__/localStorageDeviceId.spec.ts (3 tests | 1 failed) 402ms
   ❯ the id of this installation (3)
     × mints one and keeps it 60ms

[Killed] BlockStatement
src/shared/platform/localStorageDeviceId.ts:21:38
 export class LocalStorageDeviceId implements IDeviceId {
   private cached: DeviceId | null = null
 
-  async current(): Promise<DeviceId> {
-    if (this.cached !== null) return this.cached
-
-    const stored = window.localStorage.getItem(KEY)
-    if (stored) {
-      this.cached = asId<DeviceId>(stored)
-      return this.cached
-    }
-
-    const minted = asId<DeviceId>(crypto.randomUUID())
-    window.localStorage.setItem(KEY, minted)
-    this.cached = minted
-
-    return minted
-  }
+  async current(): Promise<DeviceId> {}
 }
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/shared/platform/__tests__/localStorageDeviceId.spec.ts (3 tests | 2 failed) 55ms
   ❯ the id of this installation (3)
     × mints one and keeps it 33ms
     × gives two installations two different ids 11ms

[Killed] ConditionalExpression
src/shared/platform/localStorageDeviceId.ts:22:9
   private cached: DeviceId | null = null
 
   async current(): Promise<DeviceId> {
-    if (this.cached !== null) return this.cached
+    if (true) return this.cached
 
     const stored = window.localStorage.getItem(KEY)
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/shared/platform/__tests__/localStorageDeviceId.spec.ts (3 tests | 2 failed) 90ms
   ❯ the id of this installation (3)
     × mints one and keeps it 67ms
     × gives two installations two different ids 17ms

[Killed] EqualityOperator
src/shared/platform/localStorageDeviceId.ts:22:9
   private cached: DeviceId | null = null
 
   async current(): Promise<DeviceId> {
-    if (this.cached !== null) return this.cached
+    if (this.cached === null) return this.cached
 
     const stored = window.localStorage.getItem(KEY)
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/shared/platform/__tests__/localStorageDeviceId.spec.ts (3 tests | 2 failed) 57ms
   ❯ the id of this installation (3)
     × mints one and keeps it 32ms
     × gives two installations two different ids 19ms

[Killed] ConditionalExpression
src/shared/platform/localStorageDeviceId.ts:25:9
     if (this.cached !== null) return this.cached
 
     const stored = window.localStorage.getItem(KEY)
-    if (stored) {
+    if (true) {
       this.cached = asId<DeviceId>(stored)
       return this.cached
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/shared/platform/__tests__/localStorageDeviceId.spec.ts (3 tests | 2 failed) 93ms
   ❯ the id of this installation (3)
     × mints one and keeps it 66ms
     × gives two installations two different ids 13ms

[Killed] ConditionalExpression
src/shared/platform/localStorageDeviceId.ts:25:9
     if (this.cached !== null) return this.cached
 
     const stored = window.localStorage.getItem(KEY)
-    if (stored) {
+    if (false) {
       this.cached = asId<DeviceId>(stored)
       return this.cached
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/shared/platform/__tests__/localStorageDeviceId.spec.ts (3 tests | 1 failed) 168ms
   ❯ the id of this installation (3)
     × answers the same id on every call, and after a reload 96ms

[Killed] CallExpression
src/shared/platform/localStorageDeviceId.ts:31:5
     }
 
     const minted = asId<DeviceId>(crypto.randomUUID())
-    window.localStorage.setItem(KEY, minted)
+    ;
     this.cached = minted
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/shared/platform/__tests__/localStorageDeviceId.spec.ts (3 tests | 2 failed) 188ms
   ❯ the id of this installation (3)
     × mints one and keeps it 59ms
     × answers the same id on every call, and after a reload 17ms
