[Survived] BooleanLiteral
src/shared/status/useSiteStatus.ts:8:33
 
 export const useSiteStatus = createGlobalState((): SiteStatus => {
   const inFlight = ref(0)
-  const firstRunCompleted = ref(false)
+  const firstRunCompleted = ref(true)
   const done = ref(0)
   const writing = ref(false)

[Survived] BooleanLiteral
src/shared/status/useSiteStatus.ts:10:23
   const inFlight = ref(0)
   const firstRunCompleted = ref(false)
   const done = ref(0)
-  const writing = ref(false)
+  const writing = ref(true)
   const storage = ref<StorageDurability>('unknown')
 

[Survived] StringLiteral
src/shared/status/useSiteStatus.ts:11:42
   const firstRunCompleted = ref(false)
   const done = ref(0)
   const writing = ref(false)
-  const storage = ref<StorageDurability>('unknown')
+  const storage = ref<StorageDurability>("")
 
   const runStarted = () => {

[Killed] BlockStatement
src/shared/status/useSiteStatus.ts:13:28
   const writing = ref(false)
   const storage = ref<StorageDurability>('unknown')
 
-  const runStarted = () => {
-    inFlight.value += 1
-  }
+  const runStarted = () => {}
 
   const runFinished = (applied: number, completed: boolean) => {
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6



 ❯ src/pages/settings/__tests__/SyncState.spec.ts (4 tests | 1 failed) 547ms
   ❯ what the settings screen says about the data (4)
     × says a run is going on while one is 383ms

[Killed] AssignmentOperator
src/shared/status/useSiteStatus.ts:14:5
   const storage = ref<StorageDurability>('unknown')
 
   const runStarted = () => {
-    inFlight.value += 1
+    inFlight.value -= 1
   }
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/pages/settings/__tests__/SyncState.spec.ts (4 tests | 1 failed) 471ms
   ❯ what the settings screen says about the data (4)

     × says a run is going on while one is 282ms

[Killed] BlockStatement
src/shared/status/useSiteStatus.ts:17:64
     inFlight.value += 1
   }
 
-  const runFinished = (applied: number, completed: boolean) => {
-    inFlight.value = Math.max(0, inFlight.value - 1)
-    done.value += applied
-    if (completed) firstRunCompleted.value = true
-  }
+  const runFinished = (applied: number, completed: boolean) => {}
 
   return {
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/sync.spec.ts (6 tests | 1 failed) 2977ms
   ❯ the engine of the writing tab (6)
     × tells the screens a run has completed, so an empty list means empty 1225ms

[Killed] MethodExpression
src/shared/status/useSiteStatus.ts:18:22
   }
 
   const runFinished = (applied: number, completed: boolean) => {
-    inFlight.value = Math.max(0, inFlight.value - 1)
+    inFlight.value = Math.min(0, inFlight.value - 1)
     done.value += applied
     if (completed) firstRunCompleted.value = true
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/pages/settings/__tests__/SyncState.spec.ts (4 tests | 1 failed) 522ms
   ❯ what the settings screen says about the data (4)
     × says a run is going on while one is 432ms

[Survived] ArithmeticOperator
src/shared/status/useSiteStatus.ts:18:34
   }
 
   const runFinished = (applied: number, completed: boolean) => {
-    inFlight.value = Math.max(0, inFlight.value - 1)
+    inFlight.value = Math.max(0, inFlight.value + 1)
     done.value += applied
     if (completed) firstRunCompleted.value = true

[Survived] AssignmentOperator
src/shared/status/useSiteStatus.ts:19:5
 
   const runFinished = (applied: number, completed: boolean) => {
     inFlight.value = Math.max(0, inFlight.value - 1)
-    done.value += applied
+    done.value -= applied
     if (completed) firstRunCompleted.value = true
   }

[Killed] ConditionalExpression
src/shared/status/useSiteStatus.ts:20:9
   const runFinished = (applied: number, completed: boolean) => {
     inFlight.value = Math.max(0, inFlight.value - 1)
     done.value += applied
-    if (completed) firstRunCompleted.value = true
+    if (false) firstRunCompleted.value = true
   }
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/sync.spec.ts (6 tests | 1 failed) 5707ms
   ❯ the engine of the writing tab (6)
     × tells the screens a run has completed, so an empty list means empty 1850ms

[Killed] BooleanLiteral
src/shared/status/useSiteStatus.ts:20:46
   const runFinished = (applied: number, completed: boolean) => {
     inFlight.value = Math.max(0, inFlight.value - 1)
     done.value += applied
-    if (completed) firstRunCompleted.value = true
+    if (completed) firstRunCompleted.value = false
   }
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/app/__tests__/sync.spec.ts (6 tests | 1 failed) 6655ms
   ❯ the engine of the writing tab (6)
     × tells the screens a run has completed, so an empty list means empty 1707ms

[Killed] ArrowFunction
src/shared/status/useSiteStatus.ts:24:23
   }
 
   return {
-    syncing: computed(() => inFlight.value > 0),
+    syncing: computed(() => undefined),
     firstRunCompleted,
     done,
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/pages/settings/__tests__/SyncState.spec.ts (4 tests | 1 failed) 2446ms
   ❯ what the settings screen says about the data (4)
     × says a run is going on while one is 1553ms

[Killed] ConditionalExpression
src/shared/status/useSiteStatus.ts:24:29
   }
 
   return {
-    syncing: computed(() => inFlight.value > 0),
+    syncing: computed(() => false),
     firstRunCompleted,
     done,
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6



 ❯ src/pages/settings/__tests__/SyncState.spec.ts (4 tests | 1 failed) 1295ms
   ❯ what the settings screen says about the data (4)
     × says a run is going on while one is 1133ms

[Survived] BlockStatement
src/shared/status/useSiteStatus.ts:31:23
     storage,
     runStarted,
     runFinished,
-    markFilled: () => {
-      firstRunCompleted.value = true
-    },
+    markFilled: () => {},
     markWriting: (isWriting: boolean) => {
       writing.value = isWriting

[Survived] BooleanLiteral
src/shared/status/useSiteStatus.ts:32:33
     runStarted,
     runFinished,
     markFilled: () => {
-      firstRunCompleted.value = true
+      firstRunCompleted.value = false
     },
     markWriting: (isWriting: boolean) => {

[Survived] BlockStatement
src/shared/status/useSiteStatus.ts:34:42
     markFilled: () => {
       firstRunCompleted.value = true
     },
-    markWriting: (isWriting: boolean) => {
-      writing.value = isWriting
-    },
+    markWriting: (isWriting: boolean) => {},
     markStorage: (durability: StorageDurability) => {
       storage.value = durability

[Killed] BlockStatement
src/shared/status/useSiteStatus.ts:37:53
     markWriting: (isWriting: boolean) => {
       writing.value = isWriting
     },
-    markStorage: (durability: StorageDurability) => {
-      storage.value = durability
-    },
+    markStorage: (durability: StorageDurability) => {},
   }
 })
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-site/modules/apps/student/.stryker-tmp/sandbox-fgXpY6


 ❯ src/pages/settings/__tests__/SyncState.spec.ts (4 tests | 1 failed) 1460ms
   ❯ what the settings screen says about the data (4)
     × says which promise the browser gave about keeping the data 308ms
