[Killed] BlockStatement
src/lib/utils.ts:6:53
 
 // The one place class lists are joined. Components pass arrays from their
 // styles.ts plus whatever the caller handed down through `class`.
-export function cn(...inputs: ClassValue[]): string {
-  return twMerge(clsx(inputs))
-}
+export function cn(...inputs: ClassValue[]): string {}
 
killedBy: All tests
statusReason: RUN  v5.0.1 /home/akd/Projects/jiva-studio/vidya/source/vidya-lesson-editor/modules/libs/ui/.stryker-tmp/sandbox-8TV1Mg


 ❯ src/components/Thumbnail/Thumbnail.spec.ts (3 tests | 1 failed) 89ms
   ❯ Thumbnail (3)

     × marks the tile the author picked 25ms
